
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	СписокКнопок = "СоздатьРезервнуюКопию, ВосстановитьИзРезервнойКопии";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "КаталогДокументовПоУмолчанию");
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант());
	НаборКонстант.Прочитать();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НаборКонстант, СписокКонстант());
	
	// АдминистративныйРежим
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма);
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	УстановитьДоступностьКомандДействия();
	УстановитьДоступностьНастроекНаУстройстве();
	УстановитьДоступностьНастроекНаГлобал();
	
	КаталогДокументовПоУмолчанию = КаталогДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ РезервныеКопииНаУстройстве Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементИзМассива(ПроверяемыеРеквизиты, "КаталогРезервногоКопирования");
		
	КонецЕсли;
	
	Если НЕ РезервныеКопииГлобал Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементИзМассива(ПроверяемыеРеквизиты, "ЛогинГлобалРезервногоКопирования");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементИзМассива(ПроверяемыеРеквизиты, "ПарольГлобалРезервногоКопирования");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		// АдминистративныйРежим
		НастроитьФормуПоАдминистративномуРежиму();
		НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ОбщегоНазначенияКлиент.ПередЗакрытиемФормыНастроек(ЭтаФорма, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ПодключитьОбработчикОжидания("НастроитьФормуПоАдминистративномуРежимуКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдминистративныйРежимНажатие(Элемент)
	// АдминистративныйРежим
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РезервныеКопииНаУстройствеПриИзменении(Элемент)
	УстановитьДоступностьКомандДействия();
	УстановитьДоступностьНастроекНаУстройстве();
КонецПроцедуры

&НаКлиенте
Процедура РезервныеКопииНаГлобалДискеПриИзменении(Элемент)
	УстановитьДоступностьКомандДействия();
	УстановитьДоступностьНастроекНаГлобал();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКаталогомПоУмолчанию(Команда)
	
	КаталогРезервногоКопирования = КаталогДокументовПоУмолчанию;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРезервнуюКопию(Команда)
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
		Если НЕ Отказ Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		РезервноеКопированиеКлиент.СоздатьРезервнуюКопию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьИзРезервнойКопии(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
		Если НЕ Отказ Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		РезервноеКопированиеКлиент.ВосстановитьИзРезервнойКопии();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьНаКлиенте() Экспорт
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ)
	
	ОбщегоНазначения.СохранитьКонстантыФормы(ЭтаФорма, СписокКонстант(), Отказ);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандДействия()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СоздатьРезервнуюКопию, ВосстановитьИзРезервнойКопии", "Доступность", РезервныеКопииНаУстройстве ИЛИ РезервныеКопииГлобал);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьНастроекНаУстройстве()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "КаталогРезервногоКопирования, ГруппаКаталогПодсказка", "Доступность", РезервныеКопииНаУстройстве);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьНастроекНаГлобал()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЛогинГлобалРезервногоКопирования, ПарольГлобалРезервногоКопирования, КаталогГлобалРезервногоКопирования", "Доступность", РезервныеКопииГлобал);
	
КонецПроцедуры

&НаСервере
Функция СписокКонстант()
	
	Возврат "КаталогРезервногоКопирования, КаталогГлобалРезервногоКопирования, ЛогинГлобалРезервногоКопирования, ПарольГлобалРезервногоКопирования, РезервныеКопииНаУстройстве, РезервныеКопииГлобал";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыАдминистративныйРежим

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПоАдминистративномуРежиму()
	
	СписокТолькоПросмотр = "РезервныеКопииНаУстройстве, КаталогРезервногоКопирования, РезервныеКопииГлобал, ЛогинГлобалРезервногоКопирования, ПарольГлобалРезервногоКопирования, КаталогГлобалРезервногоКопирования";
	
	СписокДоступность = "Готово, ЗаполнитьКаталогомПоУмолчанию";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокТолькоПросмотр, "ТолькоПросмотр", НЕ АдминистративныйРежим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокДоступность, "Доступность", АдминистративныйРежим);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПоАдминистративномуРежимуКлиент()
	
	НастроитьФормуПоАдминистративномуРежиму(Истина);
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму(УстановитьРежим = Ложь)
	
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма, УстановитьРежим);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

