
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Внимание.Видимость = Ложь;
	
	НастроитьФормуПоЗначениямНастроек();
	
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "Демоверсия");
	
	Если Параметры.Свойство("ПервыйЗапуск") Тогда
		ПервыйЗапуск = Истина;
		Модифицированность = Истина;
		Элементы.Готово.Заголовок = НСтр("ru = 'Продолжить'");
	Иначе
		Элементы.Готово.Заголовок = НСтр("ru = 'Готово'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Пропустить", "Видимость", Ложь);
	КонецЕсли;
	
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант());
	НаборКонстант.Прочитать();
	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НаборКонстант, СписокКонстант());
	
	// АдминистративныйРежим
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма);
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	// Демоверсия
	НастроитьФормуДляДемоверсии();
	

	Если ЗначениеНастроекПовтИсп.ЭтоДемоверсия() И  ПервыйЗапуск Тогда
		
		ОповеститьОбИзмененииЗначенийНастроек = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		// АдминистративныйРежим
		НастроитьФормуПоАдминистративномуРежиму();
		НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
		Если ЗавершениеРаботы Тогда
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	Если ПервыйЗапуск Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыСинхронизации");
			
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначенияКлиент.ПередЗакрытиемФормыНастроек(ЭтаФорма, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ПодключитьОбработчикОжидания("НастроитьФормуПоАдминистративномуРежимуКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдминистративныйРежимНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииДанныхПриИзменении(Элемент)
	
	УстановленныйРежим = УстановленныйРежим();
	
	Если ИспользоватьОбменДанными
		И УстановленныйРежим = ПредопределенноеЗначение("Перечисление.РежимСинхронизацииДанных.Онлайн") Тогда
		
		Элементы.Внимание.Видимость = Истина;
	Иначе
		
		Элементы.Внимание.Видимость = Ложь;
		
	КонецЕсли;
	
	Если РежимСинхронизацииДанных  = ПредопределенноеЗначение("Перечисление.РежимСинхронизацииДанных.Офлайн") Тогда
		ИспользоватьОбменДанными = Истина;
		Элементы.ГруппаСинхронизацияПраво.Видимость = Ложь;
	Иначе
		ИспользоватьОбменДанными = Ложь;
		Элементы.ГруппаСинхронизацияПраво.Видимость = Истина;

	КонецЕсли;
	

	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыАдминистративныйРежим

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПоАдминистративномуРежиму()
	
	УстановленныйРежим = УстановленныйРежим();
	Если УстановленныйРежим =  ПредопределенноеЗначение("Перечисление.РежимСинхронизацииДанных.Онлайн") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСинхронизацияПраво", "Видимость", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСинхронизацияПраво", "Видимость", Ложь);
	КонецЕсли;
	
	
	СписокТолькоПросмотр = "ГруппаСинхронизацияЛево,ГруппаСинхронизацияПраво";
	СписокДоступность = "Готово";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокТолькоПросмотр, "ТолькоПросмотр", НЕ АдминистративныйРежим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокДоступность, "Доступность", АдминистративныйРежим);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПоАдминистративномуРежимуКлиент()
	
	НастроитьФормуПоАдминистративномуРежиму(Истина);
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму(УстановитьРежим = Ложь)
	
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма, УстановитьРежим);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокКонстант()
	
	Возврат "РежимСинхронизацииДанных,ИспользоватьЗаказыКлиентов,ИспользоватьОбменДанными,ПодключениеКБазе";
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановленныйРежим()

	Возврат ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("РежимСинхронизацииДанных");

КонецФункции

&НаКлиенте
Процедура СохранитьПослеПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	Отказ = Ложь;
	ИспользоватьЗаказыКлиентов = Ложь;
	СохранитьНаСервере(Отказ);
	
	Если НЕ Отказ Тогда
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
			ОбновитьИнтерфейс();

		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте() Экспорт
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Если ПервыйЗапуск Тогда
			СохранитьНаСервере(Отказ);
		Иначе
			
			УстановленныйРежим = УстановленныйРежим();
			Если ЗначениеЗаполнено(УстановленныйРежим) И НЕ РежимСинхронизацииДанных = УстановленныйРежим 
				И УстановленныйРежим = ПредопределенноеЗначение("Перечисление.РежимСинхронизацииДанных.Офлайн")
			
				Тогда
				
				ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПослеПодтверждения", ЭтотОбъект);
				ТекстВопроса = НСтр("ru = 'Будут очищены документы, справочники. Продолжить?'");
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса,РежимДиалогаВопрос.ДаНет);
				Возврат;
				
				
			Иначе
				СохранитьНаСервере(Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ)
	
	Если НЕ РежимСинхронизацииДанных = УстановленныйРежим() Тогда
		
		ОбщегоНазначения.ОчиститьБД();
		
		ОбщегоНазначения.СохранитьКонстантыФормы(ЭтаФорма, СписокКонстант(), Отказ);
	Иначе
		
		Модифицированность = Ложь;
		
	КонецЕсли;
	
	ОбщегоНазначения.СохранитьКонстантыФормы(ЭтаФорма, "ПодключениеКБазе", Отказ);

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляДемоверсии()
	
	Если ЗначениеНастроекПовтИсп.ЭтоДемоверсия() Тогда
		
		Если НЕ ЗначениеЗаполнено(РежимСинхронизацииДанных) Тогда 
			РежимСинхронизацииДанных = Перечисления.РежимСинхронизацииДанных.Онлайн;
		КонецЕсли;
		
		Элементы.Внимание.Видимость = Ложь;
		Элементы.РежимСинхронизацииДанных.Доступность = Ложь;
	Иначе
		Элементы.Демоверсия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

