
Функция СтруктураПараметровВозрата() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	
	Возврат Результат;
	
КонецФункции

Функция СтруктураСоеденения() Экспорт
	
	Возврат  ИнтеграцияТК.СтруктураСоеденения();
	
КонецФункции


Функция ПараметрыПодключения() Экспорт
	
	Возврат ИнтеграцияТК.ПараметрыПодключения();
	
КонецФункции

Функция ПараметрыАвотризации()Экспорт
	Возврат  ИнтеграцияТК.ПараметрыАвотризации();
КонецФункции


Функция СтруктураОтветаДанныхПоТовару() Экспорт
	Результат = Новый Структура("Артикул,Еденица,Номенклатура,Остаток,СпецЦена,Цена");
	
	Возврат Результат;
	
КонецФункции



Функция УстановитьПодключение()Экспорт
	
	СтруктураСоединения = ИнтеграцияТК.HTTPСоединение();
	
	Возврат СтруктураСоединения;
	
КонецФункции



