
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма,
		"КаталогДокументовПоУмолчанию,
		|МаскаПрайсЛистаПоУмолчанию,
		|ИмяФайлаОтчетаОПродажахПоУмолчанию,
		|ИДПоУмолчанию,
		|ПолныйАдресПодключения");
	
	НастроитьФормуПоЗначениямНастроек();
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант());
	НаборКонстант.Прочитать();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НаборКонстант, СписокКонстант());
	
	// АдминистративныйРежим
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма);
	ОбщегоНазначения.ВосстановитьНастройкуПользователя(Перечисления.НастройкиПользователя.ВидАдресаПодключенияWS, IPИлиСтрока);
	
	РазобратьАдресWS();
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	КаталогДокументовПоУмолчанию = КаталогДокументов();
	МаскаПрайсЛистаПоУмолчанию   = "ExportData";
	ИмяФайлаОтчетаОПродажахПоУмолчанию = "ImportData";
	ИмяФайлаНастроекПоУмолчанию = "Settings";
	ИДПоУмолчанию = "MobKas01";
	
	УстановитьТекущуюСтраницу();
	
	ОбновитьПолныйАдресПодключения();
	НастроитьОтображениеАдресаСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	Если ОповеститьОбИзмененииЗначенийНастроек Тогда
		ОбщегоНазначенияВызовСервера.СохранитьНастройкуПользователя("ВидАдресаПодключенияWS", IPИлиСтрока);
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.ПередЗакрытиемФормыНастроек(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыФайловогоОбмена = "КаталогФайловогоОбмена, МаскаФайловПрайсЛиста, ИмяФайлаОтчетаОПродажах";
	//РеквизитыОбменаWS = "ИдентификаторУстройства, ИмяБД";
	РеквизитыОбменаWS = "ИмяБД";
	РеквизитыОбменаWSАдресСервераСтрокой = "АдресСервераСтрокой";
	
	НепроверяемыеРеквизитыИдУстройства = "ИдентификаторУстройства";
	
	Если ВидТранспортаСообщенийОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
		
		НепроверяемыеРеквизиты = РеквизитыОбменаWS + "," + РеквизитыОбменаWSАдресСервераСтрокой;
		
	ИначеЕсли ВидТранспортаСообщенийОбмена = Перечисления.ВидыТранспортаСообщенийОбмена.WS Тогда
		
		НепроверяемыеРеквизиты = РеквизитыФайловогоОбмена + "," +НепроверяемыеРеквизитыИдУстройства + "," 
								+ ?(IPИлиСтрока = 0, РеквизитыОбменаWSАдресСервераСтрокой, "");
		
	Иначе
		
		НепроверяемыеРеквизиты = РеквизитыФайловогоОбмена + ","
								+ РеквизитыОбменаWS + ","
								+ РеквизитыОбменаWSАдресСервераСтрокой;
		
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(НепроверяемыеРеквизиты,,,Истина);
	
	Для Каждого НепроверяемыйРеквизит Из МассивНепроверяемыхРеквизитов Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементИзМассива(ПроверяемыеРеквизиты, НепроверяемыйРеквизит);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		// АдминистративныйРежим
		НастроитьФормуПоАдминистративномуРежиму();
		НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	ИначеЕсли ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		НастроитьФормуПоЗначениямНастроек()
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВидТранспортаСообщенийОбменаПриИзменении(Элемент)
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ПодключитьОбработчикОжидания("НастроитьФормуПоАдминистративномуРежимуКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдминистративныйРежимНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИмяБДПриИзменении(Элемент)
	
	ОбновитьПолныйАдресПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура IPИлиСтрокаПриИзменении(Элемент)
	
	ОбновитьПолныйАдресПодключения();
	НастроитьОтображениеАдресаСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераСтрокойПриИзменении(Элемент)
	ОбновитьПолныйАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура Октет1ПриИзменении(Элемент)
	ОбновитьПолныйАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура Октет2ПриИзменении(Элемент)
	ОбновитьПолныйАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура Октет3ПриИзменении(Элемент)
	ОбновитьПолныйАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура Октет4ПриИзменении(Элемент)
	ОбновитьПолныйАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ПортWSПриИзменении(Элемент)
	ОбновитьПолныйАдресПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенныйПротоколПриИзменении(Элемент)
	
	ОбновитьПолныйАдресПодключения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКаталогФайловогоОбмена(Команда)
	
	КаталогФайловогоОбмена = КаталогДокументовПоУмолчанию;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаскуПрайсЛиста(Команда)
	
	МаскаФайловПрайсЛиста = МаскаПрайсЛистаПоУмолчанию;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИмяФайлаОтчета(Команда)
	
	ИмяФайлаОтчетаОПродажах = ИмяФайлаОтчетаОПродажахПоУмолчанию; 
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИмяФайлаНастроек(Команда)
	
	ИмяФайлаНастроек = ИмяФайлаНастроекПоУмолчанию;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификаторПоУмолчанию(Команда)
	
	ИдентификаторУстройства = ИДПоУмолчанию;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	ПроверитьПодключениеНаСервере(Отказ);
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		ТекстСообщения = НСтр("ru = 'Подключение успешно установлено'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыАдминистративныйРежим

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПоАдминистративномуРежиму()
	
	СписокТолькоПросмотр = 
		"ВидТранспортаСообщенийОбмена,
		|КаталогФайловогоОбмена,
		|МаскаФайловПрайсЛиста,
		|ИмяФайлаОтчетаОПродажах,
		|ИдентификаторУстройства,
		|АдресСервераСтрокой,
		|Октет1,
		|Октет2,
		|Октет3,
		|Октет4,
		|ПортWS,
		|ИмяБД,
		|ПользовательWS,
		|ПарольWS,
		|ЗагружатьНастройки,
		|ЗащищенныйПротокол";
		
	СписокДоступность = "Готово,
		|ЗаполнитьКаталогФайловогоОбмена,
		|ЗаполнитьМаскуПрайсЛиста,
		|ЗаполнитьИмяФайлаОтчета,
		|ЗаполнитьИдентификаторПоУмолчанию,
		|IPИлиСтрока";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(
		ЭтаФорма,
		СписокТолькоПросмотр,
		"ТолькоПросмотр",
		НЕ АдминистративныйРежим
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(
		ЭтаФорма,
		СписокДоступность,
		"Доступность",
		АдминистративныйРежим
	);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПоАдминистративномуРежимуКлиент()
	
	НастроитьФормуПоАдминистративномуРежиму(Истина);
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму(УстановитьРежим = Ложь)
	
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма, УстановитьРежим);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокКонстант()
	
	Возврат "ВидТранспортаСообщенийОбмена,
	|КаталогФайловогоОбмена,
	|МаскаФайловПрайсЛиста,
	|ИмяФайлаОтчетаОПродажах,
	|ИмяФайлаНастроек,
	|ИдентификаторУстройства,
	|АдресWS,
	|ПользовательWS,
	|ПарольWS,
	|ЗагружатьНастройки";
	
КонецФункции

&НаСервере
Процедура РазобратьАдресWS()
	
	СтрокаНаЗабор = АдресWS;
	
	Если Лев(АдресWS, 5) = "https" Тогда
		ЗащищенныйПротокол = Истина;
	КонецЕсли;
	
	Если ЗащищенныйПротокол Тогда
		КоличествоСимволовПодHTTP = 9; // "https://"
	Иначе 
		КоличествоСимволовПодHTTP = 8; // "http://"
	КонецЕсли;
	
	СтрокаНаЗабор = Сред(СтрокаНаЗабор, КоличествоСимволовПодHTTP);
	ПозицияСлеша = Найти(СтрокаНаЗабор, "/");
	ИмяБД = Сред(СтрокаНаЗабор,ПозицияСлеша + 1);
	
	Если IPИлиСтрока = 0 Тогда
		
		IP = Лев(СтрокаНаЗабор, ПозицияСлеша - 1);
		
		ПозицияДвоеточия = Найти(IP, ":");
		ПортWS = Сред(IP,ПозицияДвоеточия + 1);
		
		IPБезПорта = Лев(IP, ПозицияДвоеточия - 1);
		
		IPМассив = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(IPБезПорта, ".",,Истина);
		
		СчетчикОктетов = 1;
		Для Каждого Октет Из IPМассив Цикл
			ЭтаФорма["Октет" + СчетчикОктетов] = Октет;
			СчетчикОктетов = СчетчикОктетов + 1;
		КонецЦикла;
		
		ИмяБД = Сред(СтрокаНаЗабор,ПозицияСлеша + 1);
		
	Иначе
		
		АдресСервераСтрокой = Лев(СтрокаНаЗабор,ПозицияСлеша - 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте() Экспорт
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	АдресWS = ПолныйАдресПодключения;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ)
	
	ОбщегоНазначения.СохранитьКонстантыФормы(ЭтаФорма, СписокКонстант(), Отказ);
	
	Если НЕ Отказ Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИдентификаторУстройства", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ИспользоватьОбменДанными()
	);

	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
	Если ВидТранспортаСообщенийОбмена = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE") Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.ФайловыйОбмен;
		
	ИначеЕсли ВидТранспортаСообщенийОбмена = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.WS") Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.WebСервис;
		
	Иначе
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.Пустая;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолныйАдресПодключения()
	
	Шаблон = "%http%://%АдресСервера%/%ИмяБазыДанных%";
	
	Шаблон = СтрЗаменить(Шаблон, "%http%", ?(ЗащищенныйПротокол, "https", "http"));
	
	Если IPИлиСтрока = 0 Тогда
		АдресСервераИнфо = "" + Октет1 + "." + Октет2 + "." + Октет3 + "." + Октет4 + ":" + ?(ЗначениеЗаполнено(ПортWS), Формат(ПортWS,"ЧГ=0"), 80);
	Иначе
		АдресСервераИнфо = ?(ЗначениеЗаполнено(АдресСервераСтрокой), АдресСервераСтрокой, НСтр("ru = '<Адрес сервера>'"));
	КонецЕсли;
	
	ИмяБазыДанныхИнфо = ?(ЗначениеЗаполнено(ИмяБД), ИмяБД, НСтр("ru = '<Имя базы данных>'"));
	
	ПолныйАдресПодключения = СтрЗаменить(Шаблон, "%АдресСервера%", АдресСервераИнфо);
	ПолныйАдресПодключения = СтрЗаменить(ПолныйАдресПодключения, "%ИмяБазыДанных%", ИмяБазыДанныхИнфо);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтображениеАдресаСервера()
	
	Если IPИлиСтрока = 0 Тогда
		Элементы.АдресСтрокой.Видимость = Ложь;
		Элементы.АдресIP.Видимость = Истина;
	Иначе
		
		Элементы.АдресСтрокой.Видимость = Истина;
		Элементы.АдресIP.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеНаСервере(Отказ)
	
	АдресWS = ПолныйАдресПодключения;
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СохранитьНаСервере(Отказ);
	
	СообщениеОбОшибке = "";
	Синхронизация.ПроверитьУстановитьПодключение(Отказ, СообщениеОбОшибке,Истина);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти
