		
		
		
Функция ПолучитьПолноеИмяФайла(ИмяФайла="log")
	
	ПолноеИмяФайла = КаталогДокументов()+"\ExportLog\"+ИмяФайла+".txt"; 
  Возврат ПолноеИмяФайла;
  
КонецФункции



Процедура ЗаписатьЛогФайл(Знач ИмяФайла,ТекстФайла)Экспорт 
	
	ПолноеИмяФайла = ПолучитьПолноеИмяФайла(ИмяФайла);	
	ЗаписатьBOM = Ложь;
	Поток = Новый ФайловыйПоток(ПолноеИмяФайла, РежимОткрытияФайла.Дописать);
	РазделительСтрок = Символы.ВК + Символы.ПС;
	ЗаписьТекста = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8, РазделительСтрок,,ЗаписатьBOM);
	
	ЗаписьТекста.Записать(ТекстФайла);
	ЗаписьТекста.Закрыть();
	
	Поток.Закрыть();


КонецПроцедуры

