&НаКлиенте
Перем ВыполняетсяЗакрытие;


	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	
	
	НастроитьФормуПоЗначениямНастроек();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Записать", "Видимость",Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
		Если ПользовательИнициализирован Тогда
			  ПолучитьДанныеЗагрузки_В_Машину();
			  ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Записать", "Видимость",Объект.Документы.Количество()>0);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры




////
&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован
	);
	
КонецПроцедуры   

 &НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
		
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиСканирования();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
	
КонецПроцедуры

 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры


    
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;  
	КонецЕсли;
	
	Если СтрНачинаетсяС(ПолученныйШтрихкод,"TE;") Тогда 
        ТЕИнфо = ПолучитьДанныеPKG_На_ТЕ(ПолученныйШтрихкод);
		Если ТЕИнфо.Результат Тогда
			Для Каждого КоробИД Из  ТЕИнфо.Ответ Цикл 
					ОбработатьPKG(КоробИД,Истина); 
			КонецЦикла;
		Иначе
			Сообщить("Помилка сканування ТО "+ ТЕИнфо.ОписаниеОшибки);	
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ПолученныйШтрихкод,"RK;") Тогда 
	    ТЕИнфо = ПолучитьДанныеPKG_На_РК(ПолученныйШтрихкод);
		Если ТЕИнфо.Результат Тогда
			Для Каждого Короб Из  ТЕИнфо.Ответ.МассивPKG Цикл 
					ОбработатьPKG(Короб.ИД_PKG,Истина); 
			КонецЦикла;
		Иначе
			Сообщить("Помилка сканування РК "+ ТЕИнфо.ОписаниеОшибки);	
		КонецЕсли;
	Иначе
		МСтроки =  СтрРазделить(ПолученныйШтрихкод,";");
		Если НЕ МСтроки.Количество() = 3  Тогда
			Сообщить("Відскануйте PKG");
			Возврат;
		КонецЕсли;
		
		ИД_Короб = МСтроки[0];
		ОбработатьPKG(ИД_Короб); 
	КонецЕсли;
	
	
//	ПодключитьОбработчикОжидания("Подключаемый_ТекущаяСтрока", 1,Истина);
	
	//ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", 2,Истина);

	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьPKG(ИД_Короб,СканированиеТЕ=Ложь)
	
	МассивСтрокКороб = Объект.Документы.НайтиСтроки(Новый Структура ("ИД_УП",ИД_Короб));
	Если МассивСтрокКороб.Количество() = 0 Тогда
		Сообщить("PKG немає у списку");
		Возврат;
	КонецЕсли;
	СтрокаКороб = МассивСтрокКороб[0];	
	Если СтрокаКороб.сч_скан = 1 Тогда
		Сообщить("PKG відскановано раніше");
		Возврат;
	КонецЕсли;
	
	СтрокаКороб.сч_скан = 1;
	
	МассивТочкиДоставки = Объект.Документы.НайтиСтроки(Новый Структура ("ИД_ТТН,ТЧ_Global_ID",СтрокаКороб.ИД_ТТН,СтрокаКороб.ТЧ_Global_ID));
	СЧТочка = 0;
	Для Каждого МТ Из МассивТочкиДоставки Цикл 
		
		Если МТ.Короб Тогда 
			СЧТочка = СЧТочка + МТ.сч_скан;
		КонецЕсли;
	КонецЦикла;

	МассивТочкиДоставки = Объект.Документы.НайтиСтроки(Новый Структура ("ИД_ТТН,ТЧ_Global_ID,Короб",СтрокаКороб.ИД_ТТН,СтрокаКороб.ТЧ_Global_ID,Ложь));
	СтрокаТочкаДоставки = МассивТочкиДоставки[0]; 
	СтрокаТочкаДоставки.сч_скан = СЧТочка; 
	СтрокаТочкаДоставки.ЗаписьПоСтроке2 = ?(СтрокаТочкаДоставки.РК,"ROLL CAGE ","")+"Маршрут "+Формат(СтрокаТочкаДоставки.Маршрут,"ЧЦ=3; ЧГ=")+" PKG "+Формат(СтрокаТочкаДоставки.сч_док,"ЧЦ=10; ЧГ=") + " - "+Формат(СЧТочка,"ЧЦ=10; ЧН=0; ЧГ=");
	
	МассивКоробТТН = Объект.Документы.НайтиСтроки(Новый Структура ("ИД_ТТН,Короб",СтрокаТочкаДоставки.ИД_ТТН,Истина));
    СЧТТН = 0;
	Для Каждого МТТТН Из МассивКоробТТН Цикл 
		СЧТТН = СЧТТН + МТТТН.сч_скан;
	КонецЦикла;
	
	МассивТТН = Объект.Документы.НайтиСтроки(Новый Структура ("ИД_ТТН,ТЧ_Global_ID",СтрокаТочкаДоставки.ИД_ТТН,0));
	СтрокаТТН = МассивТТН[0];
	СтрокаТТН.сч_скан = СЧТТН;
	СтрокаТТН.ЗаписьПоСтроке2 = "PKG "+Формат(СтрокаТТН.сч_док,"ЧЦ=10; ЧГ=")+" - "+Формат(СЧТТН,"ЧЦ=10; ЧН=0; ЧГ=");
	
	Если НЕ СканированиеТЕ Тогда
	
		ТекИдентификаторСтроки = СтрокаТочкаДоставки.ПолучитьИдентификатор();
		НомерСтрокиДляПодсветки = СтрокаТочкаДоставки.НомерСтроки;
		Элементы.Документы.ТекущаяСтрока = ТекИдентификаторСтроки;
	КонецЕсли;

КонецПроцедуры






&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 


&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры




//////
&НаСервере
Процедура ПолучитьДанныеЗагрузки_В_Машину()

 текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/TTNInf?uuidcom="+ПараметрыСеанса.Сотрудник_ID;

  РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
  Объект.Документы.Очистить();
  
  Если РезОтвет.Результат Тогда
	  
	 МассивДокументы = РезОтвет.Ответ; 
	 Для Каждого ДокТТН Из МассивДокументы Цикл 
		НстрокаТТН =  Объект.Документы.Добавить();
		НстрокаТТН.ИД_ТТН  = ДокТТН.ИД_ТТН;
		НстрокаТТН.Маршрут = ДокТТН.Маршрут;
		НстрокаТТН.сч_док  = ДокТТН.сч;    
		НстрокаТТН.ЗаписьПоСтроке = "Маршрут "+Формат(НстрокаТТН.Маршрут,"ЧЦ=3; ЧГ=");   
		НстрокаТТН.ЗаписьПоСтроке2 = "PKG "+Формат(НстрокаТТН.сч_док,"ЧЦ=10; ЧГ=") + " - 0";
		 Для Каждого СтрокаТочкаДоставки Из  ДокТТН.ТД Цикл 
			 НстрокаТД =  Объект.Документы.Добавить();
			 НстрокаТД.ИД_ТТН  = ДокТТН.ИД_ТТН;
			 НстрокаТД.Маршрут = ДокТТН.Маршрут;
             НстрокаТД.ТочкаДоставки = СтрокаТочкаДоставки.ТочкаДоставки; 
			 НстрокаТД.ТЧ_Global_ID = СтрокаТочкаДоставки.ТЧ_Global_ID;
             НстрокаТД.РК = СтрокаТочкаДоставки.РК;

			 НстрокаТД.сч_док  = СтрокаТочкаДоставки.счтд;
			 НстрокаТД.ЗаписьПоСтроке =  НстрокаТД.ТочкаДоставки;
			 НстрокаТД.ЗаписьПоСтроке2 =?(НстрокаТД.РК,"ROLL CAGE ","")+ "Маршрут "+Формат(НстрокаТД.Маршрут,"ЧЦ=3; ЧГ=")+" PKG "+Формат(НстрокаТД.сч_док,"ЧЦ=10; ЧГ=") + " - 0";
	 
			 Для Каждого СтрокаУпаковка Из СтрокаТочкаДоставки.ТУ Цикл 
				 НстрокаУП =  Объект.Документы.Добавить();
				 НстрокаУП.ИД_ТТН  = ДокТТН.ИД_ТТН;
				 НстрокаУП.Маршрут = ДокТТН.Маршрут;
				 НстрокаУП.ТочкаДоставки = СтрокаТочкаДоставки.ТочкаДоставки;
				 
				 НстрокаУП.ИД_УП = СтрокаУпаковка.ИД_УП;
				 НстрокаУП.СкладСборки = СтрокаУпаковка.СкладСборки;
				 НстрокаУП.НомерТУ = СтрокаУпаковка.НомерТУ;

                 НстрокаУП.сч_док = 1;
                 НстрокаУП.Короб = Истина; 
                 НстрокаУП.ТЧ_Global_ID = СтрокаТочкаДоставки.ТЧ_Global_ID; 
				 
				 НстрокаУП.ЗаписьПоСтроке =  "PKG";


				 
			 КонецЦикла;
			 
		 КонецЦикла;
		 
		 
	 КонецЦикла;
	 
	  
  Иначе
	 тОш =  ?(ЗначениеЗаполнено(РезОтвет.ОписаниеОшибки),РезОтвет.ОписаниеОшибки,"Помилка отримання даних"); 
	 
	 ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	 ОбновитьСотрудника(); 
	 Сообщить(тОш);    
  КонецЕсли;
  

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеPKG_На_ТЕ(ШК_ТЕ)
	МассивТЕ = СтрРазделить(ШК_ТЕ,";",);	 
	ТЕUUID = МассивТЕ[1]; 
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/TEinf?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ТЕUUID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);

	 Возврат РезОтвет;
КонецФункции

&НаСервере
Функция ПолучитьДанныеPKG_На_РК(ШК_РК)
	МассивРК = СтрРазделить(ШК_РК,";",);	 
	РКUUID = МассивРК[1]; 
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/RKinf?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+РКUUID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);

	 Возврат РезОтвет;
КонецФункции



&НаСервере
Функция ВыгрузитьРезультатыСканирования()
	
	СтруктураДокумента = Новый Структура; 
    СтруктураДокумента.Вставить("UUID_Сотрудник",ПараметрыСеанса.Сотрудник_ID);
	
	
	ТЧТТН = Объект.Документы.Выгрузить(,"ИД_ТТН");
	ТЧТТН.Свернуть("ИД_ТТН");
	
	МассивТТН = Новый Массив;
	Для Каждого ТекТТН из ТЧТТН Цикл 
		 МассивТТН.Добавить(ТекТТН.ИД_ТТН);
	КонецЦикла;
	СтруктураДокумента.Вставить("ТТН",МассивТТН);
	
	ТЧКОРОБ = Объект.Документы.Выгрузить(Объект.Документы.НайтиСтроки(Новый Структура("Короб",Истина)),"ИД_УП");
    МассивКороб = Новый Массив;
	
	Для Каждого ТекТЧКОРОБ из ТЧКОРОБ Цикл 
		МассивКороб.Добавить(ТекТЧКОРОБ.ИД_УП);
	КонецЦикла;
    СтруктураДокумента.Вставить("PKG",МассивКороб);
	
	парамЗапрос ="PKGloading";
 	ТекстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/"+парамЗапрос;
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента,ТекстЗапроса);	
	
	Возврат РезОтвет  
	
КонецФункции





&НаКлиенте
Процедура Подключаемый_ТекущаяСтрока()
	
	Элементы.Документы.ТекущаяСтрока = ТекИдентификаторСтроки;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура Записать(Команда)
	ОчиститьСообщения();
	Если НЕ Объект.Документы.НайтиСтроки(Новый Структура("Короб,сч_скан",Истина,0)).Количество() = 0 Тогда
		 Сообщить("Не всі PKG відскановані");
		Возврат;
	КонецЕсли;
	
	 ЗакончитьЗагрузкуАсинх();

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗакончитьЗагрузкуАсинх()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Завантажити дані сканування?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	
	РезультатВыгрузки = ВыгрузитьРезультатыСканирования();
	Если НЕ РезультатВыгрузки.Результат Тогда  
		Если НЕ ПустаяСтрока(РезультатВыгрузки.ОписаниеОшибки) Тогда
			Сообщить(РезультатВыгрузки.ОписаниеОшибки); 
		КонецЕсли;
		
		Возврат;
	КонецЕсли; 
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Документы.ТекущиеДанные;
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",СформироватьСтруктуруДляПечатиНаСервере(ТекущиеДанные.ТЧ_Global_ID,ТекущиеДанные.ИД_ТТН,ТекущиеДанные.ТочкаДоставки),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруДляПечатиНаСервере(ТЧ_Global_ID,ИД_ТТН,ТочкаДоставки)
	
	МассивСтрок = Объект.Документы.НайтиСтроки(Новый Структура("ТЧ_Global_ID,ИД_ТТН,Короб",ТЧ_Global_ID,ИД_ТТН,Истина));	 
	ТаблицаPKG = Объект.Документы.Выгрузить(МассивСтрок,"СкладСборки,НомерТУ,сч_скан");
	ТаблицаPKG.Свернуть("СкладСборки,НомерТУ","сч_скан");
	СтруктураСтрок = Новый Структура;
	СтруктураСтрок.Вставить("PKG");
	СтруктураСтрок.Вставить("ТочкаДоставки",ТочкаДоставки);
	МассивPKG = Новый Массив;
	Для Каждого ТекТаблицаPKG Из ТаблицаPKG Цикл 
		МассивPKG.Добавить(Новый Структура("СкладСборки,НомерТУ,сч_скан",ТекТаблицаPKG.СкладСборки,ТекТаблицаPKG.НомерТУ,ТекТаблицаPKG.сч_скан));
	КонецЦикла;
	СтруктураСтрок.Вставить("ДанныеPKG",МассивPKG);
	
	Возврат СтруктураСтрок;
	
КонецФункции


