

Функция ПолучитьСписокВариантовПечати(ТаблицаЦенников)Экспорт
	
	ВариантыПечати = Новый СписокЗначений;
		Для Каждого стТипы Из ТаблицаЦенников Цикл 
			тц = стТипы.СпецЦена;
			кв = Строка(стТипы.Количество);
			Если тц = "27" Тогда
				ВариантыПечати.Добавить(тц,"Жовтий - "+кв,Истина,БиблиотекаКартинок.жовтий);  
			ИначеЕсли тц = "28" Тогда
				ВариантыПечати.Добавить(тц,"Синій - "+кв,Истина,БиблиотекаКартинок.синій);	
			ИначеЕсли тц = "29"	Тогда
				ВариантыПечати.Добавить(тц,"Помаранчевий - "+кв,Истина,БиблиотекаКартинок.помаранчевий); 
			ИначеЕсли тц = "26"	Тогда
				ВариантыПечати.Добавить(тц,"Помаранчевий - "+кв,Истина,БиблиотекаКартинок.помаранчевий);
			ИначеЕсли тц = "36"	Тогда
				ВариантыПечати.Добавить(тц,"Помаранчевий - "+кв,Истина,БиблиотекаКартинок.помаранчевий); 
			ИначеЕсли тц = "37"	Тогда
				ВариантыПечати.Добавить(тц,"Синій - "+кв,Истина,БиблиотекаКартинок.синій);
			ИначеЕсли тц = "38"	Тогда
				ВариантыПечати.Добавить(тц,"Жовтий - "+кв,Истина,БиблиотекаКартинок.жовтий);  
	
			Иначе
				ВариантыПечати.Добавить(тц,"Білий - "+кв,Истина,БиблиотекаКартинок.білий);
			КонецЕсли;
		КонецЦикла;
		

	
	Возврат ВариантыПечати
	
КонецФункции
