
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВРеквизитФормы(ПолучитьИзВременногоХранилища(Параметры.АдресУслуги),"Услуга"); 
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьУслугуИЗакрыть()
	
	ТекДанные = Элементы.Услуга.ТекущиеДанные;
	Если ТекДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("Код,Наименование",ТекДанные.Код,ТекДанные.Наименование));
	
КонецПроцедуры


&НаКлиенте
Процедура УслугаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ВыбратьУслугуИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьУслугуИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура УслугаНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьУслугуИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура УслугаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ВыбратьУслугуИЗакрыть()
КонецПроцедуры

//&НаКлиенте
//Процедура УслугаПриАктивизацииСтроки(Элемент)
//	//ВыбратьУслугуИЗакрыть()
//КонецПроцедуры
