
Функция ЗаписатьРезультатВJSON(СтруктураРезультат)
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураРезультат); 
	
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаДляОтвета;
	
КонецФункции

Функция ПроверитьУстановитьПодключение()Экспорт
	
	
	РезультатОперации =  ИнтеграцияТК.HTTPСоединение();
	
	ВыполнитьЗапросHTTP(РезультатОперации,"/ping");	
	Возврат РезультатОперации;
	
КонецФункции

Функция ПечатьЦенниковОбъекта(Знач МассивТоваров) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат  ОтправитьЦенникиОбъектаНаПечать(МассивТоваров,Подразделение);
КонецФункции

Функция ПоставитьВочередьНаПечать(Табдок,ТипДокумента ="")Экспорт
	
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ОтправитьТабличнйДокумент(Табдок,Подразделение,ТипДокумента);

КонецФункции


Функция ПередатьТоварыДляЦенников(Знач МассивТоваров) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ОтправитьТоварыОбъектаДляПечати(МассивТоваров,Подразделение);
КонецФункции

Функция ЗапросПечатнаяФорма(Знач МассивТоваров) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ОтправитьЗапросПечатнаяФорма(МассивТоваров,Подразделение);
КонецФункции

Функция ПередатьДокументНаСервер(Знач Документ,Знач ТипДокумента)Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ОтправитьДокумент(ТипДокумента,Документ,Подразделение);
КонецФункции

Функция ИнициализироватьДанныеДляПечати(Знач Документ,Знач ТипДокумента)Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ОтправитьДокумент(ТипДокумента,Документ,Подразделение);
КонецФункции


Функция ПолучитьСписокДокументов(Знач Период,Знач ТипыДокументов,Контрагент)Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ПолучитьСписокДокументовТК(Подразделение,ТипыДокументов,Период,Контрагент);
КонецФункции

Функция ПолучитьДанныеДокумента(Знач ПараметрыДокумента) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ПолучитьДанныеДокументаТК(Подразделение,ПараметрыДокумента);
КонецФункции

Функция ПолучитьMarketDoc(ТипДокумента) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ПолучитьДанныеMarketDoc(Подразделение,ТипДокумента);
КонецФункции

Функция ПолучитьДанныеОбщепит(Метод,Параметр) Экспорт
	Возврат GET_Общепит(Метод,Параметр);
КонецФункции

Функция ОтправитьДанныеОбщепит(Метод,Параметр,Документ) Экспорт
	Возврат POST_Общепит(Метод,Параметр,Документ);
КонецФункции



Функция ПолучитьДанныеПоЗаказам(Знач ШтрихКод,ЭтоЗаказ = 1)Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ПолучитьСписокАктивныхЗаказов(Подразделение,ШтрихКод,ЭтоЗаказ);
КонецФункции


Функция ОтправитьТокен(ID_Устройства,Модель,НовыйТокен)Экспорт
	Возврат РозницаТК.ОтправитьТокенНаСервер(ID_Устройства,Модель,НовыйТокен);
КонецФункции


Функция ПолучитьПодразделение(Знач Преф) Экспорт
	
	Возврат ПолучитьДанныеПодразделенияТК(Преф);
		
КонецФункции


Функция ПолучитьСотрудника(Знач ШтрихКодТКС) Экспорт
	
	Возврат ПолучитьДанныеСотрудникаТК(ШтрихКодТКС);
		
КонецФункции   

Функция ПолучитьТочкуПоНомеру(НомерТТ) Экспорт
 	Возврат ПолучитьДанныеСотрудникаТК(НомерТТ);

КонецФункции


Функция ПолучитьОстатокТовара(Артикул,МРЦ,Склад)Экспорт
	
	Подразделение = ПараметрыСеанса.UUID;
    Возврат ПолучитьДанныеПоОстатукуТовара(Подразделение,Склад,Артикул,МРЦ);

КонецФункции

Функция ПроверитьМРЦТовара(Артикул,МРЦ)Экспорт
	 Возврат ПроверитьДанныеПоМЦР(Артикул,МРЦ);
КонецФункции



Функция ПолучитьДанныеПоТовару(Знач ШтрихКод,Кратко,ВерификацияЦен,ПараметрыТовара,Склад,ВозвратПоставщику) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат  ПолучитьДанныеПоТоваруТК(ШтрихКод,Подразделение,Склад,Кратко,ВерификацияЦен,ПараметрыТовара,ВозвратПоставщику);

КонецФункции

Функция ПолучитьДанныеПоТоваруМенеджерТЗ(Знач ШтрихКод) Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат  ПолучитьДанныеМенеджерТЗ(ШтрихКод,Подразделение);

КонецФункции


Функция ПолучитьДанныеСкладовПодразделения()Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат  ПолучитьДанныеСкладовТК(Подразделение);
КонецФункции

Функция ПолучитьДанныеПричинВозврата()Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/ListInfo/StVoz");
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеСтатьиВозврата(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;

	
КонецФункции


Функция ПолучитьКоличествоЗадач()Экспорт
	Подразделение = ПараметрыСеанса.UUID;
	Возврат  ДанныеПоЗадачам(Подразделение,"1");
КонецФункции


Функция ПолучитьДанныеКонтрагентаПоЕДРПО(КодЕДРПО)Экспорт
	 Возврат ПолучитьДанныеКонтрагентаПоЕДРПОТК(КодЕДРПО);
КонецФункции

Функция НакладнаяСканировки(UUID,Парам)Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		ОбновитьПовторноИспользуемыеЗначения();
		ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();
		
		Если НЕ ОбменДанными.СоединениеУстановлено Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/rn/"+UUID+"/"+Парам);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ДанныеQRТабак(UUID,ШтрихКод,Парам)Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
		
	ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		ОбновитьПовторноИспользуемыеЗначения();
		ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();
		
		Если НЕ ОбменДанными.СоединениеУстановлено Тогда
			
			Результат.Результат = Ложь;
			Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	СтруктураШк = Новый Структура("ДанныеQR",ШтрихКод);
	 	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураШк); 

	
	ОтправитьДляОбработки(ОбменДанными,"/Cod/"+UUID+"/"+Парам,ЗаписьJSON);	
	
	//ВыполнитьЗапросHTTP(ОбменДанными,"/Cod/"+UUID+"/"+ШтрихКод+"/"+Парам);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;


КонецФункции

Функция ПолучитьСтатусДоверенногоЛица(ИД)Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/StatusChek/"+ИД);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоСтатусуДоверенногоЛица(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеMarketDoc(Подразделение,ТипДокумента)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/Market/"+Подразделение+"/Doc/"+ТипДокумента);
	
		
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат,"Дата");
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;


КонецФункции



Функция ОтправитьЦенникиОбъектаНаПечать(МассивТоваров,Подразделение)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	

	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивТоваров); 

	ОтправитьДляОбработки(ОбменДанными,"/PriceMarketPrint/"+Подразделение,ЗаписьJSON);	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Если ОбменДанными.Ответ.КодСостояния = 200  Тогда
			Попытка
				
				СторокаДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(СторокаДанных);
				//
				СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
				//ДВ = Base64Значение(СтруктураДанных.Ответ);
				//Поток = ДВ.ОткрытьПотокДляЧтения();
				//
				//	
				//Табдок = Новый ТабличныйДокумент;
				//Табдок.Прочитать(Поток);
				//Поток.Закрыть();
				//
				
				Результат.Результат = Истина;
				Результат.Ответ =  СтруктураДанных.Ответ;
				Результат.Вставить("ДанныеПоПечати",МассивТоваров);
				
			Исключение 
				
				Результат.Результат = Ложь;
				Результат.ОписаниеОшибки =  ОписаниеОшибки();
	
			КонецПопытки;
			
			
			//ДВ = ОбменДанными.Ответ.ПолучитьТелоКакДвоичныеДанные();
			//АдресФайла = ПолучитьИмяВременногоФайла("xml");
			//ДВ.Записать(АдресФайла);
			//ТабДок = Новый ТабличныйДокумент;
			//ТабДок.Прочитать(АдресФайла);
			//Результат.Ответ = ТабДок;
		КонецЕсли;
		
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	
	Возврат Результат;

	
КонецФункции

Функция ОтправитьТоварыОбъектаДляПечати(МассивТоваров,Подразделение)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	
	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	

	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивТоваров); 

	ОтправитьДляОбработки(ОбменДанными,"/PriceMarket/"+Подразделение,ЗаписьJSON);	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Если ОбменДанными.Ответ.КодСостояния = 200  Тогда
			Результат.Результат = Истина;
		КонецЕсли;
	Иначе
		Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
			Результат.ОписаниеОшибки = "Ошибка передачи данных";
		Иначе
			Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Результат;

	
КонецФункции


Функция ОтправитьЗапросПечатнаяФорма(МассивТоваров,Подразделение)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	
	ОбменДанными =  ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	

	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивТоваров); 

	ОтправитьДляОбработки(ОбменДанными,"/PrintForm/"+Подразделение,ЗаписьJSON);	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Если ОбменДанными.Ответ.КодСостояния = 200  Тогда
			Результат.Результат = Истина;
			
			ДВ = ОбменДанными.Ответ.ПолучитьТелоКакДвоичныеДанные();
			//Поток = ДВ.ОткрытьПотокДляЧтения();
			//Табдок = Новый ТабличныйДокумент;
			//Табдок.Прочитать(Поток);
			//Поток.Закрыть();
			//Результат.Ответ =Табдок;
			Результат.Ответ =ДВ;
			Результат.Вставить("ДанныеПоПечати",МассивТоваров);
		Иначе
			Результат.ОписаниеОшибки =ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
		КонецЕсли;
	Иначе
		
		//Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Если ПустаяСтрока(ОбменДанными.СообщениеОбОшибке) Тогда	
			Результат.ОписаниеОшибки = "Ошибка передачи данных";
			
		Иначе
			Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Результат;

	
КонецФункции


Функция ОтправитьДокумент(ТипДокумента,Документ,Подразделение)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, Документ); 
	
	Если ТипЗнч(ТипДокумента) = Тип("СправочникСсылка.ТипыДокументов") Тогда
		сТД = Строка(ТипДокумента.ИмяПредопределенныхДанных);
		Если ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТБД Тогда
			сТД = сТД+"V2";
		КонецЕсли;
		ОтправитьДляОбработки(ОбменДанными,"/Market/"+Подразделение+"/DocV2/"+сТД,ЗаписьJSON);

	Иначе
		ОтправитьДляОбработки(ОбменДанными,"/Market/"+Подразделение+"/Doc/"+ТипДокумента,ЗаписьJSON);	
	КонецЕсли;
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Если ОбменДанными.Ответ.КодСостояния = 200  Тогда
			
			
			ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПотокДанных);
			
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
			
			
			Результат.Результат      = СтруктураДанных.Результат;
			Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
			
			Результат.Ответ = СтруктураДанных.Ответ;
			
		//	Результат.Результат = Истина;
		КонецЕсли;
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
	КонецЕсли;
	
	
	Возврат Результат;

	

КонецФункции

Функция ОтправитьТабличнйДокумент(ТабДок,Подразделение,ТипДокумента)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	//Копий = 3;
	
	Если ТипДокумента = "АктПоставки" Тогда
		Копий = 2;
	Иначе
		Копий = 1;
	КонецЕсли;
	
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(ОбменДанными.ИмяСервиса + "/Market/"+Подразделение+"/Type/"+ТипДокумента+"/Copy/"+Формат(Копий,"ЧН=; ЧГ="));
		
		Поток = Новый ПотокВПамяти();
		Табдок.Записать(Поток);
		ДВ = Поток.ЗакрытьИПолучитьДвоичныеДанные();
		
		HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДВ);
		ОтветИБ = ОбменДанными.HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); 
		
		Если ОтветИБ.КодСостояния = 200 Тогда
			
			ПотокДанных = ОтветИБ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПотокДанных);
			
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
			
			
			Результат.Результат      = СтруктураДанных.Результат;
			Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
			
			
		Иначе
			Результат.ОписаниеОшибки = "Ошибка отправки акта, код ответа "+Строка(ОтветИБ.КодСостояния);
		КонецЕсли;
		
		
		
	Исключение
		Результат.Вставить("ОписаниеОшибки","Ошибка отпавки!"+Символы.ПС+ОписаниеОшибки());
	КонецПопытки;
	
	
	Возврат Результат;
	
	

КонецФункции





Функция ПолучитьДанныеПоТоваруТК(ШтрихКод,Подразделение,Склад,Кратко,ВерификацияЦен,ПараметрыТовара,ВозвратПоставщику)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	Если ВерификацияЦен Тогда
		Если ПустаяСтрока(ПараметрыТовара) Тогда
			текстЗапроса = "/Market/"+Подразделение+"/InfoTtovara/"+ШтрихКод;
		Иначе
			текстЗапроса = "/Market/"+Подразделение+"/InfoTtovara/"+ШтрихКод+"/id/"+ПараметрыТовара;
		КонецЕсли;
	ИначеЕсли ВозвратПоставщику Тогда
		текстзапроса = "/Market/"+Подразделение+"/Sklad/"+Склад+"/BarCode/"+ШтрихКод+"/Contract/"+?(ПустаяСтрока(ПараметрыТовара),"null",ПараметрыТовара);
	ИначеЕсли НЕ ПустаяСтрока(Склад) Тогда
		текстзапроса = "/Market/"+Подразделение+"/Sklad/"+Склад+"/BarCode/"+ШтрихКод+"/Param/"+ПараметрыТовара;
	ИначеЕсли Не ПустаяСтрока(ПараметрыТовара) Тогда
		текстзапроса = "/Market/"+Подразделение+"/BarCode/"+ШтрихКод+"/Param/"+ПараметрыТовара;
	Иначе
		текстзапроса = "/Market/"+Подразделение+"/BarCode/"+ШтрихКод+"/Min/"+?(Кратко,1,0);
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,текстзапроса);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоТовару(ОбменДанными,Результат,Кратко,ВерификацияЦен);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПоОстатукуТовара(Подразделение,Склад,Артикул,МРЦ)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	ОбменДанными =  ИнтеграцияТК.HTTPСоединение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	текстзапроса = "/Market/"+Подразделение+"/Sklad/"+Склад+"/Art/"+Артикул+"/Mrc/"+МРЦ;
	
	ВыполнитьЗапросHTTP(ОбменДанными,текстзапроса);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоТовару(ОбменДанными,Результат,Неопределено,Неопределено);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДанныеПоМЦР(Артикул,МРЦ)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	текстзапроса = "/Art/"+Артикул+"/Mrc/"+МРЦ;
	
	ВыполнитьЗапросHTTP(ОбменДанными,текстзапроса);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоТовару(ОбменДанными,Результат,Неопределено,Неопределено);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции




Функция ПолучитьДанныеМенеджерТЗ(ШтрихКод,Подразделение)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	текстЗапроса = "/ManagerTZ/Market/"+Подразделение+"/BarCode/"+ШтрихКод;
	
	ВыполнитьЗапросHTTP(ОбменДанными,текстзапроса);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьДанныеСкладовТК(Подразделение)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	ВыполнитьЗапросHTTP(ОбменДанными,"/MarketSkladInfo/"+Подразделение);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоСкладам(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПоЗадачам(Подразделение,Парам)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	текстЗапроса = "/MarketTaskInfo/"+Подразделение+"/Param/"+Парам;
	
	ВыполнитьЗапросHTTP(ОбменДанными,текстзапроса);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
	КонецЕсли;
	
	
	Возврат Результат;

	
КонецФункции



Функция ПолучитьДанныеКонтрагентаПоЕДРПОТК(КодЕДРПО)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/EDRPO/"+КодЕДРПО);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоКонтрагенту(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;

	
КонецФункции

Функция ПолучитьСписокДокументовТК(Подразделение,ТипДокумента,Период,Контрагент)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	Если ТипДокумента = "Переоценка" Тогда
		ВыполнитьЗапросHTTP(ОбменДанными,"/PriceMarket/"+Подразделение+"/Data/"+Формат(Период,"ДФ=yyyyMMdd"));
	Иначе
		ВыполнитьЗапросHTTP(ОбменДанными,"/MarketDok/"+Подразделение+"/Doc/"+ТипДокумента+"/Data/"+Формат(Период,"ДФ=yyyyMMdd")+"/Client/"+Контрагент);
	КонецЕсли;
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			
			ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПотокДанных);
			
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
			
			
			Результат.Результат      = СтруктураДанных.Результат;
			Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
			
			Если СтруктураДанных.Результат Тогда
				Результат.Ответ = СтруктураДанных.Ответ;
			КонецЕсли;

		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	

	
КонецФункции

Функция ПолучитьДанныеДокументаТК(Подразделение,ПараметрыДокумента)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	ВыполнитьЗапросHTTP(ОбменДанными,"/MarketDok/"+Подразделение+"/Doc/"+ПараметрыДокумента.ВидДокумента+"/DocUUID/"+ПараметрыДокумента.ДокументUUID);
	
	Если ОбменДанными.СоединениеУстановлено И ОбменДанными.Ответ.КодСостояния = 200 Тогда
		Попытка
			
			ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПотокДанных);
			
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
			
			
			Результат.Результат      = СтруктураДанных.Результат;
			Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
			
			Если СтруктураДанных.Результат Тогда
				Результат.Ответ = СтруктураДанных.Ответ;
			КонецЕсли;

		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	

	
КонецФункции

Функция ПолучитьСписокАктивныхЗаказов(Подразделение,ШтрихКод,ЭтоЗаказ)
		
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	

	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	ВыполнитьЗапросHTTP(ОбменДанными,"/Market/"+Подразделение+"/InfOrder/"+ШтрихКод+"/zk/"+ЭтоЗаказ);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
	КонецЕсли;
	
	
	
	Возврат Результат;

		
КонецФункции


///Общепит
Функция GET_Общепит(Метод,ПараметрыЗапроса)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	ВыполнитьЗапросHTTP(ОбменДанными,"/Metod/"+Метод+"/Param/"+ПараметрыЗапроса);
	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			
			ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПотокДанных);
			
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
			
			
			Результат.Результат      = СтруктураДанных.Результат;
			Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
			
			Если СтруктураДанных.Результат Тогда
				Результат.Ответ = СтруктураДанных.Ответ;
			КонецЕсли;

		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;

	
КонецФункции

Функция POST_Общепит(Метод,ПараметрыДокумента,Документ)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	

	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, Документ); 

	ОтправитьДляОбработки(ОбменДанными,"/Metod/"+Метод+"/Param/"+ПараметрыДокумента,ЗаписьJSON);	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Если ОбменДанными.Ответ.КодСостояния = 200  Тогда
			
			ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ПотокДанных);
			
			СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
			
			
			Результат.Результат      = СтруктураДанных.Результат;
			Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
			
			Результат.Ответ = СтруктураДанных.Ответ;
			
		КонецЕсли;
	Иначе
		Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
			Результат.ОписаниеОшибки = "Ошибка передачи данных";
		Иначе
			Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Результат;

	
КонецФункции




Функция ПолучитьДанныеПодразделенияТК(ШтрихКодТКС)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

    ОбменДанными = ИнтеграцияТК.HTTPСоединение();

//	ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
	//    Сообщить("Нет подключения");
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		
		Возврат Результат;
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/PrefixMarketInfo/"+ШтрихКодТКС);	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
		    ИнтеграцияТК.ПрочитатьДанныеПодразделения(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;

	КонецЕсли;
	
	
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьДанныеСотрудникаТК(Преф)
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();

	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ВыполнитьЗапросHTTP(ОбменДанными,"/TKSInfo/"+Преф);	
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
		    ИнтеграцияТК.ПрочитатьДанныеСотрудника(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;

	КонецЕсли;
	
	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеТорговыхПлощадокПодразделения() Экспорт 
	Подразделение = ПараметрыСеанса.UUID;
	Возврат ПолучитьДанныеТорговыхПлощадокТК(Подразделение);
КонецФункции

Функция ПолучитьДанныеТорговыхПлощадокТК(Подразделение)
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");

	 ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	//ОбменДанными = ИнтеграцияПовИсп.УстановитьПодключение();	
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;

	ВыполнитьЗапросHTTP(ОбменДанными,"/MarketSkladInfo/"+Подразделение + "|" + "MarketPlace");
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанныеПоТорговымПлощадкам(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			
		КонецПопытки;
		
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьЗапросHTTP(ОбменДанными,Знач Запрос)
	
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(ОбменДанными.ИмяСервиса + Запрос);
		ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
		HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);	
		ОтветИБ = ОбменДанными.HTTPСоединение.Получить(HTTPЗапрос); 
		ОбменДанными.Ответ = ОтветИБ;
	Исключение
		ОбменДанными.СоединениеУстановлено = Ложь;
		ОбменДанными.СообщениеОбОшибке =  КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры


Процедура ОтправитьДляОбработки(ОбменДанными,Знач Запрос,Запись)
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(ОбменДанными.ИмяСервиса + Запрос); 
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		HTTPЗапрос.Заголовки.Вставить("Accept","application/json");
		ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
      	HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);

		HTTPЗапрос.УстановитьТелоИзСтроки(Запись.Закрыть(),КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);
		
		ОтветИБ = ОбменДанными.HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); 
		ОбменДанными.Ответ = ОтветИБ;
	Исключение
		ОбменДанными.СоединениеУстановлено = Ложь;
		ОбменДанными.СообщениеОбОшибке =  "Ошибка отправки "+Символы.ПС+КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	
КонецПроцедуры


#КонецОбласти  




