

&НаКлиенте
Перем ВыполняетсяЗакрытие;


//&НаСервере
//Процедура ЗаполнитьДокумент(Отказ)
//	
//	//ВидДокумента = Параметры.ВидДокумента;
//	ДокументUUID  = Параметры.ДокументUUID;
//	ДокументСервер = Истина; 
//	//ДатаДокумента = ТекущаяДата();
//	//
//	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(Параметры);
//	// 
//КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ДокументUUID",ИД_Задания);
	Параметры.Свойство("ОписаниеЗадания",ОписаниеЗадания);
		
	Если Параметры.Свойство("ВидДокумента") Тогда
		ЗаданиеВерификации =  ?(Параметры.ВидДокумента = "ЗаданиеВФ",Истина,Ложь); 
	КонецЕсли;
	
	//Если ЗаданиеВерификации Тогда
	//	ЗаполнитьДокумент(Отказ);
	//КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;

	ВыполняетсяЗакрытие = Ложь;

	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры


&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);

	
	
	ОбновитьПодразделение();
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	//(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	//);
	
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма,
	"СтрокаНаименование"
	);


		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	);

	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары", "Видимость",ПоказатьСписок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканирование", "Видимость",НЕ ПоказатьСписок);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ФормаПередатьНаСервер,ОписаниеЗадания", "Видимость",НЕ ЗаданиеВерификации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ФормаВыполнитьЗадание,ОписаниеЗадания", "Видимость",ЗаданиеВерификации);
	НастроитьЭлементыАсинхронногоСканера();
	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;

	КонецЕсли;
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	);

	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры





&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
			
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	КонецЕсли;
	

КонецПроцедуры



#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока( ПолученныйШтрихкод) Тогда
		ЗвукОшибки();

		Возврат;
	КонецЕсли;
	
	Если ЗаданиеВерификации Тогда
		ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ПолученныйШтрихкод,,Истина,ИД_Задания);
	Иначе
		ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ПолученныйШтрихкод,,Истина);
	КонецЕсли;
	ОбработатьПолученныеДанные(ДанныеПоТовару,Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Сканер(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеУстановленСканерНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеСканерШтрихкодов",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеПоТовару, ДополнительныеПараметры) Экспорт
	
	Если ДанныеПоТовару.Результат = ложь Тогда
		Сообщить(?(ЗначениеЗаполнено(ДанныеПоТовару.ОписаниеОшибки), ДанныеПоТовару.ОписаниеОшибки,"Данные по штрих коду не получены"));
		ЗвукОшибки();

		Возврат;
	КонецЕсли;
	СтруктураОтвета = ДанныеПоТовару.Ответ;
	
	Если СтруктураОтвета.Свойство("АМ") Тогда
		ЦветАМ = ?(СтруктураОтвета.АМ = 0, WebЦвета.Красный, WebЦвета.Синий);
		Элементы.ДекорацияАМ.ЦветФона 		  = ЦветАМ;
	КонецЕсли;

	Если СтруктураОтвета.Свойство("СрокВозврата") Тогда
		УсловиеВозврата = СтруктураОтвета.СрокВозврата;
		ДатаВозврата = ?(УсловиеВозврата = 0, "ДО ПРОСРОКА",Формат(ТекущаяДата() + (60*60*24* УсловиеВозврата),"ДФ=dd.MM.yy"));
	Иначе  
		ДатаВозврата = Неопределено;
		УсловиеВозврата = 0;
	КонецЕсли;

	
	
	нСтрока = Товары.Добавить();
	ЗаполнитьЗначенияСвойств(нСтрока,СтруктураОтвета);
	ИдентификаторСтроки = нСтрока.ПолучитьИдентификатор();
	ОбработатьНовуюСтроку(ИдентификаторСтроки);
	
	#Если МобильноеПриложениеКлиент Тогда
		Если Подсветка Тогда
			ЗвукОшибки()
		КонецЕсли;
	#КонецЕсли
	
		
	
	
	
Конецпроцедуры

&НаСервереБезКонтекста
Функция ПоместитьМакетВоВременноеХранилище(ИмяМакета) Экспорт 
	
	Макет = ПолучитьОбщийМакет(ИмяМакета);  
    АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Макет);
	Возврат АдресФайлаВХранилище; 
	
КонецФункции


&НаКлиенте
Процедура ЗвукОшибки()
	
	#Если МобильноеПриложениеКлиент Тогда
		
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение("errorscan",Истина);
		
	#КонецЕсли

	
КонецПроцедуры


&НаСервере
Процедура ОбработатьНовуюСтроку(ИдентификаторСтроки)

	
	ЗаписьПоСтроке = НСтр("ru = '%Артикул% %Номенклатура% %Еденица%'");
	ЗаписьПоСтрокеЦенаОстаток = НСтр("ru = 'Цена %Цена% ост. %Остаток%'");

	
	СтрокаТовара = Товары.НайтиПоИдентификатору(ИдентификаторСтроки);

	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Еденица%",      Строка(СтрокаТовара.Еденица));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Артикул%",      Строка(СтрокаТовара.Артикул));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Номенклатура%", Строка(СтрокаТовара.НаименованиеТовара));
	ЗаписьПоСтрокеЦенаОстаток = СтрЗаменить(ЗаписьПоСтрокеЦенаОстаток, "%Цена%",    Формат(СтрокаТовара.Цена, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	ЗаписьПоСтрокеЦенаОстаток = СтрЗаменить(ЗаписьПоСтрокеЦенаОстаток, "%Остаток%", Формат(СтрокаТовара.Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	//
	
	СтрокаТовара.ЗаписьПоСтроке = ЗаписьПоСтроке;
	СтрокаТовара.ЗаписьПоСтрокеЦенаОстаток = ЗаписьПоСтрокеЦенаОстаток;

	
	СтрокаНаименование = "["+СтрокаТовара.Артикул+"]"+" "+"["+СтрокаТовара.ШтрихКод+"]"+Символы.ПС+СтрокаТовара.НаименованиеТовара;
	Цена = Формат(СтрокаТовара.Цена,"ЧЦ=15; ЧДЦ=2; ЧН=");
	ЦенаЦенник = Формат(СтрокаТовара.ЦенаЦенник,"ЧЦ=15; ЧДЦ=2; ЧН=");
	Остаток = Формат(СтрокаТовара.Остаток,"ЧЦ=15; ЧДЦ=3; ЧН=");
	
	ОстатокТНП = Формат(СтрокаТовара.ОстатокТНП,"ЧЦ=15; ЧДЦ=3; ЧН=");
	
	Отсканировано = Товары.Количество();
	ОтсканированоНеПравильных = Товары.НайтиСтроки(Новый Структура("ЕстьСверка,БезЦенника,ЦенаПроверена",Истина,Ложь,Ложь)).Количество();
	ОтсканированоБезЦенников  = Товары.НайтиСтроки(Новый Структура("БезЦенника",Истина)).Количество();
	Если  СтрокаТовара.ЕстьСверка И  НЕ СтрокаТовара.БезЦенника  И   НЕ СтрокаТовара.ЦенаПроверена Тогда
		Подсветка = Истина;
	Иначе
		Подсветка = Ложь;
	КонецЕсли;
	

	
	
КонецПроцедуры















&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры




&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
		// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();

КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры





&НаКлиенте
Процедура Готово(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры






&НаСервере
Функция  ПечататьВсеНаСервере()
	
	МассивСтрок = Новый Массив;
	Для Каждого СтрТовары Из Товары Цикл 
		МассивСтрок.Добавить(СтрТовары.Артикул)
	КонецЦикла;
	
	Ответ =  ИнтеграцияТК_ВызовСервера.ПечатьЦенниковОбъекта(МассивСтрок);
	Если Ответ.Результат Тогда
		ТабДок = Ответ.Ответ;
		ТабДок.АвтоМасштаб = Истина;
		
	//	ТабДок.ИмяПринтера = "10.148.221.64";
	Иначе
		ТабДок = Неопределено;
	КонецЕсли;
	
	
	Возврат ТабДок;
	
КонецФункции


&НаКлиенте
Процедура ПечататьВсе(Команда)

	//
	//ТабДок = ПечататьВсеНаСервере();
	//Если ТабДок <> Неопределено Тогда
	//	ПараметрыФормы = Новый Структура("ТабличныйДокумен",ТабДок);
	//	ОПЗакрытия = Новый ОписаниеОповещения("ВыполнитьЗакрытиеПечати",ЭтотОбъект);
	//	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыФормы,ЭтаФорма,,,,ОПЗакрытия,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	//КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗакрытиеПечати(Результат,Параметры) Экспорт 
	Если Результат = "ОК" Тогда
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПередатьНаСерверНаСервере()

	
	
	МассивТоваров = Новый Массив;
	Для Каждого СтрТовары Из Товары Цикл 
		Если (СтрТовары.ЕстьСверка И НЕ СтрТовары.ЦенаПроверена) ИЛИ  СтрТовары.БезЦенника Тогда
		
		МассивТоваров.Добавить(Новый Структура("Артикул,МРЦ",СтрТовары.Артикул,""))
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("ТипДокумента","ПечатьЦенников");
	СтруктураДокумента.Вставить("Товары",МассивТоваров);

	
	Ответ =  ИнтеграцияТК_ВызовСервера.ПередатьТоварыДляЦенников(СтруктураДокумента);
	Если Ответ.Результат Тогда
		Товары.Очистить();
		
		
		Отсканировано = Товары.Количество();
		ОтсканированоНеПравильных = 0;
		ОтсканированоБезЦенников  = 0;
		Подсветка = Ложь;
	    СтрокаНаименование = "";

			
		
		Если ЗаданиеВерификации Тогда
			
			СтруктураДокумента = Новый Структура("UUID_Документ,ДоументСервер",ИД_Задания,Ложь);
			Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,Справочники.ТипыДокументов.ЗаданиеВФ);
			
			Возврат Рез.Результат;
		Иначе
			Сообщить("Отправлено на печать");
			
		КонецЕсли;

		
	Иначе
		Сообщить(Ответ.ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуЦенниковДляПечати()
	
	Если ПечататьВсеЦенники Тогда
		тзТипыЦенников = Товары.Выгрузить(,"СпецЦена");
	Иначе
		
		тзТипыЦенников = Новый ТаблицаЗначений;
		тзТипыЦенников.Колонки.Добавить("СпецЦена");
		Для Каждого стрТовары Из Товары Цикл 
			Если стрТовары.ЦенаПроверена = Ложь Или стрТовары.БезЦенника Тогда
				тзстрТипыЦенников =  тзТипыЦенников.Добавить();
				тзстрТипыЦенников.СпецЦена = стрТовары.СпецЦена;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	тзТипыЦенников.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Любой)));
	тзТипыЦенников.ЗаполнитьЗначения(1,"Количество");
	тзТипыЦенников.Свернуть("СпецЦена","Количество");
	
	Возврат тзТипыЦенников;
КонецФункции


&НаСервере
Функция СписокЦенников()
	
	тзТипыЦенников = ПолучитьТаблицуЦенниковДляПечати();
	ВариантыПечати = Новый СписокЗначений;
		Для Каждого стТипы Из тзТипыЦенников Цикл 
			тц = стТипы.СпецЦена;
			кв = Строка(стТипы.Количество);
			Если тц = "27" Тогда
				ВариантыПечати.Добавить(тц,"Жовтий - "+кв,Истина,БиблиотекаКартинок.жовтий);  
			ИначеЕсли тц = "28" Тогда
				ВариантыПечати.Добавить(тц,"Синій - "+кв,Истина,БиблиотекаКартинок.синій);	
			ИначеЕсли тц = "29"	Тогда
				ВариантыПечати.Добавить(тц,"Помаранчевий - "+кв,Истина,БиблиотекаКартинок.помаранчевий); 
			ИначеЕсли тц = "26"	Тогда
				ВариантыПечати.Добавить(тц,"Помаранчевий - "+кв,Истина,БиблиотекаКартинок.помаранчевий);
			ИначеЕсли тц = "36"	Тогда
				ВариантыПечати.Добавить(тц,"Помаранчевий - "+кв,Истина,БиблиотекаКартинок.помаранчевий);
			ИначеЕсли тц = "37"	Тогда
				ВариантыПечати.Добавить(тц,"Синій - "+кв,Истина,БиблиотекаКартинок.синій);	
			ИначеЕсли тц = "38"	Тогда
				ВариантыПечати.Добавить(тц,"Жовтий - "+кв,Истина,БиблиотекаКартинок.жовтий);  
	
			Иначе
				ВариантыПечати.Добавить(тц,"Білий - "+кв,Истина,БиблиотекаКартинок.білий);
			КонецЕсли;
		КонецЦикла;
		
	
	Возврат ВариантыПечати
КонецФункции


&НаКлиенте
Процедура ПередатьНаСервер(Команда)
	
	
	ВариантыПечати = СписокЦенников();
	Если ВариантыПечати.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає цінників для друку");
		Возврат;
	КонецЕсли;
	
	ОповещениеПечати = Новый ОписаниеОповещения("ВыборВариантаПечатии",ЭтотОбъект,Новый Структура);
	
	ПоказатьВыборИзМеню(ОповещениеПечати,ВариантыПечати);

	//ПередатьНаСерверНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ВыборВариантаПечатии(ВариантыПечати,ПараметрыПечати) Экспорт
	
	
	Если ВариантыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = ПечатьНаСервере(ВариантыПечати.Значение);
	Если Ответ.Результат = Ложь Тогда
		Сообщить(Ответ.ОписаниеОшибки);
	Иначе
		Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда	
			ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Ответ.Ответ);
		Иначе
			Сообщить("Отправлено на печать");
		КонецЕсли;
		
	КонецЕсли;
		

КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ТипЦены)
	
	
	МассивТоваров = Новый Массив;
	нТовары = Новый Массив;

	Для Каждого СтрТовары Из Товары Цикл 
		
		Если СтрТовары.СпецЦена <> ТипЦены Тогда
			Продолжить;
		КонецЕсли;
		флПечать = Ложь;
		Если ПечататьВсеЦенники Тогда
			флПечать = Истина;
		ИначеЕсли СтрТовары.СпецЦена = ТипЦены И (стрТовары.ЦенаПроверена = Ложь Или стрТовары.БезЦенника) Тогда
			флПечать = Истина;
		КонецЕсли;
		
		Если флПечать Тогда
			МассивТоваров.Добавить(Новый Структура("Артикул,МРЦ",СтрТовары.Артикул,""));
			нТовары.Добавить(СтрТовары);

		КонецЕсли;
		
	КонецЦикла;
	
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("Товары",МассивТоваров);
	СтруктураДокумента.Вставить("ИД_Переоценки",ТипЦены);
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
	
		СтруктураДокумента.Вставить("ТипДокумента","ПечатьЦенниковТСД");
		Ответ =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтруктураДокумента);

	Иначе
		
		СтруктураДокумента.Вставить("ТипДокумента","ПечатьЦенников");
		
		Ответ =  ИнтеграцияТК_ВызовСервера.ПередатьТоварыДляЦенников(СтруктураДокумента);
	КонецЕсли;
	
	Если Ответ.Результат Тогда
		
		Для Каждого СтрТовары Из нТовары Цикл 
			Товары.Удалить(СтрТовары);
		КонецЦикла;
		
		Отсканировано = Товары.Количество();
		ОтсканированоНеПравильных = 0;
		ОтсканированоБезЦенников  = 0;
		ЦенаЦенник = 0;
		Подсветка = Ложь;
		СтрокаНаименование = "";
		Цена = 0;
		Остаток = 0;
		ОстатокТНП = 0;
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции



&НаКлиенте
Процедура ВыполнитьЗадание(Команда)
	Если ПередатьНаСерверНаСервере() Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть(Новый Структура("УдалитьСтроку"));
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ОбработатьПолученныйШтрихкод(СтрокаПоиска, ДополнительныеПараметры);
 	СтрокаПоиска = "";
    ЭтаФорма.ТекущийЭлемент = Элементы.СтрокаПоиска;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ПоказатьСписокПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары", "Видимость",ПоказатьСписок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканирование", "Видимость",НЕ ПоказатьСписок);

КонецПроцедуры


&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	#Если МобильноеПриложениеКлиент Тогда
	#КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
		
	
	Если НЕ ВыполняетсяЗакрытие И  Товары.Количество() > 0 Тогда
			
			Отказ = Истина;
			
			ТекстВопроса = ?(ЗаданиеВерификации,"Выполнить задание?","Сохранить данные?");
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт


	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПередатьНаСерверНаСервере();
		
	КонецЕсли;
	
	ВыполняетсяЗакрытие = Истина;
	Если ЗаданиеВерификации Тогда
		Закрыть(Новый Структура("УдалитьСтроку"));
	Иначе
		Закрыть();
	КонецЕсли;

КонецПроцедуры



