


Функция ПечатьАкта(СутруктураДокумента) Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("АктПриема");
	

	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ТекстЗаголовка =  СутруктураДокумента.Заголовок;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Поставщик");
	Область.Параметры.ПредставлениеПоставщика =  СутруктураДокумента.Поставщик;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Покупатель");
	Область.Параметры.ПредставлениеПокупателя =  СутруктураДокумента.Покупатель;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("МестоСоставления");
	Область.Параметры.ПредставлениеСоставления =  СутруктураДокумента.МестоДоставки;
	ТабДок.Вывести(Область);

	Область = Макет.ПолучитьОбласть("Состав");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);

	Область = Макет.ПолучитьОбласть("Строка");
	нпп = 1;
	Для Каждого СтрТовар Из СутруктураДокумента.Товары Цикл 
		
		Область.Параметры.нпп = нпп;
		Область.Параметры.Код = СтрТовар.Артикул;
		Область.Параметры.ТоварНаименование = СтрТовар.Наименование;
		Область.Параметры.ЕдиницаИзмерения = СтрТовар.ЕдИзм;
		Область.Параметры.СтавкаНДС = СтрТовар.СтавкаНДС;
		Область.Параметры.ПоНакладной = СтрТовар.ПоНакладной;
		Область.Параметры.ФактическиПринято = СтрТовар.Факт;
		Область.Параметры.ОтклонениеПоНакладной = СтрТовар.Факт-СтрТовар.ПоНакладной;
		Область.Параметры.Причина = СтрТовар.Причина;
		
		
		ТабДок.Вывести(Область);
		
		
		нпп = нпп+1;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Подписи");
	ТабДок.Вывести(Область);


	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДок.КоличествоЭкземпляров = 3;

	Возврат ТабДок;
	
КонецФункции

Функция ПечатьРеестрОбщий(тзДокументы)Экспорт
	ТабДок = Новый ТабличныйДокумент;	  
	
	
	таблицаТипДок =	 тзДокументы.Выгрузить(,"ТипДокумента"); 
	таблицаТипДок.Свернуть("ТипДокумента");    
	
	Для Каждого стТипДок  Из таблицаТипДок Цикл     
		
		тзРеестр = тзДокументы.Выгрузить(тзДокументы.НайтиСтроки(Новый Структура("ТипДокумента",стТипДок.ТипДокумента)));
		
		табДокРеестр = ПечатьРеестра(тзРеестр,	стТипДок.ТипДокумента); 
		ТабДок.Вывести(табДокРеестр);
		
	КонецЦикла;
	
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.КоличествоЭкземпляров = 1;
	

	Возврат ТабДок;
	 
КонецФункции
 

Функция ПечатьРеестра(тзДокументы,ТипДок="ПоступлениеТоваров")Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет("Реестр");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ТекДата = ТекущаяДата();
	Область.Параметры.Магазин = ПараметрыСеанса.Подразделение;
	Если ТипДок = "ПоступлениеТоваров" ИЛИ ТипДок = "РеестрПриходов" Тогда
		
		Область.Параметры.Заголовок = "Надходження товарів";  
	ИначеЕсли ТипДок = "PrintPRP" Тогда
		Область.Параметры.Заголовок = "Переміщення товарів - Надходження";  
	ИначеЕсли ТипДок = "Перемещение"  ИЛИ ТипДок = "PrintPR" Тогда	
		Область.Параметры.Заголовок = "Переміщення товарів";
	ИначеЕсли ТипДок = "ВозвратПоставщику" ИЛИ ТипДок = "PrintVP" Тогда	
		Область.Параметры.Заголовок = "Повернення товарів постачальнику";
	ИначеЕсли ТипДок = "Списание" ИЛИ ТипДок = "PrintSP" Тогда	
		Область.Параметры.Заголовок = "Списання товарів"; 
	ИначеЕсли ТипДок = "PrintIN"  Тогда	
		Область.Параметры.Заголовок = "Iнвентаризація";
	
	КонецЕсли;
	
	ТабДок.Вывести(Область);
	 нпп = 0;
	 
	 Если ТипДок = "ПоступлениеТоваров" ИЛИ ТипДок = "РеестрПриходов" ИЛИ ТипДок = "PrintPRP" Тогда
		 Область = Макет.ПолучитьОбласть("ШапкаПТ");
		 ТабДок.Вывести(Область);
		 
		 Область = Макет.ПолучитьОбласть("СтрокаПТ");
		 Для Каждого Стр Из тзДокументы Цикл 
			 нпп = нпп+1;
			 
			 Область.Параметры.нпп = нпп;
			 Область.Параметры.Дата = Стр.Дата;
			 Область.Параметры.Номер = Стр.НомерДокумента;
			 Область.Параметры.Контрагент = Стр.Контрагент;
			 Область.Параметры.ф = ?(Стр.Проведен=1,"+","-")+" " +Стр.Регл;
			 Область.Параметры.КоличествоПринято = Стр.количествоПринято;
			 Область.Параметры.КоличествоПоставщика = Стр.КоличествоПоставщика;
			 
			 
			 ТабДок.Вывести(Область);
			 
		 КонецЦикла;
	 ИначеЕсли   ТипДок = "Перемещение" ИЛИ ТипДок ="ВозвратПоставщику" ИЛИ ТипДок = "PrintVP" ИЛИ ТипДок = "PrintPR" Тогда
		 
		 Область = Макет.ПолучитьОбласть("ШапкаПР");
		 ТабДок.Вывести(Область);
		 
		 Область = Макет.ПолучитьОбласть("СтрокаПР");
		 Для Каждого Стр Из тзДокументы Цикл 
			 нпп = нпп+1;
			 
			 Область.Параметры.нпп = нпп;
			 Область.Параметры.Дата = Стр.Дата;
			 Область.Параметры.Номер = Стр.НомерДокумента;
			 Область.Параметры.Контрагент = Стр.Контрагент;
			 Область.Параметры.Количество = Стр.КоличествоПринято;
			 
			 ТабДок.Вывести(Область);
			 
		 КонецЦикла;
	 ИначеЕсли   ТипДок = "ИнвентаризацияРеестр" ИЛИ ТипДок = "PrintIN" ИЛИ ТипДок = "Списание" ИЛИ ТипДок = "PrintSP" Тогда
		 
		 Область = Макет.ПолучитьОбласть("ШапкаИН");
		 ТабДок.Вывести(Область);
		 
		 Область = Макет.ПолучитьОбласть("СтрокаИН");
		 Для Каждого Стр Из тзДокументы Цикл 
			 нпп = нпп+1;
			 
			 Область.Параметры.нпп = нпп;
			 Область.Параметры.Дата = Стр.Дата;
			 Область.Параметры.Номер = Стр.НомерДокумента;
			 Область.Параметры.ТоварныеГруппы = Стр.Контрагент;
			 Область.Параметры.Сумма = Стр.Сумма;
			 
			 ТабДок.Вывести(Область);
			 
		 КонецЦикла;
		 
	
	 
	 КонецЕсли;
	 Область = Макет.ПолучитьОбласть("ПодвалПТ");
	 Область.Параметры.ДокКоличество = Формат(нпп, "ЧЦ=15");
	 ТабДок.Вывести(Область);
	 
	 ТабДок.АвтоМасштаб = Истина;
	 
	 ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	 ТабДок.КоличествоЭкземпляров = 1;
	 
	Возврат ТабДок;
	

КонецФункции

