


Функция ПолучитьUUIDПодразделения(Знач ПрефиксПодразделения) Экспорт
	
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьПодразделение(ПрефиксПодразделения);
	
КонецФункции

Функция ПолучитьСотрудника(Знач ШтрихКодТКС) Экспорт
	
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьСотрудника(ШтрихКодТКС);
	
КонецФункции  



Функция ПолучитьДанныеПоТоваруКлиент(Знач ШтрихКод,Кратко = Ложь,ВерификацияЦен = Ложь,ПараметрыТовара="",Склад="",ВозвратПоставщику = Ложь) Экспорт 
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеПоТовару(ШтрихКод,Кратко,ВерификацияЦен,ПараметрыТовара,Склад,ВозвратПоставщику);
КонецФункции

Функция ПолучитьДанныеПоТоваруМенеджерТЗКлиент(Знач ШтрихКод) Экспорт 
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеПоТоваруМенеджерТЗ(ШтрихКод);
КонецФункции


Функция ПолучитьСписокСкладов()Экспорт 
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеСкладовПодразделения();
КонецФункции

Функция ПолучитьСписокПричинВозврата()Экспорт
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеПричинВозврата();
КонецФункции


Функция ПолучитьКонтрагентаПоЕДРПО(Знач КодЕДРПО)Экспорт
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеКонтрагентаПоЕДРПО(КодЕДРПО);
КонецФункции

Функция ПолучитьДанныеПоЗаказам(Знач ШтрихКод,ЭтоЗаказ = 1)Экспорт
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеПоЗаказам(ШтрихКод,ЭтоЗаказ);
КонецФункции


Функция ПолучитьСписокТорговыхПлощадок() Экспорт 
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеТорговыхПлощадокПодразделения();
КонецФункции

Функция ПолучитьданныеПоТоваруОбщепит(ШтрихКод)Экспорт
	Возврат ИнтеграцияТК_ВызовСервера.ПолучитьДанныеОбщепит("GetGoods",ШтрихКод);
КонецФункции

Функция ПроверитьМРЦТовара(АртикулТовара,ВводимоеЧисло)Экспорт
	Возврат ИнтеграцияТК_ВызовСервера.ПроверитьМРЦТовара(АртикулТовара,ВводимоеЧисло);
КонецФункции

Функция ПолучитьДанныеПоСканировкеТабак(UUID,ШтрихКод="", Накладная = Истина,Парам="")Экспорт
	Если Накладная Тогда
		Возврат ИнтеграцияТК_ВызовСервера.НакладнаяСканировки(UUID,Парам);
	Иначе
		Возврат ИнтеграцияТК_ВызовСервера.ДанныеQRТабак(UUID,ШтрихКод,Парам);
	КонецЕсли;
	
КонецФункции




Процедура ВыполнитьРегистрациюТокена()Экспорт   
	
	
	ТекПодрзаделение = ЗначениеНастроекВызовСервераПовтИсп.ПодразделениеUUID();
	Если ПустаяСтрока(ТекПодрзаделение) Тогда
		Возврат;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ИдентификаторОбъект  = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений("364481246825");
		Если ИдентификаторОбъект = Неопределено Тогда   
			Возврат;
		КонецЕсли;                     
		
		СисИнфо = Новый СистемнаяИнформация;  
		МодельУстройства = СисИнфо.ВерсияОС;//"ПК_ТСД";
		ID_Устройства = Строка(СисИнфо.ИдентификаторКлиента);
		НовыйТокен = ИдентификаторОбъект.ИдентификаторУстройства;  // "123456789";
		
		СтрарыйТокен = ОбщегоНазначенияВызовСервера.ПолучитьСохраненныйТокен(ID_Устройства);
		
		Если СтрарыйТокен <> НовыйТокен Тогда
			Ответ = ИнтеграцияТК_ВызовСервера.ОтправитьТокен(ID_Устройства,МодельУстройства,НовыйТокен);	
			
			Если Ответ.Результат Тогда
				 ОбщегоНазначенияВызовСервера.ЗаписатьНовыйТокен(ID_Устройства,НовыйТокен);
			КонецЕсли;
			
		КонецЕсли;
		
		
	#КонецЕсли

	
КонецПроцедуры
