
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	НастроитьФормуПоАдминистративномуРежиму();
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
	// Демоверсия
	НастроитьФормуДляДемоверсии();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	ИначеЕсли ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		
		НастроитьФормуПоАдминистративномуРежиму();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВнешнийВидПриложения(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ВнешнийВидПриложения",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыУчета(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыУчета",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдминистративныйРежим(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизации(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.РежимСинхронизации",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемоеОборудование(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудование",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтикеткиЦенники(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ЭтикеткиЦенники",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезервноеКопирование(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.РезервноеКопирование",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыСинхронизации(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыСинхронизации",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЕГАИС(Команда)
	
	//ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ЕГАИС",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Геолокация(Команда)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.Геолокация",,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЧтоНового(Команда)
	ОткрытьФорму("ОбщаяФорма.ЧтоНового",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияДемоверсии(Команда)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.Демоверсия",, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	
	ИзменитьАдминистративныйРежим();
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() Тогда
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "РежимСинхронизации");
	Иначе
		ОбщегоНазначения.СброситьЦветПолей(ЭтаФорма, "РежимСинхронизации");
	КонецЕсли;
	
	Если ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыСинхронизации() Тогда
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "ПараметрыСинхронизации");
	Иначе
		ОбщегоНазначения.СброситьЦветПолей(ЭтаФорма, "ПараметрыСинхронизации");
	КонецЕсли;
	
	Если (ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыСинхронизации() И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыУчета())
			ИЛИ (ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() И ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыУчета()) Тогда
				ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "ПараметрыУчета");
	Иначе
		ОбщегоНазначения.СброситьЦветПолей(ЭтаФорма, "ПараметрыУчета");
	КонецЕсли;
	
	//Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() ИЛИ НЕ ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПараметрыСинхронизации", "Видимость", Ложь);
	//Иначе
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПараметрыСинхронизации", "Видимость", Истина);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму()
	
	ОбщегоНазначения.НастроитьДоступностьФлагаАдминистративногоРежима(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьАдминистративныйРежим()
	
	ОбщегоНазначения.ИзменитьАдминистративныйРежим(АдминистративныйРежим);
	
	Если НЕ АдминистративныйРежим Тогда
		НастроитьФормуПоАдминистративномуРежиму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуДляДемоверсии()
	
	Элементы.ОграниченияДемоверсии.Видимость = ЗначениеНастроекПовтИсп.ЭтоДемоверсия();
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

