 &НаКлиенте
Перем ВыполняетсяЗакрытие;
	
 
&НаСервере 
Процедура СоздатьТаблицуПричинНаСервере()  

	ТаблицаПричины.Очистить();	
	НачСтрока = 5;
	Для сч = 1 По СтрокТовара Цикл   
		
		чт  =Формат(НачСтрока,"ЧЦ=10; ЧГ=");
		облстрТов =   ТекущаяПечатнаяФорма.Область("R"+чт+"C2:R"+чт+"C4");
		мстрока = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(облстрТов.Текст," ");

		чт  =Формат(НачСтрока+2,"ЧЦ=10; ЧГ=");
		облстрПричина =   ТекущаяПечатнаяФорма.Область("R"+чт+"C2:R"+чт+"C4");
		НачСтрока = НачСтрока +	3;

		Если облстрПричина.Значение = Справочники.ПричиныВозврата.УкажитеПричину Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не вибрано причину"+Символы.ПС+ облстрТов.Текст);

			Продолжить;
		КонецЕсли;
		нстртз = ТаблицаПричины.Добавить();
		Если ПарамВопрос = "ПриемPKG" Тогда 
			нстртз.СтрокаИД = мстрока[0];
			нстртз.Артикул = мстрока[1];
		Иначе
			нстртз.Артикул = мстрока[0];     
		КонецЕсли;
		нстртз.Причина = облстрПричина.Значение;
		
	КонецЦикла; 
	
КонецПроцедуры
 
  
&НаКлиенте
Процедура Создать(Команда)
	
	СоздатьТаблицуПричинНаСервере();
	Если ТаблицаПричины.Количество() <> СтрокТовара Тогда 
		Возврат;
	КонецЕсли;
	ВыполняетсяЗакрытие = Истина;      
		
		
	 Закрыть(Новый Структура("СоздатьАКТ,ТабицаПричин",Истина,ТаблицаПричины));

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	 ВыполняетсяЗакрытие = Истина;
	 Закрыть(Новый Структура("СоздатьАКТ",Ложь));
КонецПроцедуры


&НаКлиенте
Процедура КнопкаДА(Команда)
	 ВыполняетсяЗакрытие = Истина;
	 Закрыть(Новый Структура("Ответ",Истина));
КонецПроцедуры


&НаКлиенте
Процедура КнопкаНЕТ(Команда)
	 ВыполняетсяЗакрытие = Истина;
	 Закрыть(Новый Структура("Ответ",Ложь));
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяПечатнаяФорма.Очистить();
	Если Параметры.Свойство("ПарамФормы") И Параметры.ПарамФормы = "ТекстВопроса" Тогда
		ЗаполнитьТекстВопроса(Параметры.Вопрос); 
	ИначеЕсли Параметры.Свойство("ПарамВопрос") И Параметры.ПарамВопрос = "ПриемPKG" Тогда
		ПарамВопрос = "ПриемPKG"; 
		ТаблицаРасхождений = Параметры.ТаблицаРасхождений;
		ЗаполнитьПечФорму(ТаблицаРасхождений); 
	
	Иначе
		ТаблицаРасхождений = Параметры.ТаблицаРасхождений;
		ЗаполнитьПечФорму(ТаблицаРасхождений); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстВопроса(тВопрос)

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопки", "Видимость", Ложь);  

	Макет = ПолучитьОбщийМакет("МакетВопрос");
	Область = Макет.ПолучитьОбласть("ОбластьВопрос");
	Область.Параметры.тВопрос = тВопрос;	
	
	ТекущаяПечатнаяФорма.Вывести(Область); 
	
	ТекущаяПечатнаяФорма.Защита = Истина;

КонецПроцедуры

&НаСервере
Функция ЗаполнитьПечФорму(ТаблицаРасхождений)
	
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкиВопрос", "Видимость", Ложь);  

		//ТекущаяПечатнаяФорма  = Новый ТабличныйДокумент;
		
		Макет = ПолучитьОбщийМакет("ЗапросСформироватьАКТ");
		Область = Макет.ПолучитьОбласть("Заголовок");
		ТекущаяПечатнаяФорма.Вывести(Область);
		Область = Макет.ПолучитьОбласть("Шапка");
		ТекущаяПечатнаяФорма.Вывести(Область);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьСтрокаЦвет = Макет.ПолучитьОбласть("СтрокаЦвет");
		
		
		НомерСтроки = 1;
		
		
		Для Каждого стр Из  ТаблицаРасхождений Цикл 
			
			Если НомерСтроки % 2 = 0 Тогда
				СтрокаМакета = ОбластьСтрокаЦвет;
			Иначе
				СтрокаМакета = ОбластьСтрока;
			КонецЕсли;
			
			СтрокаМакета.Параметры.Товар = ?(ПарамВопрос= "ПриемPKG",Формат(стр.СтрокаИД,"ЧЦ=3; ЧН=0; ЧГ=")+" "+стр.СтрокаТовара,стр.СтрокаТовара);	
			СтрокаМакета.Параметры.Количество = стр.Количество;			
			//ст = СтрокаМакета.Область("R3C4");
			//ст.СодержитЗначение = Истина;
			СтрокаМакета.Параметры.Причина  = Справочники.ПричиныВозврата.УкажитеПричину;
			ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		СтрокТовара = НомерСтроки-1;	
		ТекущаяПечатнаяФорма.Защита = Истина;
		
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ ВыполняетсяЗакрытие Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТекущаяПечатнаяФормаВыбор(Элемент, Область, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ТекОбласть = ТекущаяПечатнаяФорма.ТекущаяОбласть;	
	Попытка 
		Если ТекОбласть.Значение = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Исключение 
		Возврат
	КонецПопытки;
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("тОбласть", ТекОбласть.Имя);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеВыбранПричина", ЭтотОбъект, ДополнительныеПараметры);
   ОткрытьФорму("Справочник.ПричиныВозврата.Форма.ФормаВыбора",,,,,,ОписаниеОповещения);

  // ОткрытьФорму("Справочник.ПричиныВозврата.Форма.ФормаВыбора",,ЭтаФорма,,,,ДополнительныеПараметры,ОписаниеОповещения);
	
КонецПроцедуры

 
&НаКлиенте
Процедура ОповещениеВыбранПричина(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено  Тогда
		Возврат;
	КонецЕсли;   
	
	Область = ТекущаяПечатнаяФорма.Область(ДополнительныеПараметры.тОбласть);	
	Область.Значение =Результат;

КонецПроцедуры

