
&НаСервере
Функция СформироватьОтчетРезультатыАнкет(ДанныеЗапроса)
	
	
	Отказ = Ложь;
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "Proverki");
	ПараметрыДокумента.Вставить("ДокументUUID", ДанныеЗапроса.СотрудникUUID);
	рез = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
	Если рез.Результат  Тогда
		
		ДанныеАнкетирования =  рез.Ответ;
		
		//	//ТекущаяПечатнаяФорма  = Новый ТабличныйДокумент;
		//	
		МакетОтчета = ПолучитьОбщийМакет("Анкетирование");
		Область = МакетОтчета.ПолучитьОбласть("Шапка");
		ТекущаяПечатнаяФорма.Вывести(Область);
		
		Для Каждого Анкета Из ДанныеАнкетирования Цикл 
			Область = МакетОтчета.ПолучитьОбласть("ттАнкета");
			Область.Параметры.Анкета = "Анкета №"+Анкета.Номер +" від "+ Формат(Дата(Анкета.Дата),"ДФ=yyyy-MM-dd");
			Область.Параметры.ТТ = Анкета.Респондент;
			ТекущаяПечатнаяФорма.Вывести(Область);
			
			Область = МакетОтчета.ПолучитьОбласть("Итого");
			Область.Параметры.Результат = Формат(Анкета.ПроцентВыполнения,"ЧЦ=3; ЧН=0")+"%";
			Область.Параметры.Сумма = Анкета.ИтогОценка;
			ТекущаяПечатнаяФорма.Вывести(Область);

			Строка = МакетОтчета.ПолучитьОбласть("Строка");
			СтрокаЦвет = МакетОтчета.ПолучитьОбласть("СтрокаЦвет");
			
			НомерСтроки = 1;
			
			
			Для Каждого стрВопрос Из  Анкета.Вопросы Цикл 
				
				Если НомерСтроки % 2 = 0 Тогда
					СтрокаМакета = СтрокаЦвет;
				Иначе
					СтрокаМакета = Строка;
				КонецЕсли;
				
				СтрокаМакета.Параметры.Статья = стрВопрос.Формулировка;
				СтрокаМакета.Параметры.Сумма  = стрВопрос.Оценка;
				ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		//	
		ТекущаяПечатнаяФорма.Защита = Истина;
		//	
	Иначе
		Если ПустаяСтрока(рез.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(рез.ОписаниеОшибки);
		КонецЕсли;
		
		Отказ = Истина;
	КонецЕсли;
	
	
	Возврат Отказ;
	
	
КонецФункции



&НаСервере
Функция Сформироватьотчетначисления(ДанныеЗапроса)
	
	   Отказ = Ложь;
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("ВидДокумента", "nchEmployee");
		ПараметрыДокумента.Вставить("ДокументUUID", ДанныеЗапроса.СотрудникUUID);
		рез = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
		Если рез.Результат И рез.Ответ.Количество()=1 Тогда
			
			ДанныеНачислений =  рез.Ответ[0];
			
			Если ДанныеНачислений.СуммаНачисления = 0 И ДанныеНачислений.СуммаУдержания = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
				Возврат Истина;
			КонецЕсли;
			
			//ТекущаяПечатнаяФорма  = Новый ТабличныйДокумент;
			
			МакетОтчета = ПолучитьОбщийМакет("Начисления");
			Область = МакетОтчета.ПолучитьОбласть("ЗаголовокНачисление");
			ТекущаяПечатнаяФорма.Вывести(Область);
			Область = МакетОтчета.ПолучитьОбласть("Шапка");
			ТекущаяПечатнаяФорма.Вывести(Область);
			
			
			Строка = МакетОтчета.ПолучитьОбласть("Строка");
			СтрокаЦвет = МакетОтчета.ПолучитьОбласть("СтрокаЦвет");
			
			НомерСтроки = 1;
			
			
			Для Каждого стрНач Из  ДанныеНачислений.ТаблицаНачислений Цикл 
				
				Если НомерСтроки % 2 = 0 Тогда
					СтрокаМакета = СтрокаЦвет;
				Иначе
					СтрокаМакета = Строка;
				КонецЕсли;
				
				СтрокаМакета.Параметры.Точка  = стрНач.Подразделение;
				СтрокаМакета.Параметры.Статья = стрНач.Статья;
				СтрокаМакета.Параметры.Сумма  = стрНач.Сумма;
				ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 

				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
			Область = МакетОтчета.ПолучитьОбласть("Итого");
			Область.Параметры.Сумма =   ДанныеНачислений.СуммаНачисления;
			ТекущаяПечатнаяФорма.Вывести(Область); 
			
			
			
			Область = МакетОтчета.ПолучитьОбласть("ЗаголовокУдержание");
			ТекущаяПечатнаяФорма.Вывести(Область);
			Область = МакетОтчета.ПолучитьОбласть("Шапка");
			ТекущаяПечатнаяФорма.Вывести(Область);

			НомерСтроки = 1;
			
			Для Каждого стрНач Из  ДанныеНачислений.ТаблицаУдержаний Цикл 
				
				Если НомерСтроки % 2 = 0 Тогда
					СтрокаМакета = СтрокаЦвет;
				Иначе
					СтрокаМакета = Строка;
				КонецЕсли;
				
				СтрокаМакета.Параметры.Точка  = стрНач.Подразделение;
				СтрокаМакета.Параметры.Статья = стрНач.Статья;
				СтрокаМакета.Параметры.Сумма  = стрНач.Сумма;
				ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 

				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
			Область = МакетОтчета.ПолучитьОбласть("Итого");
			Область.Параметры.Сумма =   ДанныеНачислений.СуммаУдержания;
			ТекущаяПечатнаяФорма.Вывести(Область); 
			
			
			Область = МакетОтчета.ПолучитьОбласть("Подвал");
			Область.Параметры.Сумма =   ДанныеНачислений.СуммаНачисления-ДанныеНачислений.СуммаУдержания;
			ТекущаяПечатнаяФорма.Вывести(Область); 
			
			ТекущаяПечатнаяФорма.Защита = Истина;
			
		Иначе
			Если ПустаяСтрока(рез.ОписаниеОшибки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(рез.ОписаниеОшибки);
			КонецЕсли;

			Отказ = Истина;
		КонецЕсли;
	
	
	  Возврат Отказ;
	
	
КонецФункции

&НаСервере
Функция СформироватьОтчетВыплаты(ДанныеЗапроса)
	
	Отказ = Ложь;
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "vypEmployee");
	ПараметрыДокумента.Вставить("ДокументUUID", ДанныеЗапроса.СотрудникUUID);
	рез = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
	Если рез.Результат И рез.Ответ.Количество()=1 Тогда
		
		ДанныеНачислений =  рез.Ответ[0];
		
		Если ДанныеНачислений.СуммаВыплат = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
			Возврат Истина;
		КонецЕсли;
		
		//ТекущаяПечатнаяФорма  = Новый ТабличныйДокумент;
		
		МакетОтчета = ПолучитьОбщийМакет("ЗП_К_Выдаче");
		Область = МакетОтчета.ПолучитьОбласть("ОбластьЗаголовок");
		ТекущаяПечатнаяФорма.Вывести(Область);
		Область = МакетОтчета.ПолучитьОбласть("ОбластьШапка");
		ТекущаяПечатнаяФорма.Вывести(Область);
		
		ОбластьСтрока = МакетОтчета.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрокаЦвет = МакетОтчета.ПолучитьОбласть("ОбластьСтрокаЦвет");

		
		НомерСтроки = 1;

		
		Для Каждого стрНач Из  ДанныеНачислений.ТаблицаВыплат Цикл 
			
			Если НомерСтроки % 2 = 0 Тогда
				СтрокаМакета = ОбластьСтрокаЦвет;
			Иначе
				СтрокаМакета = ОбластьСтрока;
			КонецЕсли;
			
			

			СтрокаМакета.Параметры.ТТ = ДанныеНачислений.DRFO;	
			СтрокаМакета.Параметры.Реализатор = стрНач.Сотрудник;			
			СтрокаМакета.Параметры.КВыдаче = стрНач.Сумма;			

			ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		Область = МакетОтчета.ПолучитьОбласть("ОбластьПодвал");
		Область.Параметры.СуммаИтого = ДанныеНачислений.СуммаВыплат;
		ТекущаяПечатнаяФорма.Вывести(Область); 

		ТекущаяПечатнаяФорма.Защита = Истина;
		
	Иначе
		Если ПустаяСтрока(рез.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(рез.ОписаниеОшибки);
		КонецЕсли;

		Отказ = Истина;
	КонецЕсли;
	
	
	Возврат Отказ;
	
	
КонецФункции

&НаСервере
Функция СформироватьОтчетИнвентаризацияРасхождение(ДанныеЗапроса)
	
	    Отказ = Ложь;
		МакетОтчета = ПолучитьОбщийМакет("РасхождениеИнвентаризация");
		Область = МакетОтчета.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заголовок = ДанныеЗапроса.Документ;
		ТекущаяПечатнаяФорма.Вывести(Область);
		Область = МакетОтчета.ПолучитьОбласть("Шапка");
		ТекущаяПечатнаяФорма.Вывести(Область);
		
		
		Строка = МакетОтчета.ПолучитьОбласть("Строка");
		СтрокаЦвет = МакетОтчета.ПолучитьОбласть("Строка2");
		
		НомерСтроки = 1;
		
		
		Для Каждого стрТч Из  ДанныеЗапроса.Товары Цикл 
			
			Если НомерСтроки % 2 = 0 Тогда
				СтрокаМакета = СтрокаЦвет;
			Иначе
				СтрокаМакета = Строка;
			КонецЕсли;
			
			СтрокаМакета.Параметры.Товар  = стрТч.ТоварыЗаписьПоСтроке;
			СтрокаМакета.Параметры.Данные = стрТч.ТоварыЗаписьПоСтроке2;
			ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		ТекущаяПечатнаяФорма.Защита = Истина;
		
		Возврат Отказ;
	
	
КонецФункции

&НаСервере
Функция СформироватьОтчетОстаткиТНП()
	
	    Отказ = Ложь; 
		
		ПараметрыДокумента = Новый Структура;
		ПараметрыДокумента.Вставить("ВидДокумента", "osttnp");
		ПараметрыДокумента.Вставить("ДокументUUID", Строка(Новый УникальныйИдентификатор()));
		рез = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
		
		Если рез.Результат И рез.Ответ.Количество() Тогда
			
			Макет = ПолучитьОбщийМакет("ПФ_MXL_Остатки");
			Область = Макет.ПолучитьОбласть("Заголовок");
			ТекущаяПечатнаяФорма.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Шапка");
			ТекущаяПечатнаяФорма.Вывести(Область);
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрокаЦвет = Макет.ПолучитьОбласть("СтрокаЦвет");
			
			
			НомерСтроки = 1;
			
			  //"Art,Tovar,Kol,МРЦ"
			Для Каждого стр Из  рез.Ответ Цикл 
				
				Если НомерСтроки % 2 = 0 Тогда
					СтрокаМакета = ОбластьСтрокаЦвет;
				Иначе
					СтрокаМакета = ОбластьСтрока;
				КонецЕсли;
				
				СтрокаМакета.Параметры.Товар =  стр.Art+" "+ стр.Tovar+?(стр.МРЦ=0,""," МРЦ-"+Формат(стр.МРЦ,"ЧЦ=15; ЧДЦ=2; ЧГ="));	
				СтрокаМакета.Параметры.Количество = стр.Kol;			
				
				ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
			ТекущаяПечатнаяФорма.Защита = Истина;
			
			
		Иначе
			Если ПустаяСтрока(рез.ОписаниеОшибки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(рез.ОписаниеОшибки);
			КонецЕсли;
			
			Отказ = Истина;
		КонецЕсли;
	
		//МакетОтчета = ПолучитьОбщийМакет("РасхождениеИнвентаризация");
		//Область = МакетОтчета.ПолучитьОбласть("Заголовок");
		//Область.Параметры.Заголовок = ДанныеЗапроса.Документ;
		//ТекущаяПечатнаяФорма.Вывести(Область);
		//Область = МакетОтчета.ПолучитьОбласть("Шапка");
		//ТекущаяПечатнаяФорма.Вывести(Область);
		//
		//
		//Строка = МакетОтчета.ПолучитьОбласть("Строка");
		//СтрокаЦвет = МакетОтчета.ПолучитьОбласть("Строка2");
		//
		//НомерСтроки = 1;
		//
		//
		//Для Каждого стрТч Из  ДанныеЗапроса.Товары Цикл 
		//	
		//	Если НомерСтроки % 2 = 0 Тогда
		//		СтрокаМакета = СтрокаЦвет;
		//	Иначе
		//		СтрокаМакета = Строка;
		//	КонецЕсли;
		//	
		//	СтрокаМакета.Параметры.Товар  = стрТч.ТоварыЗаписьПоСтроке;
		//	СтрокаМакета.Параметры.Данные = стрТч.ТоварыЗаписьПоСтроке2;
		//	ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
		//	
		//	НомерСтроки = НомерСтроки + 1;
		//	
		//КонецЦикла;
		
		ТекущаяПечатнаяФорма.Защита = Истина;
		
		Возврат Отказ;
	
	
КонецФункции

&НаСервере
Функция СформироватьОтчетPKG()
	
	    Отказ = Ложь; 
		
	
		МакетОтчета = ПолучитьОбщийМакет("ДанныеPKG");
		Область = МакетОтчета.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заголовок = Параметры.ТочкаДоставки;
		ТекущаяПечатнаяФорма.Вывести(Область);
		Область = МакетОтчета.ПолучитьОбласть("Шапка");
		ТекущаяПечатнаяФорма.Вывести(Область);
		
		
		Строка = МакетОтчета.ПолучитьОбласть("Строка");
		СтрокаЦвет = МакетОтчета.ПолучитьОбласть("Строка2");
		
		НомерСтроки = 1;
		//
		
		Для Каждого стрТч Из  Параметры.ДанныеPKG Цикл 
			
			Если НомерСтроки % 2 = 0 Тогда
				СтрокаМакета = СтрокаЦвет;
			Иначе
				СтрокаМакета = Строка;
			КонецЕсли;
			
			СтрокаМакета.Параметры.СкладСборки  = стрТч.СкладСборки;
			СтрокаМакета.Параметры.сч_скан = стрТч.сч_скан; 
			СтрокаМакета.Параметры.НомерТУ = стрТч.НомерТУ;

			ТекущаяПечатнаяФорма.Вывести(СтрокаМакета); 
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		ТекущаяПечатнаяФорма.Защита = Истина;
		
		Возврат Отказ;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяПечатнаяФорма.Очистить();
	ФормаПечатьПДФ = Ложь;
	Если Параметры.Свойство("ПечатьПДФ") Тогда
		ФормаПечатьПДФ = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечтьТабДок", "Видимость", НЕ ФормаПечатьПДФ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечатьПДФ", "Видимость", ФормаПечатьПДФ);
	
	
	
	Если Параметры.Свойство("СформироватьОтчетНачисления") Тогда
		Отказ = СформироватьОтчетНачисления(Параметры.СформироватьОтчетНачисления);	
	ИначеЕсли Параметры.Свойство("СформироватьОтчетВыплата") Тогда
		Отказ = СформироватьОтчетВыплаты(Параметры.СформироватьОтчетВыплата);	
	ИначеЕсли Параметры.Свойство("СформироватьОтчетИнвентаризацияРасхождение") Тогда	
		Отказ = СформироватьОтчетИнвентаризацияРасхождение(Параметры.СформироватьОтчетИнвентаризацияРасхождение);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Печать", "Видимость", Истина);
	ИначеЕсли Параметры.Свойство("СформироватьОтчетАнкетирование") Тогда
		Отказ = СформироватьОтчетРезультатыАнкет(Параметры.СформироватьОтчетАнкетирование);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Печать", "Видимость", Ложь);
	ИначеЕсли Параметры.Свойство("СформироватьОтчетОстаткиТНП") Тогда
		Отказ = СформироватьОтчетОстаткиТНП();	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Печать", "Видимость", Ложь);
	ИначеЕсли Параметры.Свойство("PKG") Тогда
		Отказ = СформироватьОтчетPKG();	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Печать", "Видимость", Ложь);
		//ИначеЕсли Параметры.Свойство("ПутьПДФ") Тогда
		//	  ПутьФайлПДФ = Параметры.ПутьПДФ;  
		//  ИначеЕсли Параметры.Свойство("АдресХранилища") Тогда
		//	  ЭтотОбъект.ПутьФайлПДФ = Параметры.АдресХранилища;
	КонецЕсли;  
	Если ФормаПечатьПДФ Тогда
		//#Если МобильноеПриложениеКлиент Или МобильныйКлиент Тогда
			//ПутьКФайлу = КаталогВременныхФайлов() + "view_temp.pdf";
			//Параметры.ДвоичныеДанныеПечать.Записать(ПутьКФайлу);
			 ПутьФайлПДФ = Параметры.ПутьКФайлу;
		// #Иначе  
		//	 //ПутьКФайлу = КаталогВременныхФайлов() + "view_temp.pdf";
		//	 //Параметры.ДвоичныеДанныеПечать.Записать(ПутьКФайлу);

		//	 //ПутьФайлПДФ = "file:///" + СтрЗаменить(ПутьКФайлу, "\", "/");
		//	 //ЗаполнитьHTML(Параметры.ДвоичныеДанныеПечать);
		//	АдресХранилища = ПоместитьВоВременноеХранилище(Параметры.ДвоичныеДанныеПечать, ЭтаФорма.УникальныйИдентификатор);
		//	//
		//	ПутьФайлHTML = АдресХранилища;	
		//	//
		//#КонецЕсли   
	КонецЕсли;
	

КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьHTML(ДвоичныеДанныеPDF)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанныеPDF);
	
	// Формируем HTML-контейнер
	ТекстHTML = "
	
	|<html>
	|<body style='margin:0; padding:0; overflow:hidden;'>
	|   <embed src='data:application/pdf;base64," + СтрокаBase64 + "' 
	
	|          type='application/pdf' 
	|          width='100%' 
	|          height='100%' />
	
	|</body>
	|</html>";
	
	// Присваиваем реквизиту, который связан с Полем HTML-документа
	ПутьФайлHTML = ТекстHTML; 
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТекущаяПечатнаяФорма.Напечатать(РежимИспользованияДиалогаПечати.Использовать);	
	Закрыть("ОК");
КонецПроцедуры
