
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;

    НастроитьФормуПоЗначениямНастроек();

    НаборКонстант = Константы.СоздатьНабор(СписокКонстант());
    НаборКонстант.Прочитать();

    ЗаполнитьЗначенияСвойств(ЭтотОбъект, НаборКонстант, СписокКонстант());
    ИспользоватьЗаказыКлиентовФО        = ИспользоватьЗаказыКлиентов;
    ИспользоватьПриемТоваровФО          = ИспользоватьПриемТоваров;
    ИспользоватьПроверкуЦенФО           = ИспользоватьПроверкуЦен;
    ИспользоватьПеремещениеТоваровФО    = ИспользоватьСписаниеТоваров;
    ИспользоватьИнвентаризациюТоваровФО = ИспользоватьИнвентаризациюТоваров;
    ИспользоватьЖурналДокументовФО      = ИспользоватьЖурналДокументов;
    ИспользоватьВозвратТовараФО         = ИспользоватьВозвратТовара;
    ИспользоватьУценкуТовараФО          = ИспользоватьУценкуТовара;
    ИспользоватьКомплектациюТоваровФО   = ИспользоватьКомплектациюТоваров;
    ИспользоватьИнвентаризацияКоммисияФО= ИспользоватьИнвентаризацияКоммисия;

    ИспользоватьПереоценкиФО			= ИспользоватьПереоценки;
    ИспользоватьЗадачиФО				= ИспользоватьЗадачи;
    ИспользоватьМенеджерТЗФО			= ИспользоватьМенеджерТЗ;
    ИспользоватьПриходУходФО			= ИспользоватьПриходУход;
    ИспользоватьКонтролераФО			= ИспользоватьКонтролера;
    ИспользоватьЛогистикаФО			    = ИспользоватьЛогистика;
    ИспользоватьЖурналПриемПоЗаказуФО			= ИспользоватьЖурналПриемПоЗаказу;
    ИспользоватьЖурналПриемТоваровФО			= ИспользоватьЖурналПриемТоваров;
    ИспользоватьЖурналПеремещениеФО			    = ИспользоватьЖурналПеремещение;
    ИспользоватьЖурналПереоценкаФО			    = ИспользоватьЖурналПереоценка;
    ИспользоватьЖурналИнвентаризацияФО			= ИспользоватьЖурналИнвентаризация;
    ИспользоватьЖурналПечатьФО		        	= ИспользоватьЖурналПечать;
    ИспользоватьЖурналЗаказыПоставщикуФО		= ИспользоватьЖурналЗаказыПоставщику;
    ИспользоватьЖурналРекламацияФО		= ИспользоватьЖурналРекламация;

    ИспользоватьФотоФО		        	= ИспользоватьФото;
    ИспользоватьСканировкаТабакаФО		= ИспользоватьСканировкаТабака;
    ИспользоватьПечатьНаПринтерФО		= ИспользоватьПечатьНаПринтер;

    ИспользоватьПриемПоЗаказуНовФО           = ИспользоватьПриемПоЗаказуНов;
    ИспользоватьПриемТоваровНовФО            = ИспользоватьПриемТоваровНов;
    ИспользоватьПрийомПеремещенияНовФО       = ИспользоватьПрийомПеремещенияНов;
    ИспользоватьПечатьРеестраНовФО           = ИспользоватьПечатьРеестраНов;
    ИспользоватьЗаказПоставщикуНовФО         = ИспользоватьЗаказПоставщикуНов;

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаОперацииЖурналаДокументов",
        "Видимость", ИспользоватьЖурналДокументов);
	
	// АдминистративныйРежим
    ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтотОбъект);
	
	// ОриентацияЭкрана
    ПриИзмененииПараметровЭкранаСервер();
    ОбновитьПодразделение();

КонецПроцедуры

 &НаСервере
Процедура ОбновитьПодразделение()

    Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
        Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтотОбъект, "СообщениеИнициализации");
    Иначе
        Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтотОбъект, "СообщениеИнициализации");
    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		// АдминистративныйРежим
		НастроитьФормуПоАдминистративномуРежиму();
		НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	ИначеЕсли ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		НастроитьФормуПоЗначениямНастроек();
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		ОбщегоНазначенияКлиент.УстановитьРасширенныйЗаголовокПриложения();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ОбщегоНазначенияКлиент.ПередЗакрытиемФормыНастроек(ЭтаФорма, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов


 &НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ПодключитьОбработчикОжидания("НастроитьФормуПоАдминистративномуРежимуКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдминистративныйРежимНажатие(Элемент)
	// АдминистративныйРежим
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СохранитьНаКлиенте();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьНаКлиенте() Экспорт
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		Если ИзмененаФО Тогда
			ОбновитьИнтерфейс();
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ)
    Если Не ИспользоватьЗаказыКлиентов = ИспользоватьЗаказыКлиентовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПриемТоваров = ИспользоватьПриемТоваровФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПроверкуЦен = ИспользоватьПроверкуЦенФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьСписаниеТоваров = ИспользоватьСписаниеТоваровФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПеремещениеТоваров = ИспользоватьПеремещениеТоваровФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналДокументов = ИспользоватьЖурналДокументовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьИнвентаризацияКоммисия = ИспользоватьИнвентаризацияКоммисияФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПереоценки = ИспользоватьПереоценкиФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЗадачи = ИспользоватьЗадачиФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьМенеджерТЗ = ИспользоватьМенеджерТЗФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПриходУход = ИспользоватьПриходУходФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПриемПоЗаказуНов = ИспользоватьПриемПоЗаказуНовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПриемТоваровНов = ИспользоватьПриемТоваровНовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПрийомПеремещенияНов = ИспользоватьПрийомПеремещенияНовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПечатьРеестраНов = ИспользоватьПечатьРеестраНовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЗаказПоставщикуНов = ИспользоватьЗаказПоставщикуНовФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналПриемПоЗаказу = ИспользоватьЖурналПриемПоЗаказуФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналПриемТоваров = ИспользоватьЖурналПриемТоваровФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналПеремещение = ИспользоватьЖурналПеремещениеФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналПереоценка = ИспользоватьЖурналПереоценкаФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналИнвентаризация = ИспользоватьЖурналИнвентаризацияФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналПечать = ИспользоватьЖурналПечатьФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьФото = ИспользоватьФотоФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналЗаказыПоставщику = ИспользоватьЖурналЗаказыПоставщикуФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьКонтролера = ИспользоватьКонтролераФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьПечатьНаПринтер = ИспользоватьПечатьНаПринтерФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЛогистика = ИспользоватьЛогистикаФО Тогда
        ИзмененаФО = Истина;
    ИначеЕсли Не ИспользоватьЖурналРекламация = ИспользоватьЖурналРекламацияФО Тогда
        ИзмененаФО = Истина;

    КонецЕсли;
    ОбщегоНазначения.СохранитьКонстантыФормы(ЭтотОбъект, СписокКонстант(), Отказ);

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()

    ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);

    Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим()
        Или Не ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() Тогда
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, СписокКонстант(), "Видимость", Ложь);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ИспользоватьЗаказыКлиентов",
            "Видимость", Истина);

    Иначе
        Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, СписокКонстант(), "Видимость",
                Истина);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
                "ИспользоватьКомплектациюТоваров", "Видимость", Ложь);

        Иначе
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, СписокКонстант(), "Видимость",
                Ложь);
            ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект,
                "ИспользоватьКомплектациюТоваров", "Видимость", Истина);
        КонецЕсли;

        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ИспользоватьЗаказыКлиентов",
            "Видимость", Ложь);
    КонецЕсли;

КонецПроцедуры


&НаСервере
Функция СписокКонстант()
	
	Возврат
	"ИспользоватьСписаниеТоваров,
	|ИспользоватьЗаказыКлиентов,
	|ИспользоватьКомплектациюТоваров,
	|ИспользоватьУценкуТовара,
	|ИспользоватьПроверкуЦен,
	|ИспользоватьПеремещениеТоваров,
	|ИспользоватьИнвентаризациюТоваров,
	//|ИспользоватьИнвентаризацияКоммисия,
	//|ИспользоватьЖурналДокументов,
	|ИспользоватьПриемПоЗаказуНов,
	|ИспользоватьПриемТоваровНов,
	|ИспользоватьПрийомПеремещенияНов,
	|ИспользоватьПечатьРеестраНов,
	|ИспользоватьЗаказПоставщикуНов,
	|ИспользоватьВозвратТовара,
	|ИспользоватьПереоценки,
	|ИспользоватьЗадачи,
	|ИспользоватьМенеджерТЗ,
	|ИспользоватьПриходУход,
	|ИспользоватьЖурналПриемПоЗаказу,
	|ИспользоватьЖурналПриемТоваров,
	|ИспользоватьЖурналПеремещение,
	|ИспользоватьЖурналПереоценка,
	|ИспользоватьЖурналИнвентаризация,
	|ИспользоватьЖурналПечать, 
	|ИспользоватьЖурналРекламация,
	|ИспользоватьФото,
	|ИспользоватьПечатьНаПринтер,
	|ИспользоватьЖурналЗаказыПоставщику,
	|ИспользоватьСканировкаТабака,
	|ИспользоватьПриемТоваров,
	|ИспользоватьЛогистика,
	|ИспользоватьКонтролера";
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыАдминистративныйРежим

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПоАдминистративномуРежиму()
	
	//СписокТолькоПросмотр = "ИспользоватьСписаниеТоваров,
	//|ИспользоватьЗаказыКлиентов,
	//|ИспользоватьПроверкуЦен,
	//|ИспользоватьПеремещениеТоваров,
	//|ИспользоватьИнвентаризациюТоваров,
	//|ИспользоватьЖурналДокументов,
	//|ИспользоватьВозвратТовара,
	//|ИспользоватьПриемТоваров";
	//
	СписокДоступность = "Готово";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,  СписокКонстант(), "ТолькоПросмотр", НЕ АдминистративныйРежим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокДоступность, "Доступность", АдминистративныйРежим);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПоАдминистративномуРежимуКлиент()
	
	НастроитьФормуПоАдминистративномуРежиму(Истина);
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму(УстановитьРежим = Ложь)
	
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма, УстановитьРежим);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
		
		//Элементы.ГруппаБезналичнаяОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//Элементы.ГруппаКассиры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//
		//Элементы.ОтступБезналичнаяОплата.РастягиватьПоГоризонтали = Истина;
		//Элементы.ОтступКассиры.РастягиватьПоГоризонтали = Истина;
		
	Иначе
		//Элементы.ГруппаБезналичнаяОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		//Элементы.ГруппаКассиры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		//
		//Элементы.ОтступБезналичнаяОплата.РастягиватьПоГоризонтали = Ложь;
		//Элементы.ОтступКассиры.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЖурналДокументовПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОперацииЖурналаДокументов", "Видимость", ИспользоватьЖурналДокументов);

КонецПроцедуры

#КонецОбласти
