
&НаКлиенте
Перем ВыполняетсяЗакрытие;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	МассивПараметров = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(Параметры.СтрокаДоступа,";");
	Если МассивПараметров.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	      
	ДанныеЗапроса = ИнтеграцияТК_ВызовСервера.ПолучитьСтатусДоверенногоЛица(МассивПараметров[1]);
	Если ДанныеЗапроса.Результат Тогда
		Если ДанныеЗапроса.Ответ.Статус = 0 Тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаДоступЗапрещен;
		Иначе
			ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаДоступРазрешен;
			Элементы.ТекущийСотрудник.Заголовок = ДанныеЗапроса.Ответ.ФИО; 
			ДатаОбновления =  ДанныеЗапроса.Ответ.ДатаОбновления;
			КодПоДРФО      =  ДанныеЗапроса.Ответ.КодПоДРФО;
			Если ЗначениеЗаполнено(ДанныеЗапроса.Ответ.Фото) Тогда
				СтруктураПодключения = ИнтеграцияТК.ПараметрыПодключенияФайлаКартинки(ДанныеЗапроса.Ответ.Фото);
				Соединение = Новый HTTPСоединение(СтруктураПодключения.АдресСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
				
				Запрос = Новый HTTPЗапрос(СтруктураПодключения.ИмяКаталога);
				Ответ = Соединение.Получить(Запрос);
				Если Ответ.КодСостояния = 200 Тогда
					Картинка = Новый Картинка(Ответ.ПолучитьТелоКакДвоичныеДанные());
					ПутьФото =  ПоместитьВоВременноеХранилище(Картинка , Новый УникальныйИдентификатор);
				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаОшибка;

		Элементы.Описание.Заголовок = ДанныеЗапроса.ОписаниеОшибки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Декорация1НажатиеНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	
	ДаныеПосетителя = Новый Структура("КодПоДРФО,ДатаОбновления,Приход", КодПоДРФО ,ДатаОбновления,1);
	Рез = ЗафиксироватьПосетителяНаСервере(ДаныеПосетителя);
	
	Если Рез.Результат Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		Сообщить("Не удалось записать!");
	КонецЕсли;

	
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	
	ДаныеПосетителя = Новый Структура("КодПоДРФО,ДатаОбновления,Приход", КодПоДРФО ,ДатаОбновления,0);
	Рез = ЗафиксироватьПосетителяНаСервере(ДаныеПосетителя);
	
	Если Рез.Результат Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		Сообщить("Не удалось записать!");
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ЗафиксироватьПосетителяНаСервере(ДаныеПосетителя)
	
	ДаныеПосетителя.Вставить("ДоументСервер",Ложь);
	ДаныеПосетителя.Вставить("ДатаСобытия",ТекущаяДатаСеанса());

	ТипДокумента  = Справочники.ТипыДокументов.Посетители;
	Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(ДаныеПосетителя,ТипДокумента);
	
	Возврат Рез;
	
	
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполняетсяЗакрытие = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ВыполняетсяЗакрытие Тогда
		
	Иначе
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрыть?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры
