
#Область ПрограммныйИнтерфейс

Функция ОпределитьНеобходимостьОбновления() Экспорт
	
	СписокОбработчиковОбновления = ПолучитьСписокОбработчиковОбновленияТекущейВерсии();
	
	Возврат НЕ СписокОбработчиковОбновления.Количество() = 0;
	
КонецФункции


Функция СписокОбработчиковОбновления()
	
	СписокОбработчиков = Новый Массив;
	//СписокОбработчиков.Добавить("2.0.3");
	//СписокОбработчиков.Добавить("2.6.1");
	//СписокОбработчиков.Добавить("2.11.1");
	
	СписокОбработчиков.Добавить("1.0.88");
	СписокОбработчиков.Добавить("1.0.99");
	СписокОбработчиков.Добавить("1.1.00"); 
	СписокОбработчиков.Добавить("1.3.03");
    СписокОбработчиков.Добавить("1.7.36");
    СписокОбработчиков.Добавить("1.7.76");
     СписокОбработчиков.Добавить("1.7.81");

	Возврат СписокОбработчиков;
	
КонецФункции

Процедура ОбновитьБазуДанных(Отказ, Лог) Экспорт
	
	НоваяВерсияПриложения = Метаданные.Версия;
	
	СписокОбработчиков = ПолучитьСписокОбработчиковОбновленияТекущейВерсии();
	
	Попытка
		
		Для Каждого Обработчик Из СписокОбработчиков Цикл
			
			Если Обработчик = "1.0.88" Тогда
				ВыполнитьОбновление1_0_88();
			КонецЕсли;
			
			Если Обработчик = "1.0.99" Тогда
				ВыполнитьОбновление1_0_99();
			КонецЕсли;
			
			Если Обработчик = "1.1.00" Тогда
				ВыполнитьОбновление1_1_00();
			КонецЕсли;
			
			
			Если Обработчик = "1.3.03" Тогда
				ВыполнитьОбновление1_3_02();
			КонецЕсли;
			
			Если Обработчик = "1.7.36" Тогда //обновим данные по ТП
				ВыполнитьОбновление1_3_02();
			ИначеЕсли Обработчик = "1.7.79" Тогда
				ВыполнитьОбновление1_7_73(); 
			ИначеЕсли Обработчик = "1.7.81" Тогда
				ВыполнитьОбновление1_7_73();
				
			КонецЕсли;
			

		КонецЦикла;
		
		Константы.ТекущаяВерсияПриложения.Установить(НоваяВерсияПриложения);
		ОбновитьПовторноИспользуемыеЗначения();
		
	Исключение
		
		Отказ = Истина;
		Лог = ОписаниеОшибки();
		
	КонецПопытки;
	
	ПараметрыСеанса.ОбновлениеБД = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбновления


Процедура ВыполнитьОбновление1_0_88()
	Если Константы.ИспользоватьЖурналДокументов.Получить() Тогда
		
		Константы.ИспользоватьЖурналПриемПоЗаказу.Установить(Истина);
		Константы.ИспользоватьЖурналПриемТоваров.Установить(Истина);
		Константы.ИспользоватьЖурналПеремещение.Установить(Истина);
		Константы.ИспользоватьЖурналПереоценка.Установить(Истина);
		Константы.ИспользоватьЖурналИнвентаризация.Установить(Истина);
		Константы.ИспользоватьЖурналПечать.Установить(Истина);
		
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОбновление1_1_00()
	Если Константы.ИспользоватьЖурналДокументов.Получить() Тогда
		
		Константы.ИспользоватьЖурналЗаказыПоставщику.Установить(Истина);
		
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОбновление1_3_02()
	
	ПрефПодразделения ="0|"+ЗначениеНастроекВызовСервераПовтИсп.ПодразделениеUUID(); 
	Рез =  ИнтеграцияТК_ВызовСервера.ПолучитьПодразделение(ПрефПодразделения);
	
КонецПроцедуры


Процедура ВыполнитьОбновление1_0_99()
	Константы.ИспользоватьФото.Установить(Истина);
КонецПроцедуры

 Процедура ВыполнитьОбновление1_7_73()
	
	 Массив = Новый Массив;
	 Массив.Добавить("249990");  
	 Массив.Добавить("9056");  
	 Массив.Добавить("9392");
	 Массив.Добавить("9153");
	 Массив.Добавить("764921");
	 Массив.Добавить("719775");
	 Массив.Добавить("720087");
	 Массив.Добавить("9015");   
	 Массив.Добавить("9025"); 
	 Массив.Добавить("764549");
	 Массив.Добавить("764550");  
	 Массив.Добавить("9055");   
	 Массив.Добавить("761600");
	 Массив.Добавить("760700");
	 Массив.Добавить("761700");
	 
	 НаборЗаписей = РегистрыСведений.ДоступнаяНоменклатураДляВозвратара.СоздатьНаборЗаписей();
	 Для Каждого Артикул Из Массив Цикл 
		 НоваяЗапись = НаборЗаписей.Добавить();
		 НоваяЗапись.Артикул = Артикул;
	 КонецЦикла;

	 
	 НаборЗаписей.Записать();
	
 КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Сравнить две строки версий.
//
// Параметры:
//  СтрокаВерсии1  - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.
//  СтрокаВерсии2  - Строка - второй сравниваемый номер версии.
//
// Возвращаемое значение:
//   Число   - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
//
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0", СтрокаВерсии2);
	
	Версия1 = СтрРазделить(Строка1, ".");
	Если Версия1.Количество() <> 3 Тогда
		ВызватьИсключение ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии1);
	КонецЕсли;
	
	Версия2 = СтрРазделить(Строка2, ".");
	Если Версия2.Количество() <> 3 Тогда
		
		ВызватьИсключение ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неправильный формат параметра СтрокаВерсии2: %1'"), СтрокаВерсии2);
	КонецЕсли;
	
	Результат = 0;
	
	Для Разряд = 0 По 2 Цикл
		Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		Если Результат <> 0 Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокОбработчиковОбновленияТекущейВерсии()
	
	СписокОбработчиковОбновления = Новый Массив;
	
	ТекущаяВерсия = ЗначениеНастроекВызовСервераПовтИсп.ТекущаяВерсияПриложения();
	СписокОбработчиков = СписокОбработчиковОбновления();
	
	Для Каждого Обработчик Из СписокОбработчиков Цикл
		
		Если СравнитьВерсии(ТекущаяВерсия, Обработчик) < 0 Тогда
			
			СписокОбработчиковОбновления.Добавить(Обработчик);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокОбработчиковОбновления;
	
КонецФункции

#КонецОбласти