&НаКлиенте
Перем ВыполняетсяЗакрытие;


	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	
	
	НастроитьФормуПоЗначениямНастроек();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь; 
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Записать", "Видимость",Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
		Если ПользовательИнициализирован Тогда
			  ПолучитьДанныеPKG_В_Дороге();
			 // ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Записать", "Видимость",Объект.Документы.Количество()>0);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры




////
&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	//ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиОбновления()
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ОбновитьСписок", "Доступность",
	 Инициализирован И ПользовательИнициализирован);
	
КонецПроцедуры   

 &НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
		
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	//ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиОбновления();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
	
КонецПроцедуры

 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры


    
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;  
	КонецЕсли;
	//
	//Если СтрНачинаетсяС(ПолученныйШтрихкод,"TE;") Тогда 
	//    ТЕИнфо = ПолучитьДанныеPKG_На_ТЕ(ПолученныйШтрихкод);
	//	Если ТЕИнфо.Результат Тогда
	//		Для Каждого КоробИД Из  ТЕИнфо.Ответ Цикл 
	//				ОбработатьPKG(КоробИД,Истина); 
	//		КонецЦикла;
	//	Иначе
	//		Сообщить("Помилка сканування ТО "+ ТЕИнфо.ОписаниеОшибки);	
	//	КонецЕсли;
	//ИначеЕсли СтрНачинаетсяС(ПолученныйШтрихкод,"RK;") Тогда 
	//    ТЕИнфо = ПолучитьДанныеPKG_На_РК(ПолученныйШтрихкод);
	//	Если ТЕИнфо.Результат Тогда
	//		Для Каждого Короб Из  ТЕИнфо.Ответ.МассивPKG Цикл 
	//				ОбработатьPKG(Короб.ИД_PKG,Истина); 
	//		КонецЦикла;
	//	Иначе
	//		Сообщить("Помилка сканування РК "+ ТЕИнфо.ОписаниеОшибки);	
	//	КонецЕсли;
	//Иначе
	//	МСтроки =  СтрРазделить(ПолученныйШтрихкод,";");
	//	Если НЕ МСтроки.Количество() = 3  Тогда
	//		Сообщить("Відскануйте PKG");
	//		Возврат;
	//	КонецЕсли;
	//	
	//	ИД_Короб = МСтроки[0];
	//	ОбработатьPKG(ИД_Короб); 
	//КонецЕсли;
	
	
//	ПодключитьОбработчикОжидания("Подключаемый_ТекущаяСтрока", 1,Истина);
	
	//ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", 2,Истина);

	
КонецПроцедуры 



&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 


&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры




//////
&НаСервере
Процедура ПолучитьДанныеPKG_В_Дороге()

 текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/PKGroad?uuidcom="+ПараметрыСеанса.Сотрудник_ID;

  РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
  Объект.Документы.Очистить();
  
  Если РезОтвет.Результат Тогда
	  
	 МассивДокументы = РезОтвет.Ответ; 
	 Для Каждого ДокументыДоставки Из МассивДокументы Цикл 
	    НстрокаДоставка =  Объект.Документы.Добавить();
	    НстрокаДоставка.ТочкаДоставки  = ДокументыДоставки.АдресДоставки;
	    НстрокаДоставка.сч_док  = ДокументыДоставки.сч_док;    
		НстрокаДоставка.ЗаписьПоСтроке = ДокументыДоставки.АдресДоставки;   
		НстрокаДоставка.ЗаписьПоСтроке2 = "PKG "+Формат(НстрокаДоставка.сч_док,"ЧЦ=10; ЧГ=");
	    Для Каждого СтрокаPKG Из  ДокументыДоставки.МассивPKG Цикл 
	    	 НстрокаPKG =  Объект.Документы.Добавить();
	    	 НстрокаPKG.ИД_УП  = СтрокаPKG.ИД_PKG;
	 //        НстрокаPKG.РК = СтрокаТочкаДоставки.РК;
 	    	 НстрокаPKG.ЗаписьПоСтроке =  "PKG "+  СтрокаPKG.НомерPKG+ " від "+СтрокаPKG.ДатаPKG;
	     КонецЦикла;
	 КонецЦикла;
	 
	  
  Иначе
	 тОш =  ?(ЗначениеЗаполнено(РезОтвет.ОписаниеОшибки),РезОтвет.ОписаниеОшибки,"Помилка отримання даних"); 
	 Сообщить(тОш);    
	 ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	 ОбновитьСотрудника();
  КонецЕсли;
  

КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ИД_УП)
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/PKGprint?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ИД_УП;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    Возврат РезОтвет;
КонецФункции



&НаКлиенте
Процедура Подключаемый_ТекущаяСтрока()
	
	Элементы.Документы.ТекущаяСтрока = ТекИдентификаторСтроки;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    ТекущиеДанные = Элементы.Документы.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ИД_УП) Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = ПечатьНаСервере(ТекущиеДанные.ИД_УП);
	Если Ответ.Результат = Ложь Тогда
		Сообщить(Ответ.ОписаниеОшибки);
	Иначе
		ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Base64Значение(Ответ.Ответ));
	КонецЕсли;
	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Если ПользовательИнициализирован Тогда
		ПолучитьДанныеPKG_В_Дороге();	
	КонецЕсли;
	
КонецПроцедуры


