

Процедура ПрочитатьДанныеПодразделения(ОбменДанными,Результат) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса подразделения, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Сообщить("Код ответа" + ОбменДанными.Ответ.КодСостояния);
		Возврат;
	КонецЕсли;       
	
	СтароеПодразделение = ПараметрыСеанса.UUID;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	ОбщегоНазначения.УстановитьUUID(СтруктураДанных.UUID);
	ОбщегоНазначения.УстановитьПодразделение(СтруктураДанных.Name);
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("UUID",СтруктураДанных.UUID);
	ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("Подразделение",СтруктураДанных.Name);
	
	Если СтруктураДанных.Свойство("ATT") Тогда
		ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("ЭтоАттика",СтруктураДанных.ATT);
		ОбщегоНазначения.УстановитьАТТ(?(СтруктураДанных.ATT=1,Истина,Ложь));
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ID") Тогда
		ОбщегоНазначенияВызовСервера.УстановитьЗначениеКонстанты("НомерТТ",СтруктураДанных.ID);
		ОбщегоНазначения.УстановитьНомерТТ(СтруктураДанных.ID);
	КонецЕсли;
	
	Если СтароеПодразделение <> ПараметрыСеанса.UUID Тогда
		СисИнфо = Новый СистемнаяИнформация;  
		МодельУстройства = СисИнфо.ВерсияОС;
		ID_Устройства = Строка(СисИнфо.ИдентификаторКлиента);
		
		Токен = ОбщегоНазначенияВызовСервера.ПолучитьСохраненныйТокен(ID_Устройства);
		Если НЕ ПустаяСтрока(Токен) Тогда	
			Ответ = ИнтеграцияТК_ВызовСервера.ОтправитьТокен(ID_Устройства,МодельУстройства,Токен);	
			Если Ответ.Результат Тогда
				ОбщегоНазначенияВызовСервера.ЗаписатьНовыйТокен(ID_Устройства,Токен);
			КонецЕсли;
		КонецЕсли;	
		
		
	КонецЕсли;
	

	
	Результат.Результат = Истина;
	Результат.Ответ = СтруктураДанных.Name;


КонецПроцедуры

Процедура ПрочитатьДанныеСотрудника(ОбменДанными,Результат) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса подразделения, код состояния " +  ОбменДанными.Ответ.КодСостояния+Символы.ПС+ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	Если СтруктураДанных.Результат  Тогда
		 
		ОбщегоНазначения.УстановитьСотрудник_ID(СтруктураДанных.Ответ.UUID);
		ОбщегоНазначения.УстановитьСотрудника(СтруктураДанных.Ответ.Name);
		
		Результат.Результат = Истина;
		Результат.Ответ = СтруктураДанных.Ответ;
		
	Иначе
		Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;

	КонецЕсли;

КонецПроцедуры



Процедура ПрочитатьДанныеПоТовару(ОбменДанными,Результат,Кратко,ВерификацияЦен) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		//Если ВерификацияЦен Тогда
		//	Ответ= СтруктураДанных.Ответ;
		//ИначеЕсли Кратко тогда
		//	Ответ = Новый Структура("Артикул,НаименованиеТовара,НаименованиеЕденицы,Коэффициент,Количество,ШтрихКод,ТоварБезЦенника");
		//	Ответ.Вставить("Количество",0);
		//Иначе
		//	Ответ = Новый Структура("Артикул,Еденица,Номенклатура,Остаток,СпецЦена,Цена,ЕстьСверка,ЦенаПроверена,ЦенаЦенник,ШтрихКод,ТоварБезЦенника");
		//КонецЕсли;
		//ЗаполнитьЗначенияСвойств(Ответ,СтруктураДанных.Ответ);
		//Результат.Ответ = Ответ;
		Результат.Ответ = СтруктураДанных.Ответ;
	КонецЕсли;
	 
	
КонецПроцедуры

Процедура ПрочитатьДанныеПоСкладам(ОбменДанными,Результат) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса складов, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		СписокЗначенийОтвет = Новый СписокЗначений;
		
		Для Каждого СтрСклад Из    СтруктураДанных.Ответ Цикл 
			Если СтрСклад.Свойство("ТНП")Тогда
				ПометкаСкладТНП  = ?(СтрСклад.ТНП = 0 ,ложь, Истина);
			Иначе
				ПометкаСкладТНП = Ложь;
			КонецЕсли;
			
			СписокЗначенийОтвет.Добавить(СтрСклад.СкладUUID,СтрСклад.Склад,ПометкаСкладТНП)
		КонецЦикла;
		
		Результат.Ответ = СписокЗначенийОтвет;
	КонецЕсли;
	 
	
КонецПроцедуры

Процедура ПрочитатьДанныеСтатьиВозврата(ОбменДанными,Результат) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса статьи  возврата, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		СписокЗначенийОтвет = Новый СписокЗначений;
		
		Для Каждого СтрОтвет Из    СтруктураДанных.Ответ Цикл 

			СписокЗначенийОтвет.Добавить(СтрОтвет.СтатьяUUID,СтрОтвет.Статья)
		КонецЦикла;
		
		Результат.Ответ = СписокЗначенийОтвет;
	КонецЕсли;
	 
	
КонецПроцедуры


Процедура ПрочитатьДанныеПоКонтрагенту(ОбменДанными,Результат) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса контрагента, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		
		Результат.Ответ = СтруктураДанных.Ответ;
	Иначе
		Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
		Результат.Результат = Ложь;
	КонецЕсли;
	 
	
КонецПроцедуры

Процедура ПрочитатьДанныеПоСтатусуДоверенногоЛица(ОбменДанными,Результат) Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON,,"ДатаОбновления",ФорматДатыJSON.ISO);
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		
		Результат.Ответ = СтруктураДанных.Ответ;
	Иначе
		Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
		Результат.Результат = Ложь;
	КонецЕсли;
	 
	
КонецПроцедуры


Процедура ПрочитатьДанные(ОбменДанными,Результат,ДатаJSON="")Экспорт
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	Если ПустаяСтрока(ДатаJSON) Тогда
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	Иначе
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON,,ДатаJSON,ФорматДатыJSON.ISO);
	КонецЕсли;
	
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		Результат.Ответ = СтруктураДанных.Ответ;
	КонецЕсли;

КонецПроцедуры

Процедура ПрочитатьДанныеПоТорговымПлощадкам(ОбменДанными, Результат) Экспорт 
	
	Если ОбменДанными.Ответ.КодСостояния <> 200  Тогда
		Результат.Результат = Ложь;
		Результат.ОписаниеОшибки = "Ошибка выполнения запроса складов, код состояния " +  ОбменДанными.Ответ.КодСостояния;
		Возврат;
	КонецЕсли;
	
	ПотокДанных = ОбменДанными.Ответ.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;                       
	ЧтениеJSON.УстановитьСтроку(ПотокДанных);
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	
	
	Результат.Результат      = СтруктураДанных.Результат;
	Результат.ОписаниеОшибки = СтруктураДанных.ОписаниеОшибки;
	
	Если СтруктураДанных.Результат Тогда
		СписокЗначенийОтвет = Новый СписокЗначений;
		
		Для Каждого СтрТП Из СтруктураДанных.Ответ Цикл 
			СписокЗначенийОтвет.Добавить(СтрТП.ТорговаяПлощадкаUUID, СтрТП.ТорговаяПлощадка);
		КонецЦикла;
		
		Результат.Ответ = СписокЗначенийОтвет;
	КонецЕсли;
	
КонецПроцедуры


Функция HTTPСоединение() Экспорт
	
	ПараметрыСоеденения = ИнтеграцияПовИсп.ПараметрыПодключения(); 
	ПараметрыАвторизации = ПараметрыАвотризации();
	СтруктураСоединения = СтруктураСоеденения();
	
	Попытка 
		HTTPСоединение = Новый  HTTPСоединение(ПараметрыСоеденения.АдресСервера, ПараметрыСоеденения.ПортСоединения,ПараметрыАвторизации.Пользоваталь,ПараметрыАвторизации.Пароль,,,?(ПараметрыСоеденения.ИспользуетсяЗащищенноеСоединение,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено),Неопределено));
		СтруктураСоединения.HTTPСоединение = HTTPСоединение;
		СтруктураСоединения.СоединениеУстановлено = Истина;
		СтруктураСоединения.СообщениеОбОшибке = "";
		СтруктураСоединения.ИмяСервиса = ПараметрыСоеденения.ИмяСервиса;
	Исключение
		СтруктураСоединения.СообщениеОбОшибке =  КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;
	
	
	Возврат СтруктураСоединения;
	
	
КонецФункции



Функция СоставныеСтрокиАдреса()
	
	Структура = Новый Структура();
	Структура.Вставить("АдресСервера", "");
	Структура.Вставить("ИмяКаталога", "");
	Структура.Вставить("ИмяСервиса", "");
	Структура.Вставить("ПортСоединения", 0);
	Структура.Вставить("ИспользуетсяЗащищенноеСоединение", Ложь);
	Структура.Вставить("ОшибкаСтроки", Ложь);
	
	Возврат Структура;
КонецФункции

Функция ПараметрыАвотризации()Экспорт
	
	СтруктураВозврата = 	Новый Структура("Пользоваталь,Пароль",ЗначениеНастроекВызовСервераПовтИсп.Логин(),ЗначениеНастроекВызовСервераПовтИсп.Пароль());
	Возврат  СтруктураВозврата;
КонецФункции

Функция ПараметрыПодключения() Экспорт
	
	
	
	Структура = СоставныеСтрокиАдреса();

	АдресWS = ЗначениеНастроекВызовСервераПовтИсп.АдресСервера();
	
	ЗащищенныйПротокол = Ложь;
	Если Лев(АдресWS, 5) = "https" Тогда
		ЗащищенныйПротокол = Истина;
	КонецЕсли;
	
	Если ЗащищенныйПротокол Тогда
		КоличествоСимволовПодHTTP = 9; // "https://"
	Иначе 
		КоличествоСимволовПодHTTP = 8; // "http://"
	КонецЕсли;
	
	СтрокаНаЗабор = Сред(АдресWS, КоличествоСимволовПодHTTP);
	ПозицияСлеша = Найти(СтрокаНаЗабор, "/");
	ИмяБД = Сред(СтрокаНаЗабор,ПозицияСлеша + 1);
	
	IP = Лев(СтрокаНаЗабор, ПозицияСлеша - 1);
	
	ПозицияДвоеточия = Найти(IP, ":");
	Если ПозицияДвоеточия = 0 Тогда
		Если ЗащищенныйПротокол Тогда
			Порт = 443;
		Иначе
			Порт = 80;
		КонецЕсли;
		IPБезПорта = IP;  
	Иначе
		Порт = Число(Сред(IP,ПозицияДвоеточия + 1));
		IPБезПорта = Лев(IP, ПозицияДвоеточия - 1);
	КонецЕсли;
	
	
	Структура.АдресСервера = IPБезПорта;
	Структура.ИмяКаталога  =	ИмяБД;
	Структура.ИмяСервиса   = ИмяБД+"/hs/TSD";
	Структура.ПортСоединения = Порт;
	Структура.ИспользуетсяЗащищенноеСоединение = ЗащищенныйПротокол;
	
	Возврат Структура;
	
	
КонецФункции

Функция СтруктураСоеденения() Экспорт
	СтруктураСоединения = Новый Структура;
	СтруктураСоединения.Вставить("HTTPСоединение");
	СтруктураСоединения.Вставить("ИмяСервиса","");
	СтруктураСоединения.Вставить("СоединениеУстановлено", Ложь);
	СтруктураСоединения.Вставить("СообщениеОбОшибке","");
	СтруктураСоединения.Вставить("Ответ",Неопределено);

	
	Возврат  СтруктураСоединения;
	
КонецФункции

Функция ПараметрыПодключенияФайлаКартинки(АдресWS)Экспорт
	Структура = СоставныеСтрокиАдреса();

	ЗащищенныйПротокол = Ложь;
	Если Лев(АдресWS, 5) = "https" Тогда
		ЗащищенныйПротокол = Истина;
	КонецЕсли;
	
	Если ЗащищенныйПротокол Тогда
		КоличествоСимволовПодHTTP = 9; // "https://"
	Иначе 
		КоличествоСимволовПодHTTP = 8; // "http://"
	КонецЕсли;
	
	СтрокаНаЗабор = Сред(АдресWS, КоличествоСимволовПодHTTP);
	ПозицияСлеша = Найти(СтрокаНаЗабор, "/");
	ИмяБД = Сред(СтрокаНаЗабор,ПозицияСлеша + 1);
	
	IP = Лев(СтрокаНаЗабор, ПозицияСлеша - 1);
	
	ПозицияДвоеточия = Найти(IP, ":");
	Если ПозицияДвоеточия = 0 Тогда
		Если ЗащищенныйПротокол Тогда
			Порт = 443;
		Иначе
			Порт = 80;
		КонецЕсли;
		IPБезПорта = IP;  
	Иначе
		Порт = Число(Сред(IP,ПозицияДвоеточия + 1));
		IPБезПорта = Лев(IP, ПозицияДвоеточия - 1);
	КонецЕсли;
	
	
	Структура.АдресСервера = IPБезПорта;
	Структура.ИмяКаталога  =	ИмяБД;
	//Структура.ИмяСервиса   = ИмяБД+"/hs/TSD";
	Структура.ПортСоединения = Порт;
	Структура.ИспользуетсяЗащищенноеСоединение = ЗащищенныйПротокол;
	
	Возврат Структура;
	

КонецФункции
