#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    КлючПараметра = "ЭлементыЗаполнения";
    Если Параметры.Свойство(КлючПараметра) Тогда
        СтруктураДокумента = Параметры[КлючПараметра];
        ЗаполнитьЗначенияСвойств(Этотобъект, СтруктураДокумента, "Дата, Номер");
        МассивТовары = СтруктураДокумента.МассивТовары;

        Для Каждого СтрокаТовары Из МассивТовары Цикл
            НоваяСтрока = ТаблицаДанных.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
        КонецЦикла;

    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    Возврат;
КонецПроцедуры

#КонецОбласти