
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	ЗначениеПолучено = Ложь;
	
	Если Параметры.Свойство("ШтрихкодЧека") Тогда
		
		ШтрихкодЧека = ПолученныйШтрихкод;
		
		Если ЗначениеНастроекВызовСервераПовтИсп.СканированиеВнешнимСканером() И ЗначениеЗаполнено(ШтрихкодЧека) Тогда
			ЗакрытьФорму();
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ШтрихкодНоменклатуры") Тогда
		
		ПродажиКлиент.ПолучитьНоменклатуруПоШтрихкоду(ПолученныйШтрихкод, Параметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученнуюПоШтрихкодуНоменклатуру(НоменклатураПоШтрихкоду, Параметры) Экспорт
	
	Номенклатура = НоменклатураПоШтрихкоду.Номенклатура;
	
	Если ЗначениеНастроекВызовСервераПовтИсп.СканированиеВнешнимСканером() И ЗначениеЗаполнено(Номенклатура) Тогда
		ЗакрытьФорму();
	КонецЕсли;

КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ШтрихкодЧека") И ЗначениеЗаполнено(ШтрихкодЧека) Тогда
		
		ЗакрытьФорму();
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ШтрихкодНоменклатуры") И ЗначениеЗаполнено(Номенклатура) Тогда
		
		ЗакрытьФорму();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.СтруктураПоиска) = Тип("Структура") Тогда
		
		СтруктураПоиска = Параметры.СтруктураПоиска;
		ЗаполнитьФормуПоПараметрамПоиска();
		
	КонецЕсли;
	
	Если Параметры.Свойство("Заголовок") Тогда
		
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ОчиститьПоиск", "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		
		Если Лев(Параметр, 2) = ПродажиКлиентСерверПовтИсп.ПрефиксШтрихкодаЧека() Тогда
			
			ДополнительныеПараметры.Вставить("ШтрихкодЧека");
		Иначе
			
			ДополнительныеПараметры.Вставить("ШтрихкодНоменклатуры");
		КонецЕсли;
		
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеНоменклатураВыбор", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", "Выбор");
	
	ОткрытьФорму("Обработка.ПодборТоваров.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ЗакрытьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	
	Закрыть("ОчиститьПоиск");
	
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШтрихкодЧека(Команда)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ШтрихкодЧека", Истина);
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура СканироватьШтрихкодНоменклатуры(Команда)
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ШтрихкодНоменклатуры", Истина);
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФормуПоПараметрамПоиска()
	
	СписокГрупп = "ГруппаНомерЧекаККМ, ГруппаШтрихкодЧека, ГруппаНоменклатура, ГруппаЗаказКлиента, ГруппаКонтрагент, ГруппаТелефон, ГруппаАдресЭлектроннойПочты";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		СписокГрупп,
		"Видимость",
		Ложь
	);
	
	Если СтруктураПоиска.Свойство("Номенклатура") Тогда
		
		Элементы.ГруппаНоменклатура.Видимость = Истина;
		Номенклатура = СтруктураПоиска.Номенклатура;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("НомерЧекаККМ") Тогда
		
		Элементы.ГруппаНомерЧекаККМ.Видимость = Истина;
		НомерЧекаККМ = СтруктураПоиска.НомерЧекаККМ;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("ШтрихкодЧека") Тогда
		
		Элементы.ГруппаШтрихкодЧека.Видимость = Истина;
		ШтрихкодЧека = СтруктураПоиска.ШтрихкодЧека;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("НомерЗаказаКлиента") Тогда
		
		Элементы.ГруппаЗаказКлиента.Видимость = Истина;
		НомерЗаказаКлиента = СтруктураПоиска.НомерЗаказаКлиента;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("Контрагент") Тогда
		
		Элементы.ГруппаКонтрагент.Видимость = Истина;
		Контрагент = СтруктураПоиска.Контрагент;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("Телефон") Тогда
		
		Элементы.ГруппаТелефон.Видимость = Истина;
		Телефон = СтруктураПоиска.Телефон;
	КонецЕсли;
	
	Если СтруктураПоиска.Свойство("АдресЭлектроннойПочты") Тогда
		
		Элементы.ГруппаАдресЭлектроннойПочты.Видимость = Истина;
		АдресЭлектроннойПочты = СтруктураПоиска.АдресЭлектроннойПочты;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеНоменклатураВыбор(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ОповещениеНоменклатураВыборНаСервере(Результат.АдресВоВременномХранилище);
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			ЗакрытьФорму();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОповещениеНоменклатураВыборНаСервере(АдресВоВременномХранилище)
	
	ТаблицаПодбор = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Для Каждого СтрокаПодбора Из ТаблицаПодбор Цикл
		Номенклатура = СтрокаПодбора.Номенклатура;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Для Каждого ПараметрПоиска Из СтруктураПоиска Цикл
		СтруктураПоиска[ПараметрПоиска.Ключ] = ЭтаФорма[ПараметрПоиска.Ключ];
	КонецЦикла;
	
	Закрыть(СтруктураПоиска);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СканироватьШтрихкодНоменклатуры", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров()
		И НЕ ИспользуетсяАсинхронныйСканер);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СканироватьШтрихкодЧека", "Видимость",
		ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования())
		И НЕ ИспользуетсяАсинхронныйСканер);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаШтрихкодЧека", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ПечататьШтрихкодНаЧеке());
		
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	//
КонецПроцедуры


#КонецОбласти
