


&НаКлиенте
Процедура Готово(Команда)
	Закрыть(Элементы.СписокПеремещений.ТекущиеДанные.ОснованиеUUID);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Стр Из Параметры.ТаблицаДокумтов Цикл 
		СтрПер = СписокПеремещений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрПер,Стр);		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеремещенийНомерДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	f=1;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеремещенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Закрыть(Элементы.СписокПеремещений.ТекущиеДанные.ОснованиеUUID);
	
КонецПроцедуры
