
&НаКлиенте
Перем ВыполняетсяЗакрытие;




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
		
	НастроитьФормуПоЗначениямНастроек();

	НастроитьФормуПоОриентацииЭкрана();
	
	


КонецПроцедуры



&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
			
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
	
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока( ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруМенеджерТЗКлиент(ПолученныйШтрихкод);
	ОбработатьПолученныеДанные(ДанныеПоТовару,Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеПоТовару, ДополнительныеПараметры) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПоказатели", "Видимость", ДанныеПоТовару.Результат);

	
	
	ЗаполнитьПараметрыНаСервере(ДанныеПоТовару);

	
Конецпроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере(ДанныеПоТовару)
	
	Если ДанныеПоТовару.Результат = ложь Тогда
		СтрокаНаименование = "";
		Сообщить(?(ЗначениеЗаполнено(ДанныеПоТовару.ОписаниеОшибки), ДанныеПоТовару.ОписаниеОшибки,"Данные по штрих коду не получены"));
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = ДанныеПоТовару.Ответ;
	
	
	ЦветАМ = ?(СтруктураОтвета.АМ = 0, WebЦвета.Красный, WebЦвета.Синий);
	Элементы.ДекорацияАМ.ЦветФона 		  = ЦветАМ;
	Артикул 			  = СтруктураОтвета.Артикул;
	СтрокаНаименование   = СтруктураОтвета.НаименованиеТовара;
	
	ЦенаТовараСтрока     = СтруктураОтвета.Цена;
	ОстатокСтрока        = СтруктураОтвета.Остаток;
	ПродажиСтрока        = СтруктураОтвета.Продажа7;
	ТоварВПути           = СтруктураОтвета.ТоварВПути;
	Поставщик            = СтруктураОтвета.Поставщик;
	Планограмма          = СтруктураОтвета.Планограмма;
	Оборачиваемость      = СтруктураОтвета.Оборач;
	Списание             = СтруктураОтвета.Списано;
	ДМП                  = СтруктураОтвета.ДМП;
	МПО                  = СтруктураОтвета.МО;

	Если СтруктураОтвета.Свойство("ДатаПоставки") Тогда
		Поставщик = Поставщик +" "+ Формат(Дата(СтруктураОтвета.ДатаПоставки), "ДФ=dd/MM/yy")+" п/п";
	КонецЕсли;
	
	
	Если СтруктураОтвета.Свойство("СрокВозврата") Тогда
		УсловиеВозврата = СтруктураОтвета.СрокВозврата;
		ДатаВозврата = ?(УсловиеВозврата = 0, "ДО ПРОСРОКА",Формат(ТекущаяДата() + (60*60*24* УсловиеВозврата),"ДФ=dd.MM.yy"));
	Иначе  
		ДатаВозврата = Неопределено;
		УсловиеВозврата = 0;
	КонецЕсли;


	
	
КонецПроцедуры






&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);

	
	
	ОбновитьПодразделение();
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	);

		//ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, ,"СтрокаНаименование");

	
//	
//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары", "Видимость",ПоказатьСписок);
//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканирование", "Видимость",НЕ ПоказатьСписок);

	
	НастроитьЭлементыАсинхронногоСканера();
	
	
КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры


&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;

	КонецЕсли;
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован
	);

	
КонецПроцедуры




&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры






&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры









&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ОбработатьПолученныйШтрихкод(СтрокаПоиска, ДополнительныеПараметры);
 	СтрокаПоиска = "";
    ЭтаФорма.ТекущийЭлемент = Элементы.СтрокаПоиска;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЦенаНажатие(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияРаспродажаНажатие(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
	
	ПараметрыФормы = Новый Структура("ТипДокумента",ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация"));
	
	ОткрытьФорму("Обработка.ПанельМеню.Форма.ФормаДокумента",ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
	
	
КонецПроцедуры
