#Область ОписаниеПеременных
&НаКлиенте
Перем ВыполняетсяЗакрытие;
#КонецОбласти
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если Параметры.Свойство("АвтоТест") Тогда
        Возврат;
    КонецЕсли;

    ИнициализироватьКонстантыФормы();
    ОбновитьПодразделение();
    ОбновитьСотрудника();
    НастроитьФормуПоЗначениямНастроек();

КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, НастройкиЗакрытия)

    Если ВыполняетсяЗакрытие Тогда
        ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
    Иначе
        ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросПослеЗакрытия", ЭтотОбъект), "Закрити документ?", РежимДиалогаВопрос.ДаНет,
            0, КодВозвратаДиалога.Да);

        Отказ = Истина; // Предотвращаем закрытие
    КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда

        ОбработатьПолученныйШтрихкод(Параметр, Новый Структура);

    ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда

        ОбновитьПодразделение();

    ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда

        ОбновитьСотрудника();

    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
    ДополнительныеПараметры = Новый Структура;
    ДопПарметрыФормы = Новый Структура;
    ОпЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника", ЭтотОбъект, ДополнительныеПараметры);
    ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник", ДопПарметрыФормы, ЭтотОбъект, , , , ОпЗакрытие,
        РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сканировать(Команда)
    ИдетПроцессСканирования = Истина;
    ОткрытьДиалогСканирования();
КонецПроцедуры
&НаКлиенте
Процедура АктивироватьСканер(Команда)
    ИнициализироватьАсинхронныйСканер();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОткрытьДиалогСканирования()

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
    ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
    ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
    ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");

    ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт

    Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
        Возврат;
    КонецЕсли;
    Если Не ПользовательИнициализирован Тогда

        Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

        Если Результат.Результат Тогда
            Оповестить("ИзмененСотрудник");
        Иначе
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необхідна авторизація користувача");
        КонецЕсли;

        Возврат;
    КонецЕсли;  
//	Если ТипАудита = 1 Тогда
//		Если СтрНачинаетсяС(ПолученныйШтрихкод,"TE;") Тогда 
//			ТЕИнфо = ПолучитьДанныеТЕ_НаСервере(ПолученныйШтрихкод);
//			Если ТЕИнфо.Результат Тогда
//			Иначе
//				Если НЕ ПустаяСтрока(ТЕИнфо.ОписаниеОшибки) Тогда
//					Сообщить(ТЕИнфо.ОписаниеОшибки);
//				КонецЕсли;
//			КонецЕсли;
//		Иначе 
//			Сообщить("Відскануйте ТО");
//			Возврат;
//		КонецЕсли;
//	
//		
//	ИначеЕсли ТипАудита = 2 Тогда
//		Если СтрЧислоВхождений(ПолученныйШтрихкод,";")=2 Тогда
//			Рез = ПолучитьДанныеPKG_НаСервере(ПолученныйШтрихкод)
//		Иначе   
//			 НайтиТоварPKG_НаКлиенте(ПолученныйШтрихкод);	
//			//Если НЕ Рез Тогда
//			//Сообщить("Відскануйте PKG"); 
//			//КонецЕсли;
//			//Возврат;
//		КонецЕсли;
//		
//	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()

    ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
    ОбщегоНазначения.УстановитьШрифт(ЭтотОбъект);

    ОпределитьДоступностьКнопкиСканирования();

    НастроитьЭлементыАсинхронногоСканера();
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "АктивироватьСканер", "Видимость",
        ИспользуетсяАсинхронныйСканер);

КонецПроцедуры

&НаКлиенте
Процедура ВопросПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = КодВозвратаДиалога.Да Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ИнициализироватьКонстантыФормы()

    ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
    Инициализирован = Не ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = Не ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()

    Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
        Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтотОбъект, "СообщениеИнициализации");
        Инициализирован = Ложь;

    Иначе

        Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтотОбъект, "СообщениеИнициализации");
        Инициализирован = Истина;

    КонецЕсли;

    ОпределитьДоступностьКнопкиСканирования();

КонецПроцедуры
&НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()

    ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "Сканировать", "Доступность",
        (ЕстьОборудованиеСканирования И Не ИспользуетсяАсинхронныйСканер) И Инициализирован
        И ПользовательИнициализирован);

КонецПроцедуры
&НаСервере
Процедура ОбновитьСотрудника()

    Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
        Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
        ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтотОбъект, "СообщениеИнициализацииПользователя");
        ПользовательИнициализирован = Ложь;
    Иначе
        Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
        ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтотОбъект, "СообщениеИнициализацииПользователя");
        ПользовательИнициализирован = Истина;
    КонецЕсли;

    УстановитьДоступностьПоНастройкам();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДопоплнительныеПараметры) Экспорт

    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ВыполняетсяЗакрытие = Истина;
        Закрыть();
    КонецЕсли;
КонецПроцедуры


//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

    ОпределитьДоступностьКнопкиСканирования();

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТовары", "Видимость",
        ПользовательИнициализирован);
	 
//	Если ТипАудита = 1 Тогда
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаТУ,ОчиститьТЕ", "Видимость", ПользовательИнициализирован);
//	ИначеЕсли ТипАудита = 2 Тогда 
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаPKG", "Видимость", ПользовательИнициализирован);
//	КонецЕсли;
//	Если ТипАудита = 1 И ПользовательИнициализирован Тогда
//		ПолучитьДанныеПоЗапросамОчистки();
//	КонецЕсли;

КонецПроцедуры

#КонецОбласти