
#Область ПрограммныйИнтерфейс

Функция ПередаваемыеДанныеНоменклатуры() Экспорт
	
	ДанныеНоменклатуры = Новый Структура;
	ДанныеНоменклатуры.Вставить("Номенклатура");
	ДанныеНоменклатуры.Вставить("Штрихкод");
	//ДанныеНоменклатуры.Вставить("НеобходимостьВводаАкцизнойМарки");
	//ДанныеНоменклатуры.Вставить("АкцизныеМарки");
	ДанныеНоменклатуры.Вставить("Цена");
	ДанныеНоменклатуры.Вставить("Количество");
	ДанныеНоменклатуры.Вставить("Сумма");
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции

// Заполняет ключи связи по таблице документа или обработки
Процедура ЗаполнитьКлючиСвязиТЧ(ТабличнаяЧасть, ИмяРеквизитаСвязи) Экспорт
	
	ВремКлючСвязи = 0;
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		ВремКлючСвязи = ЗаполнитьКлючСвязи(ТабличнаяЧасть, СтрокаТЧ, ИмяРеквизитаСвязи)
	КонецЦикла;
	
КонецПроцедуры

// Заполняет ключ связи таблиц документа или обработки
//
Функция ЗаполнитьКлючСвязи(ТабличнаяЧасть, СтрокаТабличнойЧасти, ИмяРеквизитаСвязи, ВремКлючСвязи = 0) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти[ИмяРеквизитаСвязи]) Тогда
		Если ВремКлючСвязи = 0 Тогда
			Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
				Если ВремКлючСвязи < СтрокаТЧ[ИмяРеквизитаСвязи] Тогда
					ВремКлючСвязи = СтрокаТЧ[ИмяРеквизитаСвязи];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		СтрокаТабличнойЧасти[ИмяРеквизитаСвязи] = ВремКлючСвязи + 1;
	КонецЕсли;
	
	Возврат СтрокаТабличнойЧасти[ИмяРеквизитаСвязи];
	
КонецФункции

#КонецОбласти
