  
  
  
  
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого МРЦ Из  Параметры.МасивМРЦ Цикл 
		НовоеМРЦ = ТаблицаХарактеристик.Добавить();
		НовоеМРЦ.Характеристика = МРЦ;
	КонецЦикла;
	
КонецПроцедуры
 
  
&НаКлиенте
Процедура ОК(Команда)
   	ЗакрытьВыборМРЦ();
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗакрытьВыборМРЦ();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаХарактеристикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗакрытьВыборМРЦ();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗакрытьВыборМРЦ();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВыборМРЦ()
	
	ТекДанные = Элементы.ТаблицаХарактеристик.ТекущиеДанные;

	Закрыть(Новый Структура("МРЦ",ТекДанные.Характеристика)); 

КонецПроцедуры

