
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;    
	
	НастроитьФормуПоЗначениямНастроек();
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант());
	НаборКонстант.Прочитать();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НаборКонстант, СписокКонстант());
	ИспользоватьЗаказыКлиентовФО        = ИспользоватьЗаказыКлиентов;
	ИспользоватьПриемТоваровФО          = ИспользоватьПриемТоваров;
	ИспользоватьПроверкуЦенФО           = ИспользоватьПроверкуЦен;
	ИспользоватьПеремещениеТоваровФО    = ИспользоватьСписаниеТоваров;
	ИспользоватьИнвентаризациюТоваровФО = ИспользоватьИнвентаризациюТоваров;
	ИспользоватьЖурналДокументовФО      = ИспользоватьЖурналДокументов;
	ИспользоватьВозвратТовараФО         = ИспользоватьВозвратТовара;
	ИспользоватьУценкуТовараФО          = ИспользоватьУценкуТовара;
	ИспользоватьКомплектациюТоваровФО   = ИспользоватьКомплектациюТоваров;
	ИспользоватьИнвентаризацияКоммисияФО= ИспользоватьИнвентаризацияКоммисия;
	
	ИспользоватьПереоценкиФО			= ИспользоватьПереоценки;
	ИспользоватьЗадачиФО				= ИспользоватьЗадачи;
	ИспользоватьМенеджерТЗФО			= ИспользоватьМенеджерТЗ;
	ИспользоватьПриходУходФО			= ИспользоватьПриходУход;
	ИспользоватьКонтролераФО			= ИспользоватьКонтролера;
    ИспользоватьЛогистикаФО			    = ИспользоватьЛогистика;

	
	ИспользоватьЖурналПриемПоЗаказуФО			= ИспользоватьЖурналПриемПоЗаказу;
	ИспользоватьЖурналПриемТоваровФО			= ИспользоватьЖурналПриемТоваров;
	ИспользоватьЖурналПеремещениеФО			    = ИспользоватьЖурналПеремещение;
	ИспользоватьЖурналПереоценкаФО			    = ИспользоватьЖурналПереоценка;
	ИспользоватьЖурналИнвентаризацияФО			= ИспользоватьЖурналИнвентаризация;
	ИспользоватьЖурналПечатьФО		        	= ИспользоватьЖурналПечать;
	ИспользоватьЖурналЗаказыПоставщикуФО		= ИспользоватьЖурналЗаказыПоставщику;
    ИспользоватьЖурналРекламацияФО		= ИспользоватьЖурналРекламация;

	ИспользоватьФотоФО		        	= ИспользоватьФото;
	ИспользоватьСканировкаТабакаФО		= ИспользоватьСканировкаТабака;
	ИспользоватьПечатьНаПринтерФО		= ИспользоватьПечатьНаПринтер;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОперацииЖурналаДокументов", "Видимость", ИспользоватьЖурналДокументов);
	
	// АдминистративныйРежим
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма);
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	ОбновитьПодразделение();

КонецПроцедуры

 &НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		// АдминистративныйРежим
		НастроитьФормуПоАдминистративномуРежиму();
		НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	ИначеЕсли ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		НастроитьФормуПоЗначениямНастроек();
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		ОбщегоНазначенияКлиент.УстановитьРасширенныйЗаголовокПриложения();
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ОбщегоНазначенияКлиент.ПередЗакрытиемФормыНастроек(ЭтаФорма, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов


 &НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ПодключитьОбработчикОжидания("НастроитьФормуПоАдминистративномуРежимуКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдминистративныйРежимНажатие(Элемент)
	// АдминистративныйРежим
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СохранитьНаКлиенте();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьНаКлиенте() Экспорт
	
	ОчиститьСообщения();
	Отказ = Ложь;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		Если ИзмененаФО Тогда
			ОбновитьИнтерфейс();
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ)
	
	
	
	Если НЕ ИспользоватьЗаказыКлиентов = ИспользоватьЗаказыКлиентовФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьПриемТоваров = ИспользоватьПриемТоваровФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьПроверкуЦен = ИспользоватьПроверкуЦенФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьСписаниеТоваров = ИспользоватьСписаниеТоваровФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьПеремещениеТоваров = ИспользоватьПеремещениеТоваровФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналДокументов = ИспользоватьЖурналДокументовФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьИнвентаризацияКоммисия = ИспользоватьИнвентаризацияКоммисияФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьПереоценки = ИспользоватьПереоценкиФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЗадачи = ИспользоватьЗадачиФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьМенеджерТЗ = ИспользоватьМенеджерТЗФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьПриходУход = ИспользоватьПриходУходФО Тогда
		ИзмененаФО = Истина;
		
	ИначеЕсли НЕ ИспользоватьЖурналПриемПоЗаказу = ИспользоватьЖурналПриемПоЗаказуФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналПриемТоваров = ИспользоватьЖурналПриемТоваровФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналПеремещение = ИспользоватьЖурналПеремещениеФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналПереоценка = ИспользоватьЖурналПереоценкаФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналИнвентаризация = ИспользоватьЖурналИнвентаризацияФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналПечать = ИспользоватьЖурналПечатьФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьФото = ИспользоватьФотоФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьЖурналЗаказыПоставщику = ИспользоватьЖурналЗаказыПоставщикуФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьКонтролера = ИспользоватьКонтролераФО Тогда
		ИзмененаФО = Истина;
	ИначеЕсли НЕ ИспользоватьПечатьНаПринтер = ИспользоватьПечатьНаПринтерФО Тогда
		ИзмененаФО = Истина;
  	ИначеЕсли НЕ ИспользоватьЛогистика = ИспользоватьЛогистикаФО Тогда
		ИзмененаФО = Истина;
  	ИначеЕсли НЕ ИспользоватьЖурналРекламация = ИспользоватьЖурналРекламацияФО Тогда
		ИзмененаФО = Истина;

	КонецЕсли;
	
	
	
	ОбщегоНазначения.СохранитьКонстантыФормы(ЭтаФорма, СписокКонстант(), Отказ);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() ИЛИ НЕ ЗначениеНастроекВызовСервераПовтИсп.УстановленРежимСинхронизации() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКонстант(), "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ИспользоватьЗаказыКлиентов", "Видимость", Истина);
		
	Иначе
		Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,  СписокКонстант(), "Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,  "ИспользоватьКомплектациюТоваров", "Видимость", Ложь);

		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,  СписокКонстант(), "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,  "ИспользоватьКомплектациюТоваров", "Видимость", Истина);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ИспользоватьЗаказыКлиентов", "Видимость", Ложь);
	КонецЕсли;

	
КонецПроцедуры


&НаСервере
Функция СписокКонстант()
	
	Возврат
	"ИспользоватьСписаниеТоваров,
	|ИспользоватьЗаказыКлиентов,
	|ИспользоватьКомплектациюТоваров,
	|ИспользоватьУценкуТовара,
	|ИспользоватьПроверкуЦен,
	|ИспользоватьПеремещениеТоваров,
	|ИспользоватьИнвентаризациюТоваров,
	|ИспользоватьИнвентаризацияКоммисия,
	|ИспользоватьЖурналДокументов,
	|ИспользоватьВозвратТовара,
	|ИспользоватьПереоценки,
	|ИспользоватьЗадачи,
	|ИспользоватьМенеджерТЗ,
	|ИспользоватьПриходУход,
	|ИспользоватьЖурналПриемПоЗаказу,
	|ИспользоватьЖурналПриемТоваров,
	|ИспользоватьЖурналПеремещение,
	|ИспользоватьЖурналПереоценка,
	|ИспользоватьЖурналИнвентаризация,
	|ИспользоватьЖурналПечать, 
	|ИспользоватьЖурналРекламация,
	|ИспользоватьФото,
	|ИспользоватьПечатьНаПринтер,
	|ИспользоватьЖурналЗаказыПоставщику,
	|ИспользоватьСканировкаТабака,
	|ИспользоватьПриемТоваров,
	|ИспользоватьЛогистика,
	|ИспользоватьКонтролера";
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыАдминистративныйРежим

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПоАдминистративномуРежиму()
	
	//СписокТолькоПросмотр = "ИспользоватьСписаниеТоваров,
	//|ИспользоватьЗаказыКлиентов,
	//|ИспользоватьПроверкуЦен,
	//|ИспользоватьПеремещениеТоваров,
	//|ИспользоватьИнвентаризациюТоваров,
	//|ИспользоватьЖурналДокументов,
	//|ИспользоватьВозвратТовара,
	//|ИспользоватьПриемТоваров";
	//
	СписокДоступность = "Готово";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,  СписокКонстант(), "ТолькоПросмотр", НЕ АдминистративныйРежим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокДоступность, "Доступность", АдминистративныйРежим);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПоАдминистративномуРежимуКлиент()
	
	НастроитьФормуПоАдминистративномуРежиму(Истина);
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму(УстановитьРежим = Ложь)
	
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма, УстановитьРежим);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
		
		//Элементы.ГруппаБезналичнаяОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//Элементы.ГруппаКассиры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//
		//Элементы.ОтступБезналичнаяОплата.РастягиватьПоГоризонтали = Истина;
		//Элементы.ОтступКассиры.РастягиватьПоГоризонтали = Истина;
		
	Иначе
		//Элементы.ГруппаБезналичнаяОплата.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		//Элементы.ГруппаКассиры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		//
		//Элементы.ОтступБезналичнаяОплата.РастягиватьПоГоризонтали = Ложь;
		//Элементы.ОтступКассиры.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЖурналДокументовПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОперацииЖурналаДокументов", "Видимость", ИспользоватьЖурналДокументов);

КонецПроцедуры

#КонецОбласти
