 &НаКлиенте
Перем ВыполняетсяЗакрытие;
	
	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("НомерКороба",НомерКороба);	
	Параметры.Свойство("uuiddoc",ДокUUID);	
	НастроитьФормуПоЗначениямНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОпределитьДоступностьКнопкиСканирования();
	НастроитьЭлементыАсинхронногоСканера();
 	
КонецПроцедуры  


 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	ВидимостьКнопкиСканирования = Истина;	
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		ВидимостьКнопкиСканирования = Ложь;
	#КонецЕсли    
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер	);
	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость", ВидимостьКнопкиСканирования);

КонецПроцедуры   









&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);   
		
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНачинаетсяС(ПолученныйШтрихкод,"TE;") Тогда 
		Элементы.ДекорацияСообщение.Заголовок = "";
		ТЕИнфо = ПолучитьДанныеТЕ_НаСервере(ПолученныйШтрихкод);
		Если ТЕИнфо.Результат Тогда
			ТЕНаименование = ТЕИнфо.Ответ.teneme;
			ТЕМаршрут = ТЕИнфо.Ответ.nom; 
			МаршрутТОТЕ =   ?(ТЕИнфо.Ответ.nomto=0,Истина,ТЕИнфо.Ответ.nomto = ТЕИнфо.Ответ.nom);
			Элементы.ДекорацияСообщение.Заголовок = ТЕИнфо.ОписаниеОшибки;
			
		Иначе
			Если НЕ ПустаяСтрока(ТЕИнфо.ОписаниеОшибки) Тогда
				Элементы.ДекорацияСообщение.Заголовок = ТЕИнфо.ОписаниеОшибки;
			КонецЕсли;
			ТЕUUID = ""; 
			ТЕМаршрут = 0;
			ТЕНаименование = "";
		КонецЕсли;
	Иначе 
		Сообщить("Відскануйте ТО");
		Возврат;
	КонецЕсли;
	
			
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеТЕ_НаСервере(ШК_ТЕ)
	
	МассивТЕ = СтрРазделить(ШК_ТЕ,";",);	 
	ТЕUUID = МассивТЕ[1]; 
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TEinf?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+ТЕUUID+"&uuidre="+ДокUUID+"&nomPKG="+НомерКороба;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	
	Возврат РезОтвет;
	
	
КонецФункции

&НаСервере
Функция РезместитьТЕ_НаСервере()
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TE?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+ТЕUUID+"&uuidre="+ДокUUID+"&nomPKG="+НомерКороба;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	
	Возврат РезОтвет;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	СтандартнаяОбработка = ЛожЬ;
	Отказ = НЕ ВыполняетсяЗакрытие;
	//Закрыть(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Разместить(Команда)
	
	Если ПустаяСтрока(ТЕUUID) Тогда  
		Сообщить("Відскануйте ТО");
		Возврат;
	КонецЕсли;        
	
	Если МаршрутТОТЕ Тогда
		РезместитьТЕ_НаКлиенте();	
	Иначе
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Номер маршруту не співпадає, продовжити?", Режим, 0);   
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура РезместитьТЕ_НаКлиенте()
	РезОтвет = РезместитьТЕ_НаСервере();  
	Если РезОтвет.Результат Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть(Истина);
	Иначе 
		Элементы.ДекорацияСообщение.Заголовок = "Помилка розміщення";
		Если НЕ ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Элементы.ДекорацияСообщение.Заголовок = РезОтвет.ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезместитьТЕ_НаКлиенте();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗапроситьОчистку(Команда)
	Если ПустаяСтрока(ТЕUUID) Тогда  
		Сообщить("Відскануйте ТО");
		Возврат;
	КонецЕсли;  
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОчистки", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Запросити очищення ТО?", Режим, 0);   
	

КонецПроцедуры


 &НаКлиенте
Процедура ПослеЗакрытияВопросаОчистки(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ЗапроситьОчисткуНаСервере();  
	Если РезультатЗапроса.Результат Тогда
		Элементы.ДекорацияСообщение.Заголовок = "Запит на очищення ТО надіслано";  
	Иначе 
		Элементы.ДекорацияСообщение.Заголовок = "Помилка запиту";
		Если НЕ ПустаяСтрока(РезультатЗапроса.ОписаниеОшибки) Тогда
			Элементы.ДекорацияСообщение.Заголовок = РезультатЗапроса.ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;

	
	
КонецПроцедуры 

&НаСервере
Функция ЗапроситьОчисткуНаСервере()
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/TEOCH?uuidcom="+ПараметрыСеанса.Сотрудник_ID
	+"&chk="+ТЕUUID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	
	Возврат РезОтвет;
	
КонецФункции

