

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	//УстановитьЗаголовокПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодразделение(Результат)
	Если НЕ ПустаяСтрока(Результат.Ответ) Тогда
		Элементы.ТекущееПодразделение.Заголовок = Результат.Ответ;
		Элементы.Страницы.ТекущаяСтраница  = Элементы.СтраницаПодр;
		
	Иначе
		Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
	КонецЕсли;

		
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		//Сообщить("Сканирование шк" + Параметр);
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	Подразделение = ПараметрыСеанса.Подразделение;
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	Если НЕ ПустаяСтрока(Подразделение) Тогда
		Элементы.ТекущееПодразделение.Заголовок = Подразделение;
		Элементы.Страницы.ТекущаяСтраница  = Элементы.СтраницаПодр;
	Иначе
		Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
		
	КонецЕсли;
	
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	ОбщегоНазначения.УстановитьЖирныйШрифтПолей(ЭтаФорма, "ТекущееПодразделение,ТекущееПодразделениеПусто");
	ОбщегоНазначения.УстановитьЦветПредупреждающихПолей(ЭтаФорма,"ТекущееПодразделениеПусто");
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма,"ТекущееПодразделение");

	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканированиеНевозможно", "Видимость",
	НЕ ЕстьОборудованиеСканирования);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер
	);
	

	
	НастроитьЭлементыАсинхронногоСканера();

	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры



#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры


&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры


#КонецОбласти



#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Результат	= ИнтеграцияТК_Клиент.ПолучитьUUIDПодразделения(ПолученныйШтрихкод);
	 //Сообщить("Результат сканирования" + Результат.Результат);
	Если Результат.Результат Тогда
		
		Элементы.ТекущееПодразделение.Заголовок = Результат.Ответ;
		Элементы.Страницы.ТекущаяСтраница  = Элементы.СтраницаПодр;
		Оповестить("ИзмененоПодразделение");
		
	Иначе
		Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сканер(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры




&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеУстановленСканерНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеСканерШтрихкодов",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВводСтроки(Команда)
	
	ЗаголовокСканирования = "Введите код объекта";
	ДополнительныеПараметры = Новый Структура;
	Штрихкод = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоКоду", ЭтотОбъект,ДополнительныеПараметры);
	ПоказатьВводСтроки(ОписаниеОповещения, Штрихкод, ЗаголовокСканирования);

	
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ОповещениеПоискаПоКоду(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ОбработатьПолученныйШтрихкод(Результат, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

