&НаКлиенте
Перем ВыполняетсяЗакрытие;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Параметры.Свойство("ТипДокумента",ТипДокумента);	
	
	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	
	
	НастроитьФормуПоЗначениямНастроек();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
	КонецЕсли;
КонецПроцедуры
   
&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	ПолученныйШтрихкод = ОбщегоНазначенияКлиент.ПолучитьШтрихкодИзСтроки(ПолученныйШтрихкод);
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;  
	КонецЕсли;
	
	Если СтрНачинаетсяС(ПолученныйШтрихкод,"MH;") Тогда  
			
		ПолучитьМестоХранение(ПолученныйШтрихкод); 
			
		Возврат;
	КонецЕсли;
	

	Если ЗначениеЗаполнено(МестоХраненияUUID) Тогда
		Попытка 
			ПривязатьНоменклатуруКМестоХранения(ПолученныйШтрихкод);   
		Исключение
			ЗвукОшибки();
		КонецПопытки;
		
		
	КонецЕсли;
	
	
		 
		
КонецПроцедуры 

&НаСервере
Процедура ПолучитьМестоХранение(ПолученныйШтрихкод)
	
	
	мХранение = СтрРазделить(ПолученныйШтрихкод,";",); 
	ШК = мХранение[1];
	
	Если ТипДокумента = "ПриоритетМестХранения" Тогда 
		нстрМХ = ТаблицаМестаХранения.НайтиСтроки(Новый Структура("МестоХраненияUUID",ШК));
		Если нстрМХ.Количество()>0 Тогда
			Сообщить("Місце зберігання вже є у списку");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/kladovmh?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&uuidmh="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		Если ТипДокумента = "ПриоритетМестХранения" Тогда 
			
			
			НовыйПорядок = ТаблицаМестаХранения.Количество()+1;
			стрМестоХранения = ТаблицаМестаХранения.Добавить();	
			стрМестоХранения.МестоХраненияUUID = ШК; 
			стрМестоХранения.МестоХраненияНаименование = РезОтвет.Ответ.Наименование;
			стрМестоХранения.Порядок = РезОтвет.Ответ.Порядок; 
			стрМестоХранения.НовыйПорядок = НовыйПорядок;
			//ТаблицаМестаХранения.Сортировать("Порядок");
		ИначеЕсли ТипДокумента = "НоменклатураВМестоХранение" Тогда
			ТаблицаТовары.Очистить();
			МестоХраненияUUID = ШК;
			Элементы.ДекорацияСканироватьЯчейку.Заголовок =	РезОтвет.Ответ.Наименование;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканироватьТовары", "Видимость", Истина);
		КонецЕсли;
	Иначе
		МестоХраненияUUID ="";
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка скасування місця зберігання!");	  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПривязатьНоменклатуруКМестоХранения(ШК)
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/kladovnom?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&uuidmh="+МестоХраненияUUID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		нСтрокаТовары = ТаблицаТовары.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрокаТовары,РезОтвет.Ответ);
	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка додавання товару!");	  
		КонецЕсли; 
		ВызватьИсключение "Помилка додавання товару!";	
	КонецЕсли;
	
КонецПроцедуры

 &НаКлиенте
Процедура ЗвукОшибки()
	
 	#Если МобильноеПриложениеКлиент Тогда
		
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение("ringtonpp",Истина);
		
	#КонецЕсли

	
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	//Если ПользовательИнициализирован И Инициализирован Тогда
	//	ОбновитьКоличестворезервовНаСервере(КоличествоРезервов);
	//КонецЕсли;
	
КонецПроцедуры











&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

    
&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
		
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиСканирования();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
	Если ТипДокумента = "НоменклатураВМестоХранение" Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканироватьЯчейку", "Видимость", Инициализирован И ПользовательИнициализирован);
	ИначеЕсли ТипДокумента = "ПриоритетМестХранения" Тогда
       	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаМестаХранения", "Видимость", Инициализирован И ПользовательИнициализирован);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован
	);
	
КонецПроцедуры   

 &НаКлиенте
Процедура ТаблицаТоварыНаименованиеТовараПриИзменении(Элемент)
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоварыНаименованиеТовараНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	Возврат;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоварыАртикулПриИзменении(Элемент)
	Возврат;
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоварыАртикулНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура СканироватьНовоеМестоХранение(Команда)
	
	МестоХраненияUUID ="";	
	ТаблицаТовары.Очистить();
	Элементы.ДекорацияСканироватьЯчейку.Заголовок = "Відскануйте комірку";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканироватьТовары", "Видимость", Ложь);	

КонецПроцедуры

&НаСервере
Процедура СохранитьПорядокМестХраненияНаСервере()
	Если ТаблицаМестаХранения.Количество() = 0 Тогда
		Сообщить("Нет мест хранения для сохранения");
		Возврат;
	КонецЕсли;
	
	МассивМестХранения = Новый Массив;
	
	Для Каждого СтрМесто Из ТаблицаМестаХранения Цикл 
		
		МассивМестХранения.Добавить(Новый Структура("UUID,Порядок",СтрМесто.МестоХраненияUUID,СтрМесто.НовыйПорядок));	
		
	КонецЦикла;
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/MHsort";
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(МассивМестХранения,текстЗапроса);
	Если РезОтвет.Результат Тогда 
		ТаблицаМестаХранения.Очистить(); 	
	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка вивантаження документа!");	  
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПорядокМестХранения(Команда)
	СохранитьПорядокМестХраненияНаСервере();
КонецПроцедуры



