&НаКлиенте
Перем ВыполняетсяЗакрытие;


	
	
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	
	
	НастроитьФормуПоЗначениямНастроек();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь; 
//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Записать", "Видимость",Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();      
		ПолучитьДанныеПоЗипПакетам();
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТТ", "Видимость",ПользовательИнициализирован);
		
	КонецЕсли;

КонецПроцедуры




////
&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован
	);
	
КонецПроцедуры   

 &НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
		
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиСканирования();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
	
КонецПроцедуры

 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры




&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 


&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры


   &НаКлиенте
Процедура СообщениеВведитеНомерТТНажатие(Элемент)
	
	ДопПараметры = Новый Структура;
	
	ЗаголовокСканирования = "Торговий майданчик";
	вЧисло = 0;//"";
	ОписаниеОповещения = Новый ОписаниеОповещения("опВводНомерТочки", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЧисла(ОписаниеОповещения, вЧисло, ЗаголовокСканирования);
КонецПроцедуры


 &НаКлиенте
 Процедура опВводНомерТочки(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Попытка 
			Рез = Число(Результат);
		Исключение
			Сообщить("Номер точки некоректний! "+ Строка(Результат));
		КонецПопытки;
		
		
		ДанныеТочкиПолучены = ПолучитьТочкуПоНомеру(Рез);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗипПакет", "Видимость",ДанныеТочкиПолучены);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТочкуПоНомеру(НомерТочки)
	
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/TTID?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&ID="+Формат(НомерТочки,"ЧЦ=5; ЧН=0; ЧГ=");
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	ДанныеТочкиПолучены = Ложь;
	Если РезОтвет.Результат Тогда
		ДанныеТочкиПолучены = Истина;   
		ТочкаЗипID = РезОтвет.Ответ.UUID;
		Элементы.ДекорацияТекТочка.Заголовок = РезОтвет.Ответ.mame;
	Иначе
		Если ЗначениеЗаполнено(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
		КонецЕсли;
	КонецЕсли;	
	Возврат ДанныеТочкиПолучены;	
КонецФункции 

&НаСервере
Функция ПолучитьТочкуСканирование(ПолученныйШтрихкод);
	РезОтвет	= ИнтеграцияТК_ВызовСервера.ПолучитьПодразделение(ПолученныйШтрихкод);
	ДанныеТочкиПолучены = Ложь;
	Если РезОтвет.Результат Тогда
		ДанныеТочкиПолучены = Истина;   
		ТочкаЗипID = ПараметрыСеанса.UUID;
		Элементы.ДекорацияТекТочка.Заголовок = ПараметрыСеанса.Подразделение;   
	Иначе
		Если ЗначениеЗаполнено(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
		КонецЕсли;
	КонецЕсли;	
	Возврат ДанныеТочкиПолучены;	
	
КонецФункции
	

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);
		
		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	ДанныеТочкиПолучены = ПолучитьТочкуСканирование(ПолученныйШтрихкод);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗипПакет", "Видимость",ДанныеТочкиПолучены);

КонецПроцедуры


&НаКлиенте
Процедура ЗабратьЗипПакет(Команда)
	
	ЗабратьЗипПакетАсинх();
	
КонецПроцедуры



&НаКлиенте
Асинх Процедура ЗабратьЗипПакетАсинх()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Забрати пакет?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	
	РезультатВыгрузки = ЗагрузитьДанныеЗабораПакета();
	Если НЕ РезультатВыгрузки.Результат Тогда  
		Если НЕ ПустаяСтрока(РезультатВыгрузки.ОписаниеОшибки) Тогда
			Сообщить(РезультатВыгрузки.ОписаниеОшибки); 
		КонецЕсли;
		
		Возврат;
	КонецЕсли; 
	
	ВыполняетсяЗакрытие = Истина;
	Закрыть();
	
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеЗабораПакета()
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("IDTT",ТочкаЗипID);
	СтруктураДокумента.Вставить("UUID_Сотрудник",ПараметрыСеанса.Сотрудник_ID);
	
	парамЗапрос ="ZIPloading";
	ТекстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/"+парамЗапрос;
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента,ТекстЗапроса);
	
	Возврат РезОтвет  
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеПоЗипПакетам()
	
	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/zip?uuidcom="+ПараметрыСеанса.Сотрудник_ID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда 
		ЗабраноПакетов = РезОтвет.Ответ.zabzip;
	Иначе
		Если ЗначениеЗаполнено(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
		КонецЕсли;
	КонецЕсли;	

	
КонецПроцедуры
