
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИД_Документ = Параметры.ИД_Документ;

	МДокумент = Параметры.Документы.НайтиСтроки(Новый Структура("ИД_Документ",ИД_Документ)); 
	НомерДокумент = МДокумент[0].Номер; 
	ДатаДокумента = МДокумент[0].Дата;

	МКороба = Параметры.Короба.НайтиСтроки(Новый Структура("ИД_Документ",ИД_Документ));
	счПринято =0;
	Для Каждого СтКороб Из МКороба Цикл 
		НоваяСтрокаТзКороба =  тзКороба.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТзКороба,СтКороб);
		НоваяСтрокаТзКороба.ЗаписьПоСтроке = "PKG - "+НоваяСтрокаТзКороба.НомерУпаковки + " "+НоваяСтрокаТзКороба.СкладСборки;
		счПринято = счПринято + СтКороб.Принят;
	КонецЦикла;
	Элементы.ДекорацияПринятоКоробов.Заголовок = "Прийнято "+ Формат(счПринято,"ЧЦ=4; ЧН=0; ЧГ=");
   
КонецПроцедуры

&НаКлиенте
Процедура тзКоробаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура тзКоробаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура тзКоробаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура тзКоробаЗаписьПоСтрокеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
