


Функция ДокументЗаписываетДанныеВРегистр(ТипДокумента) 

	Если  ТипДокумента = Справочники.ТипыДокументов.ПриемПоПриходу 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПеремещениеТоваров
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда   
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьЗапись(ТекСтрока)Экспорт
	
	Если  ДокументЗаписываетДанныеВРегистр(ТекСтрока.ТипДокумента) Тогда
		
		Набор = РегистрыСведений.ВремяРаботыСДокументом.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ТекСтрока.ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТекСтрока.ТипДокумента);
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,ТекСтрока);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьДанныеВРаботе(ДокументUUID,ТипДокумента)Экспорт
	
	Если ДокументЗаписываетДанныеВРегистр(ТипДокумента) Тогда
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТипДокумента);
		
		Набор.Записать();
		
	КонецЕсли;

КонецПроцедуры


Функция ПолучитьСтруктуруВремяРаботыСдокументом(ДокументUUID,ТипДокумента)Экспорт 
	тСтруктура = Новый Структура;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВремяРаботыСДокументом.НачалоРаботыСдокументом КАК НачалоРаботыСдокументом,
	|	ВремяРаботыСДокументом.ДокументОткрытСекунд КАК ДокументОткрытСекунд,
	|	ВремяРаботыСДокументом.ОтсканированоТовар КАК ОтсканированоТовар,
	|	ВремяРаботыСДокументом.ВводВручнуюТовар КАК ВводВручнуюТовар
	|ИЗ
	|	РегистрСведений.ВремяРаботыСДокументом КАК ВремяРаботыСДокументом
	|ГДЕ
	|	ВремяРаботыСДокументом.ДокументUUID = &ДокументUUID
	|	И ВремяРаботыСДокументом.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ДокументUUID", ДокументUUID);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		тСтруктура.Вставить("НачалоРаботыСдокументом",Формат(ВыборкаДетальныеЗаписи.НачалоРаботыСдокументом,"ДФ=yyyyMMddЧЧммсс"));
		тСтруктура.Вставить("ДокументОткрытСекунд",ВыборкаДетальныеЗаписи.ДокументОткрытСекунд);
		тСтруктура.Вставить("ОтсканированоТовар",ВыборкаДетальныеЗаписи.ОтсканированоТовар);
		тСтруктура.Вставить("ВводВручнуюТовар",ВыборкаДетальныеЗаписи.ВводВручнуюТовар);
		тСтруктура.Вставить("КонецРаботыСДокументом",Формат(ТекущаяДата(),"ДФ=yyyyMMddЧЧммсс"));

	КонецЕсли;
	
	Возврат тСтруктура;
	
КонецФункции
