 
 
 Процедура ПриСозданииНаСервере(ЭтотОъект,Отказ, СтандартнаяОбработка)Экспорт
	 
	 ИнициализироватьКонстантыФормы(ЭтотОъект);
	 ОбновитьПодразделение(ЭтотОъект);
	 ОбновитьСотрудника(ЭтотОъект); 
	 НастроитьФормуПоЗначениямНастроек(ЭтотОъект);

 КонецПроцедуры
 
 
 
 
 
 
 
Процедура ИнициализироватьКонстантыФормы(Форма)
	
	Форма.ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Форма.Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    Форма.ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
	
КонецПроцедуры

Процедура ОбновитьПодразделение(Форма)Экспорт
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Форма.Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(Форма, "СообщениеИнициализации");
		Форма.Инициализирован = Ложь;
		
	Иначе

		Форма.Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(Форма, "СообщениеИнициализации");
		Форма.Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования(Форма);
	
КонецПроцедуры   

Процедура ОбновитьСотрудника(Форма)Экспорт
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Форма.Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(Форма, "СообщениеИнициализацииПользователя");
		Форма.ПользовательИнициализирован = Ложь;
	Иначе
		Форма.Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(Форма, "СообщениеИнициализацииПользователя");
		Форма.ПользовательИнициализирован = Истина;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам(Форма);
	
КонецПроцедуры

Процедура НастроитьФормуПоЗначениямНастроек(Форма)
	
		
	ОбщегоНазначения.УстановитьШрифт(Форма);
	
	ОпределитьДоступностьКнопкиСканирования(Форма);
	
	НастроитьЭлементыАсинхронногоСканера(Форма);
	
КонецПроцедуры




Процедура ОпределитьДоступностьКнопкиСканирования(Форма)
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма, "Сканировать", "Доступность",
	(ЕстьОборудованиеСканирования И НЕ Форма.ИспользуетсяАсинхронныйСканер) И Форма.Инициализирован И Форма.ПользовательИнициализирован
	);
	
КонецПроцедуры   

Процедура УстановитьДоступностьПоНастройкам(Форма)

	ОпределитьДоступностьКнопкиСканирования(Форма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма, "Сканировать", "Доступность", Форма.Инициализирован И Форма.ПользовательИнициализирован);
	
КонецПроцедуры

Процедура НастроитьЭлементыАсинхронногоСканера(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма, "АктивироватьСканер", "Видимость", 
		Форма.ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры
