
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПолучитьПредставлениеЧека(Данные.Ссылка);
	
КонецПроцедуры

Функция ПолучитьПредставлениеЧека(СсылкаНаЧек) Экспорт
	
	ТекстЗаголовка = НСтр("ru = '%ПредставлениеНомера% от %ПредставлениеДата% (%СтатусЧека%)'");
	
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеНомера%", 
		ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(СсылкаНаЧек.Номер));
		
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеДата%",
		Формат(СсылкаНаЧек.Дата,"ДФ=dd.MM; ДЛФ=D"));
	
	Если СсылкаНаЧек.СтатусЧека = Перечисления.СтатусыЧеков.Отложен 
		И ЗначениеЗаполнено(СсылкаНаЧек.СтатусОплаты) Тогда
		
		СтатусЧека = СсылкаНаЧек.СтатусОплаты;
	Иначе
		СтатусЧека = СсылкаНаЧек.СтатусЧека;
	КонецЕсли;
	
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%СтатусЧека%", СтатусЧека);
	
	Возврат ТекстЗаголовка;
	
КонецФункции

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЧекОплаты.Ссылка.Дата КАК Период,
	|	ЧекОплаты.Ссылка.КассоваяСмена КАК КассоваяСмена,
	|	ВЫБОР
	|		КОГДА ЧекОплаты.Ссылка.ВидОперации = 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ЧекОплаты.ТипОплаты КАК ТипОплаты,
	|	ВЫБОР
	|		КОГДА ЧекОплаты.Ссылка.ВидОперации = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Продажа)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияДС.Возврат)
	|	КОНЕЦ КАК ВидДвиженияДС,
	|	ЧекОплаты.Сумма КАК Сумма
	|ИЗ
	|	Документ.Чек.Оплаты КАК ЧекОплаты
	|ГДЕ
	|	ЧекОплаты.Ссылка = &Ссылка
	|	И ЧекОплаты.Ссылка.СтатусЧека В (ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Пробит), ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Архивный))";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредства", Результат[0].Выгрузить());
	
КонецПроцедуры

// Возвращает список чеков, которые содержат переданную номенклатуру
// 
// Возвращаемое значение:
//   Массив   - пустой массив, если чеков с номенклатурой нет.
//
Функция СписокЧековСодержащихНоменклатуру(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЧекТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Чек.Товары КАК ЧекТовары
		|ГДЕ
		|	ЧекТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЧеков = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивЧеков;
	
КонецФункции

Функция ДанныеОплатыПоПлатежнойКарте(ДокументСсылка) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипОплаты", Перечисления.ТипыОплаты.ПлатежнаяКарта);
	
	НайденнаяОплата = ДокументСсылка.Оплаты.НайтиСтроки(ПараметрыОтбора);
	
	Если НЕ НайденнаяОплата.Количество() = 0 Тогда
		
		Оплата = НайденнаяОплата[0];
		КлючСвязи = Оплата.КлючСвязи;
		
		Операция = ДокументСсылка.ОперацииПлатежнойСистемы.Найти(КлючСвязи, "КлючСвязи");
		
		ДанныеОплаты = Новый Структура;
		ДанныеОплаты.Вставить("ВидОплаты",           Оплата.ВидОплаты);
		ДанныеОплаты.Вставить("Сумма",               Оплата.Сумма);
		ДанныеОплаты.Вставить("ТипОплаты",           Оплата.ТипОплаты);
		ДанныеОплаты.Вставить("КодАвторизации",      Неопределено);
		ДанныеОплаты.Вставить("НомерКарты",          Неопределено);
		ДанныеОплаты.Вставить("НомерСсылкиОперации", Неопределено);
		ДанныеОплаты.Вставить("ДатаОперации",        Неопределено);
		ДанныеОплаты.Вставить("СлипЧек",             Неопределено);
		
		Если НЕ Операция = Неопределено Тогда
			ДанныеОплаты.КодАвторизации      = Операция.КодАвторизации;
			ДанныеОплаты.НомерКарты          = Операция.НомерКарты;
			ДанныеОплаты.НомерСсылкиОперации = Операция.НомерСсылкиОперации;
			ДанныеОплаты.ДатаОперации        = Операция.ДатаОперации;
			ДанныеОплаты.СлипЧек             = Операция.СлипЧек.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеОплаты;
	
КонецФункции

Функция ПолучитьОперацииПлатежнойСистемы(ДокументСсылка) Экспорт
	
	МассивДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекОперацииПлатежнойСистемы.ВидОперации,
		|	ЧекОперацииПлатежнойСистемы.КлючСвязи,
		|	ЧекОперацииПлатежнойСистемы.КодАвторизации,
		|	ЧекОперацииПлатежнойСистемы.НомерКарты,
		|	ЧекОперацииПлатежнойСистемы.НомерСсылкиОперации,
		|	ЧекОперацииПлатежнойСистемы.СлипЧек,
		|	ЧекОперацииПлатежнойСистемы.ДатаОперации КАК ДатаОперации
		|ИЗ
		|	Документ.Чек.ОперацииПлатежнойСистемы КАК ЧекОперацииПлатежнойСистемы
		|ГДЕ
		|	ЧекОперацииПлатежнойСистемы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОперации";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеОперации = Новый Структура;
		ДанныеОперации.Вставить("ВидОперации",         Выборка.ВидОперации);
		ДанныеОперации.Вставить("КодАвторизации",      Выборка.КодАвторизации);
		ДанныеОперации.Вставить("НомерКарты",          Выборка.НомерКарты);
		ДанныеОперации.Вставить("НомерСсылкиОперации", Выборка.НомерСсылкиОперации);
		ДанныеОперации.Вставить("СлипЧек",             Выборка.СлипЧек.Получить());
		ДанныеОперации.Вставить("ДатаОперации",        Выборка.ДатаОперации);
		
		МассивДанных.Добавить(ДанныеОперации);
	КонецЦикла;
		
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли