
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Проведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.Чек.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	Проведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	Продажи.ОтразитьДвижениеНаличных(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();
	Проведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	Проведение.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	Проведение.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Чек") Тогда
		
		ВидОперации = 1;
		ЧекПродажи        = ДанныеЗаполнения.Ссылка;
		ЦенаВключаетНДС   = ДанныеЗаполнения.ЦенаВключаетНДС;
		
		ЗаполнитьТоварыПриВозврате();
	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ЗаказКлиента = ДанныеЗаполнения;
		ЦенаВключаетНДС   = ЗаказКлиента.ЦенаВключаетНДС;
		
		Для Каждого СтрокаЗаказа Из ДанныеЗаполнения.Товары Цикл
			
			СтрокаЧека = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЧека, СтрокаЗаказа,
				"Номенклатура, Количество, СкидкаНаценкаПроцент, СкидкаНаценкаСумма,
				|СтавкаНДС, Сумма, СуммаНДС, Цена"
			);
			
			СтрокаЧека.НеобходимостьВводаАкцизнойМарки =
				ПродажиВызовСервера.ОпределитьНеобходимостьВводаАкцизнойМарки(СтрокаЗаказа.Номенклатура
			);
				
			СтрокаЧека.НеобходимостьШтрихкодаПриПродаже =
				ПродажиВызовСервера.ОпределитьНеобходимостьШтрихкодаПриПродаже(СтрокаЗаказа.Номенклатура
			);
				
			
		КонецЦикла;
		
	Иначе
		
		ЦенаВключаетНДС = ЗначениеНастроекПовтИсп.ЦенаВключаетНДС();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуДокумента();
	
	ТекстПредставленияДокумента = НСтр("ru = '%ВидОперации% = %СуммаДокумента%'");
	
	ТекстВидОперации = ?(ВидОперации = 0, "Продажа", "Возврат");
	
	ТекстПредставленияДокумента = СтрЗаменить(ТекстПредставленияДокумента, "%ВидОперации%", ТекстВидОперации);
	ТекстПредставленияДокумента = СтрЗаменить(ТекстПредставленияДокумента, "%СуммаДокумента%", Формат(СуммаДокумента, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	
	ПредставлениеДокумента = ТекстПредставленияДокумента;
	
	Если НЕ ЗначениеЗаполнено(СтатусЧека) Тогда
		СтатусЧека = Перечисления.СтатусыЧеков.Отложен;
	КонецЕсли;
	
	Если СтатусЧека = Перечисления.СтатусыЧеков.Отложен И НЕ Оплаты.Количество() = 0 Тогда
		
		Если СуммаДокумента = Оплаты.Итог("Сумма") Тогда
			СтатусОплаты = Перечисления.СтатусыОплатыЧека.Оплачен;
		Иначе
			СтатусОплаты = Перечисления.СтатусыОплатыЧека.ОплаченЧастично;
		КонецЕсли;
		
	Иначе
		СтатусОплаты = Перечисления.СтатусыОплатыЧека.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьСтатусЗаказаКлиента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатусЗаказаКлиента()
	
	Если ЗначениеЗаполнено(ЗаказКлиента) И СтатусЧека = Перечисления.СтатусыЧеков.Пробит Тогда
		
		ЗаказКлиентаОбъект = ЗаказКлиента.ПолучитьОбъект();
		ЗаказКлиентаОбъект.СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.Выполнен;
		ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура РассчитатьСуммуДокумента()
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Движения.ДенежныеСредства);
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ЗаполнитьТоварыПриВозврате()
	
	ТаблицаТоваровДляВозврата = Продажи.ПолучитьТаблицуТоваровЧекаВозврата(ЧекПродажи);
	
	Если ТаблицаТоваровДляВозврата.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Нет товаров к возврату'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыВозврата Из ТаблицаТоваровДляВозврата Цикл
		
		СтрокаТовары = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТаблицыВозврата);
		
		Если НЕ СтрокаТаблицыВозврата.АкцизныеМарки = Неопределено Тогда
			
			Для Каждого КодМарки Из СтрокаТаблицыВозврата.АкцизныеМарки Цикл
				Марка                  = АкцизныеМарки.Добавить();
				Марка.КлючСвязи        = СтрокаТаблицыВозврата.КлючСвязи;
				Марка.КодАкцизнойМарки = КодМарки;
			КонецЦикла;
			
			Если СтрокаТаблицыВозврата.АкцизныеМарки.Количество() = 0 Тогда
				СтрокаТовары.Количество = 0;
				СтрокаТовары.Сумма = 0;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЦенаВключаетНДС Тогда
			ПроцентНДС = ЦенообразованиеКлиентСерверПовтИсп.ПолучитьСтавкуНДСЧислом(СтрокаТовары.СтавкаНДС);
			СуммаНДС   = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТовары.Сумма, ПроцентНДС);
		Иначе
			СуммаНДС = 0;
		КонецЕсли;
		
		СтрокаТовары.СуммаНДС  = СуммаНДС;
		
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли