#Область ПрограммныйИнтерфейс
 
// Выполняет GET-запрос к серверу интеграции ТК и возвращает результат выполнения.
//
// Параметры:
//   ТекстЗапроса - Строка - текст GET-запроса
//   ИмяПолеДата - Строка - имя поля ответа, содержащего дату. Необязательный параметр
//
// Возвращаемое значение:
//   Структура:
//     * Результат - Булево - признак успешного выполнения запроса
//     * ОписаниеОшибки - Строка - описание ошибки, если запрос не выполнен
//     * Ответ - Строка - ответ сервера
//
Функция ПодготовитьGETЗапрос(ТекстЗапроса, ИмяПолеДата = "") Экспорт

    Результат = Новый Структура;
    Результат.Вставить("Результат", Ложь);
    Результат.Вставить("ОписаниеОшибки", "");
    Результат.Вставить("Ответ", "");

    ОбменДанными = ИнтеграцияТК.HTTPСоединение();

    Если Не ОбменДанными.СоединениеУстановлено Тогда
        Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
        Возврат Результат;
    КонецЕсли;

    ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными, ТекстЗапроса);

    Если ОбменДанными.СоединениеУстановлено Тогда
        Попытка
            ИнтеграцияТК.ПрочитатьДанные(ОбменДанными, Результат, ИмяПолеДата);
        Исключение
            Результат.ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        КонецПопытки;
    Иначе
        Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
    КонецЕсли;
    Возврат Результат;
КонецФункции

// Отправляет документ на сервер через HTTP-запрос и возвращает результат выполнения
//
// Параметры:
//   СтруктураДокумента - Структура - данные документа для отправки
//   ТекстЗапроса - Строка - путь HTTP-запроса
//               - Массив из Строка - список путей HTTP-запросов
//
// Возвращаемое значение:
//   Структура:
//     * Результат - Булево - результат выполнения операции
//     * ОписаниеОшибки - Строка - описание ошибки, если она возникла
//     * Ответ - Структура - ответ от сервиса при успешном выполнении
//           - Строка - при ошибке
//
Функция ОтправитьНаСервер(СтруктураДокумента, ТекстЗапроса) Экспорт

    Результат = Новый Структура;
    Результат.Вставить("Результат", Ложь);
    Результат.Вставить("ОписаниеОшибки", "");
    Результат.Вставить("Ответ", "");

    ОбменДанными = ИнтеграцияТК.HTTPСоединение();

    Если Не ОбменДанными.СоединениеУстановлено Тогда
        Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
        Возврат Результат;
    КонецЕсли;

    ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными, ТекстЗапроса, Истина, ЗаписатьОтветJSON(СтруктураДокумента));
    Если ОбменДанными.СоединениеУстановлено Тогда
        Попытка
            ИнтеграцияТК.ПрочитатьДанные(ОбменДанными, Результат);
        Исключение
            Результат.ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
        КонецПопытки;
    Иначе
        Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
    КонецЕсли;

    Возврат Результат;

КонецФункции

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Функция ЗаписатьОтветJSON(СтруктураВозврата)
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();

    НастройкиСериализации = Новый НастройкиСериализацииJSON;
    НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;

    ЗаписатьJSON(ЗаписьJSON, СтруктураВозврата, НастройкиСериализации);
    СтрокаВозврата = ЗаписьJSON.Закрыть();

    Возврат СтрокаВозврата;

КонецФункции
Процедура ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными, Знач Запрос, ОтправитьДляОбработки = Ложь, ТелоЗапроса = "")

    Попытка
        HTTPЗапрос = Новый HTTPЗапрос(ОбменДанными.ИмяСервиса + Запрос);
        ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
        HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);
        Если ОтправитьДляОбработки Тогда

            HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);

            ОтветИБ = ОбменДанными.HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

        Иначе
            ОтветИБ = ОбменДанными.HTTPСоединение.Получить(HTTPЗапрос);
        КонецЕсли;
        ОбменДанными.Ответ = ОтветИБ;
    Исключение
        ОбменДанными.СоединениеУстановлено = Ложь;
        ОбменДанными.СообщениеОбОшибке =  ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
    КонецПопытки;

КонецПроцедуры
#КонецОбласти