 

Функция ЗаписатьОтветJSON(СтруктураВозврата)
	
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписьJSON, СтруктураВозврата,НастройкиСериализации);	
	СтрокаВозврата = ЗаписьJSON.Закрыть();	
	
	Возврат СтрокаВозврата;
	
КонецФункции
   
 
Процедура ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными,Знач Запрос,ОтправитьДляОбработки = Ложь,ТелоЗапроса = "")
	
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(ОбменДанными.ИмяСервиса + Запрос);
		ИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор);
		HTTPЗапрос.Заголовки.Вставить("X-1C-Request-UID", ИдентификаторЗапроса);	
		Если ОтправитьДляОбработки Тогда  
			
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса,КодировкаТекста.UTF8);
			
			ОтветИБ = ОбменДанными.HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

		Иначе
			ОтветИБ = ОбменДанными.HTTPСоединение.Получить(HTTPЗапрос);
		КонецЕсли;
		ОбменДанными.Ответ = ОтветИБ;
	Исключение
		ОбменДанными.СоединениеУстановлено = Ложь;
		ОбменДанными.СообщениеОбОшибке =  КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры
   
   
   
Функция ПодготовитьGETЗапрос(ТекстЗапроса,ИмяПолеДата="")Экспорт  
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли; 
	
	ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными,ТекстЗапроса);
	
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат,ИмяПолеДата);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
	КонецЕсли;
	
	
	Возврат Результат;
	

КонецФункции

//   
//Функция ПолучитьКоличествоРезервов()Экспорт

//	Результат = Новый Структура;
//	Результат.Вставить("Результат",Ложь);
//	Результат.Вставить("ОписаниеОшибки","");
//	Результат.Вставить("Ответ","");
//	
//	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
//	
//	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
//		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
//		Возврат Результат;
//	КонецЕсли; 
//	
//	
//	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/rezerv";
//	
//	ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными,текстзапроса);
//	
//	Если ОбменДанными.СоединениеУстановлено Тогда
//		Попытка
//			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
//		Исключение
//			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
//		КонецПопытки;
//	Иначе
//		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
//	КонецЕсли;
//	
//	
//	Возврат Результат;
//	
//	

//КонецФункции
//   
//Функция ВзятьРезервВработу()Экспорт

//	Результат = Новый Структура;
//	Результат.Вставить("Результат",Ложь);
//	Результат.Вставить("ОписаниеОшибки","");
//	Результат.Вставить("Ответ","");
//	
//	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
//	
//	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
//		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
//		Возврат Результат;
//	КонецЕсли; 
//	
//	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/rezervrab?uuidcom="+ПараметрыСеанса.Сотрудник_ID;
//	
//	ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными,текстзапроса);
//	
//	Если ОбменДанными.СоединениеУстановлено Тогда
//		Попытка
//			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
//		Исключение
//			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
//		КонецПопытки;
//	Иначе
//		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
//	КонецЕсли;
//	
//	
//	Возврат Результат;
//	
//	

//КонецФункции
//   
//Функция ОтменитьСборРезерва()Экспорт

//	Результат = Новый Структура;
//	Результат.Вставить("Результат",Ложь);
//	Результат.Вставить("ОписаниеОшибки","");
//	Результат.Вставить("Ответ","");
//	
//	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
//	
//	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
//		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
//		Возврат Результат;
//	КонецЕсли; 
//	
//	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/rezervotmena?uuidcom="+ПараметрыСеанса.Сотрудник_ID;

//	
//	ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными,текстзапроса);
//	
//	Если ОбменДанными.СоединениеУстановлено Тогда
//		Попытка
//			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
//		Исключение
//			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
//		КонецПопытки;
//	Иначе
//		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
//	КонецЕсли;
//	
//	
//	Возврат Результат;

//КонецФункции



Функция ОтправитьНаСервер(СтруктураДокумента,ТекстЗапроса)Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Результат",Ложь);
	Результат.Вставить("ОписаниеОшибки","");
	Результат.Вставить("Ответ","");
	
	ОбменДанными = ИнтеграцияТК.HTTPСоединение();
	
	Если НЕ ОбменДанными.СоединениеУстановлено Тогда
		Результат.ОписаниеОшибки = ОбменДанными.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;    
	//текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/DocFinih";
	ВыполнитьЗапросHTTP_Комплектовщик(ОбменДанными,ТекстЗапроса,Истина,ЗаписатьОтветJSON(СтруктураДокумента)); 
	Если ОбменДанными.СоединениеУстановлено Тогда
		Попытка
			ИнтеграцияТК.ПрочитатьДанные(ОбменДанными,Результат);
		Исключение
			Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
		КонецПопытки;
	Иначе
		Результат.ОписаниеОшибки =  ОбменДанными.СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

