
#Область ПрограммныйИнтерфейс

//&НаСервере
//Функция АдресМарокЧекаВХранилище() Экспорт
//	
//	Возврат ПоместитьВоВременноеХранилище(Объект.АкцизныеМарки.Выгрузить().ВыгрузитьКолонку("КодАкцизнойМарки"), УникальныйИдентификатор);
//	
//КонецФункции

&НаКлиенте
Функция ДанныеОплатыПоПлатежнойКарте() Экспорт
	
	Если Объект.Оплаты.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьДанныеОплатыПоПлатежнойКарте();
	
КонецФункции

&НаКлиенте
Процедура ПослеПолучениеРезультатаПоПлатежнойСистеме(Сумма, ВидОплаты, РезультатОперацииПоПлатежнойСистеме) Экспорт
	
	Если НЕ РезультатОперацииПоПлатежнойСистеме.Успешно Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаписатьЧек();
	КонецЕсли;
	
	Если РезультатОперацииПоПлатежнойСистеме.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.Оплата")
		ИЛИ РезультатОперацииПоПлатежнойСистеме.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.ВозвратОплаты") Тогда
		
		КлючСвязи = ДобавитьОплатуПоПлатежнойКарте(Сумма, ВидОплаты);
		ДобавитьОперациюПоПлатежнойСистеме(РезультатОперацииПоПлатежнойСистеме, КлючСвязи);
		
		Оповестить("ЗаписанЧек", Объект.Ссылка);
		
	ИначеЕсли РезультатОперацииПоПлатежнойСистеме.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.ОтменаОплаты") Тогда
		
		ДобавитьОперациюПоПлатежнойСистеме(РезультатОперацииПоПлатежнойСистеме);
		
		КлючСвязи = ОпределитьКлючСвязиОплаты(РезультатОперацииПоПлатежнойСистеме.НомерСсылкиОперации);
		УдалитьОплатуПоПлатежнойКарте(КлючСвязи);
		
	КонецЕсли;
	
	ЗаполнитьИнформациюОбОплате();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, ДополнительныеПараметры) Экспорт
	
	ВводитьАкцизныеМарки = Ложь;
	Если ДополнительныеПараметры.Свойство("ВозвратТоваров") И ДополнительныеПараметры.ВозвратТоваров Тогда
		ВводитьАкцизныеМарки = Истина;
		ДополнительныеПараметры.Вставить("ЧекПродажи", Объект.Ссылка);
	КонецЕсли;
	
	ПродажиКлиент.ПолучитьНоменклатуруПоШтрихкоду(ПолученныйШтрихкод, ДополнительныеПараметры, ВводитьАкцизныеМарки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученнуюПоШтрихкодуНоменклатуру(ДанныеНоменклатуры, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ВозвратТоваров") И ДополнительныеПараметры.ВозвратТоваров Тогда
		
		Если ЗначениеНастроекВызовСервераПовтИсп.СканированиеВнешнимСканером() Тогда
			
			МассивНоменклатуры = Новый Массив;
			МассивНоменклатуры.Добавить(ДанныеНоменклатуры);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СозданиеПослеСканирования", Истина);
			ПараметрыФормы.Вставить("МассивНоменклатуры", МассивНоменклатуры);
			ПараметрыФормы.Вставить("ВозвратТоваров", Истина);
			ПараметрыФормы.Вставить("ЧекПродажи", Объект.Ссылка);
			ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
			
			ОткрытьФорму("Документ.Чек.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
			
		Иначе
			
			ПулТоваровВозврата.Добавить(ДанныеНоменклатуры);
			
			Если ДополнительныеПараметры.Свойство("ВременноеЗакрытиеДиалога") И ДополнительныеПараметры.ВременноеЗакрытиеДиалога Тогда
				ДополнительныеПараметры.ВременноеЗакрытиеДиалога = Ложь;
				ОткрытьДиалогВводаШтрихкода();
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе
		
		Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
			
			ИдентификаторСтроки = ОпределитьСтрокуЧека(ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.Цена);
		Иначе
			
			ИдентификаторСтроки = ОпределитьСтрокуЧекаВозврат(ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.Цена);
		КонецЕсли;
		
		//Если ИспользуетсяЕГАИС И ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки Тогда
		//	
		//	ЗакрытьДиалогВводаШтрихкода();
		//	ВвестиАкцизныеМарки(ИдентификаторСтроки, ДанныеНоменклатуры);
		//	
		//Иначе
		//	
			ЗаполнитьСтрокуЧекаПоВидуОперации(ИдентификаторСтроки, ДанныеНоменклатуры);
			Модифицированность = Истина;
			ПодсветитьСтроку(ИдентификаторСтроки);
			
			Если ИспользоватьСкидкиНаценки Тогда
				РассчитатьСкидкуНаценкуПоДокументу();
				ОбновитьОтображениеСкидкиНаДокумент();
			КонецЕсли;
		
	//	КонецЕсли;
		
		УстановитьДоступностьОплаты();
		ОткрытьДиалогВводаШтрихкода();
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ВременноеЗакрытиеДиалога") И ДополнительныеПараметры.ВременноеЗакрытиеДиалога Тогда
		
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ВозвратТоваров") И ДополнительныеПараметры.ВозвратТоваров И ПулТоваровВозврата.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СозданиеПослеСканирования", Истина);
		ПараметрыФормы.Вставить("МассивНоменклатуры", ПулТоваровВозврата.ВыгрузитьЗначения());
		ПараметрыФормы.Вставить("ВозвратТоваров", Истина);
		ПараметрыФормы.Вставить("ЧекПродажи", Объект.Ссылка);
		ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
		
		ОткрытьФорму("Документ.Чек.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
		
		ПулТоваровВозврата.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьКонстантыФормы();
	
	НастроитьФормуПоЗначениямНастроек();
	
	НастроитьОформлениеПолей();
	
	Если (Параметры.Свойство("ВозвратТоваров") И Параметры.ВозвратТоваров) Тогда
		
		Объект.ВидОперации     = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат();
		Объект.ЧекПродажи      = Параметры.ЧекПродажи;
		Объект.ЦенаВключаетНДС = Параметры.ЦенаВключаетНДС;
		
	КонецЕсли;
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ЗаполнитьБуферВозвратаТоваров();
		ОпределитьДанныеОплатыПоПлатежнойКартеЧекаПродажи();
		
	КонецЕсли;
	
	Если Параметры.Свойство("СозданиеПослеСканирования") И Параметры.СозданиеПослеСканирования Тогда
		
		Для Каждого ДанныеНоменклатуры Из Параметры.МассивНоменклатуры Цикл
			
			Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
				
				ИдентификаторСтроки = ОпределитьСтрокуЧека(ДанныеНоменклатуры.Номенклатура);
			Иначе
				
				ИдентификаторСтроки = ОпределитьСтрокуЧекаВозврат(ДанныеНоменклатуры.Номенклатура);
			КонецЕсли;
			
			ЗаполнитьСтрокуЧекаПоВидуОперации(ИдентификаторСтроки, ДанныеНоменклатуры);
		КонецЦикла;
		
		ИдетПроцессСканирования = Истина;
		
	ИначеЕсли Параметры.Свойство("СозданиеИзПодбора") И Параметры.СозданиеИзПодбора Тогда
		
		ПодборТоваровСервер(Параметры.АдресВоВременномХранилище);
		
	КонецЕсли;
	
	ОбновитьЗаписиПоСтрокамТЧ();
	
	СформироватьЗаголовокЧека();
	НастроитьГруппуОплаты();
	
	
	// скидка на чек
	РассчитатьСкидкуНаценкуПоДокументу();
	ОбновитьОтображениеСкидкиНаДокумент();
	
	ЗаполнитьИнформациюОбОплате();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрытьДиалогВводаШтрихкода();
	
	УстановитьДоступностьОплаты();
	
	СформироватьПредставлениеКоординат();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		ИнициализироватьКонстантыФормы();
		НастроитьФормуПоЗначениямНастроек();
		
	КонецЕсли;
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		Если НЕ ТоварыТолькоПросмотр Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
			ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	
	Если НЕ ПараметрыСтроки = Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.РедактированиеСтроки", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТоварыВыбор(Элемент,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыГоризонтПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаГоризонтНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗаказКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЗаказКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекПродажиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЧекПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекПродажиГоризонтНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьЧекПродажи();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСкидкиНаценкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СуммаБезСкидки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СкидкаНаценкаПроцент",  СкидкаНаценкаНаЧекПроцент);
	ПараметрыФормы.Вставить("СкидкаНаценкаСумма",    СкидкаНаценкаНаЧекСумма);
	ПараметрыФормы.Вставить("СуммаБезСкидкиНаценки", СуммаБезСкидки);
	ПараметрыФормы.Вставить("ЗаголовокДокумента",    НСтр("ru = 'чек'"));
	ПараметрыФормы.Вставить("ТолькоПросмотрФормы",   ТолькоПросмотрФормы()
		ИЛИ Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат()
	);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииСкидкиНаЧекЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеСкидки", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отложить(Команда)
	
	Объект.СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Отложен");
	
	ЗаписатьЧек();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Наличные(Команда)
	
	Если НЕ ПроверитьКассовуюСмену() Тогда
		
		ТекстСообщения = НСтр("ru = 'Смена открыта более 24 часов.
			|Для пробития необходимо закрыть смену.'");
		ПоказатьПредупреждение( ,ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыОплаты = СтруктураПараметровДляПечатиЧека();
	ПараметрыОплаты.Вставить("ФормаОплаты", "Наличные");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОплаты",ЭтотОбъект);
	ОткрытьФорму("Документ.Чек.Форма.Оплата", ПараметрыОплаты, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежнаяКарта(Команда)
	
	Если НЕ ПроверитьКассовуюСмену() Тогда
		
		ТекстСообщения = НСтр("ru = 'Смена открыта более 24 часов.
			|Для пробития необходимо закрыть смену.'");
		ПоказатьПредупреждение( ,ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	ИмяФормыОплаты = "Документ.Чек.Форма.Оплата";
	
	ПараметрыОплаты = СтруктураПараметровДляПечатиЧека();
	ПараметрыОплаты.Вставить("ФормаОплаты", "ПлатежнаяКарта");
	
	Если НЕ Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат()
		И ПродажиВызовСервераПовтИсп.КоличествоВидовОплаты() > 1 
		И (ПараметрыОплаты.ДанныеОплатыПоПлатежнойКарте = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПараметрыОплаты.ДанныеОплатыПоПлатежнойКарте.ВидОплаты)) Тогда
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ИмяФормыОплаты", ИмяФормыОплаты);
		ДополнительныеПараметры.Вставить("ПараметрыОплаты", ПараметрыОплаты);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеВыборВидаОплаты", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ВидыОплаты.ФормаВыбора",,,,,,ОписаниеОповещения);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОплаты", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыОплаты, ПараметрыОплаты, ЭтаФорма,,,,ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СмешаннаяОплата(Команда)
	
	Если НЕ ПроверитьКассовуюСмену() Тогда
		
		ТекстСообщения = НСтр("ru = 'Смена открыта более 24 часов.
			|Для пробития необходимо закрыть смену.'");
		ПоказатьПредупреждение( ,ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	ИмяФормыОплаты = "Документ.Чек.Форма.Оплата";
	
	ПараметрыОплаты = СтруктураПараметровДляПечатиЧека();
	ПараметрыОплаты.Вставить("ФормаОплаты", "СмешаннаяОплата");
	
	ЕстьОшибки = Ложь;
	Если Объект.ВидОперации = 1 Тогда
		ПроверитьСмешаннуюОплатуВозврата(ПараметрыОплаты, ЕстьОшибки);
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат()
		И ПродажиВызовСервераПовтИсп.КоличествоВидовОплаты() > 1 
		И (ПараметрыОплаты.ДанныеОплатыПоПлатежнойКарте = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ПараметрыОплаты.ДанныеОплатыПоПлатежнойКарте.ВидОплаты)) Тогда
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ИмяФормыОплаты", ИмяФормыОплаты);
		ДополнительныеПараметры.Вставить("ПараметрыОплаты", ПараметрыОплаты);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеВыборВидаОплаты", ЭтотОбъект, ДополнительныеПараметры);
		ОткрытьФорму("Справочник.ВидыОплаты.ФормаВыбора",,,,,,ОписаниеОповещения);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОплаты", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыОплаты, ПараметрыОплаты, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратЧека(Команда)
	
	Если ОплатаТолькоБезналичными() Тогда
		
		СформироватьПолныйВозврат();
		
	Иначе
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ПолныйВозврат",    НСтр("ru = 'Полный возврат чека'"));
		Кнопки.Добавить("ЧастичныйВозврат", НСтр("ru = 'Частичный возврат'"));
		
		Если ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров() Тогда
			Кнопки.Добавить("СканированиеШтрихкода", НСтр("ru = 'Сканирование штрихкода'"));
		КонецЕсли;
		
		Кнопки.Добавить("Отмена", "Отмена");
		
		Оповещение = Новый ОписаниеОповещения("ВозвратЧекаПродолжение", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, "", Кнопки,, "ПолныйВозврат");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СканированиеШтрихкода(Команда)
	
	ИдетПроцессСканирования = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Аннулировать(Команда)
	
	Если ЗначениеЗаполнено(Объект.СтатусОплаты) Тогда
		ТекстСообщения = НСтр("ru = 'Чек %СтатусОплаты%.
								|Аннулирование невозможно.'"
		);
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СтатусОплаты%", Объект.СтатусОплаты);
		
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Аннулировать чек?'");
	
	Оповещение = Новый ОписаниеОповещения("АннулироватьЧекПродолжение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТоваров(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеПодборТоваров", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ПараметрыФормы.Вставить("Режим", "ПодборВВозврат");
		ПараметрыФормы.Вставить("ЧекПродажи", Объект.ЧекПродажи);
		ПараметрыФормы.Вставить("ЧекВозврата", Неопределено);
		ПараметрыФормы.Вставить("АдресВоВременномХранилище", ПоместитьТоварыВоВременноеХранилище());
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ПараметрыФормы.Вставить("ЧекВозврата", Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ПодборТоваров.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьДанныеЕГАИС(Команда)
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("АдресЧекаЕГАИС",   Объект.АдресЧекаЕГАИС);
//	ПараметрыФормы.Вставить("ПодписьЧекаЕГАИС", Объект.ПодписьЧекаЕГАИС);
//	
//	ОткрытьФорму("Документ.Чек.Форма.ДанныеЕГАИС", ПараметрыФормы, ЭтаФорма);
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКоординатыНаКарте(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КоординатыДолгота) И НЕ ЗначениеЗаполнено(Объект.КоординатыШирота) Тогда
		
		ОчиститьСообщения();
		
		ТекстСообщения = НСтр("ru = 'Координаты не определены.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если ЗначениеЗаполнено(Объект.КоординатыДолгота) И ЗначениеЗаполнено(Объект.КоординатыШирота) Тогда
			
			ГеоКоординаты = Новый ГеографическиеКоординаты(Объект.КоординатыШирота, Объект.КоординатыДолгота);
			
			ПоказатьНаКарте(ГеоКоординаты);
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьАдрес(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Объект.ПредставлениеАдресаМестоположения = ГеолокацияКлиент.ПолучитьПредставлениеАдресаМестоположения(, Объект.КоординатыШирота, Объект.КоординатыДолгота);
		СформироватьПредставлениеКоординат();
		
		Если ЗначениеЗаполнено(Объект.ПредставлениеАдресаМестоположения) Тогда
			ЗаписатьЧек();
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдрес(Команда)
	
	ОткрытьДиалогВводаАдреса(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОперацииПлатежнойСистемы(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СсылкаНаЧек", Объект.Ссылка);
	
	ОткрытьФорму("Документ.Чек.Форма.ОперацииПлатежнойСистемы", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОплатаПлатежнаяСистема

&НаКлиенте
Функция ОпределитьКлючСвязиОплаты(НомерСсылкиОперации)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежнойСистемы.Оплата"));
	ПараметрыОтбора.Вставить("НомерСсылкиОперации", НомерСсылкиОперации);
	
	НайденныеСтроки = Объект.ОперацииПлатежнойСистемы.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Неизвестная ошибка. Отменяемая оплата не найдена.'");
	Иначе
		Возврат НайденныеСтроки[0].КлючСвязи;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДобавитьОплатуПоПлатежнойКарте(Сумма, ВидОплаты)
	
	НоваяОплата = Объект.Оплаты.Добавить();
	
	НоваяОплата.Сумма     = Сумма;
	НоваяОплата.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплаты.ПлатежнаяКарта");
	НоваяОплата.ВидОплаты = ВидОплаты;
	
	ОбработкаТабличнойЧастиТоварыКлиентСервер.ЗаполнитьКлючСвязи(Объект.ОперацииПлатежнойСистемы, НоваяОплата, "КлючСвязи");
	
	Возврат НоваяОплата.КлючСвязи;
	
КонецФункции

&НаКлиенте
Процедура УдалитьОплатуПоПлатежнойКарте(КлючСвязи)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("КлючСвязи", КлючСвязи);
	
	НайденныеСтроки =  Объект.Оплаты.НайтиСтроки(ПараметрыПоиска);
	
	Если НЕ НайденныеСтроки.Количество() = 0 Тогда
		
		Индекс = Объект.Оплаты.Индекс(НайденныеСтроки[0]);
		Объект.Оплаты.Удалить(Индекс);
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Неизвестная ошибка. Отменяемая оплата не найдена.'");
	КонецЕсли;
	
	ЗаписатьЧек();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОплатыПоПлатежнойКарте()
	
	Возврат Документы.Чек.ДанныеОплатыПоПлатежнойКарте(Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура ДобавитьОперациюПоПлатежнойСистеме(РезультатОперации, КлючСвязи = 0)
	
	ЧекОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.Чек"));
	
	НоваяОперация = ЧекОбъект.ОперацииПлатежнойСистемы.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяОперация, РезультатОперации, "ВидОперации, КодАвторизации, НомерКарты, НомерСсылкиОперации, ДатаОперации");
	НоваяОперация.СлипЧек = Новый ХранилищеЗначения(РезультатОперации.СлипЧек, Новый СжатиеДанных(9));
	НоваяОперация.КлючСвязи = КлючСвязи;
	
	ЧекОбъект.Записать();
	ЭтаФорма.Прочитать();
КонецПроцедуры

#КонецОбласти

#Область СканированиеШтрихкода

&НаКлиенте
Процедура ОткрытьДиалогВводаШтрихкода(ДляЛюбогоТипаСканера = Ложь)
	
	Если ДляЛюбогоТипаСканера Тогда
		
		Если ИдетПроцессСканирования И НЕ ИдетВводАкцизныхМарок Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьШтрихкод", 0.1, Истина);
		КонецЕсли;
		
	Иначе
		
		Если ИдетПроцессСканирования И ЗначениеНастроекВызовСервераПовтИсп.СканированиеВнешнимСканером() И НЕ ИдетВводАкцизныхМарок Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьШтрихкод", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДиалогВводаШтрихкода()
	
	Если ЗначениеНастроекВызовСервераПовтИсп.СканированиеВстроеннойКамерой() Тогда
		
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьШтрихкод()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область АкцизныеМарки


#КонецОбласти

#Область СкидкаНаДокумент

&НаСервере
Процедура РассчитатьСкидкуНаценкуПоДокументу()
	
	Если НЕ ИспользоватьСкидкиНаценки Тогда
		Возврат;
	КонецЕсли;
	
	СкидкаНаценкаНаЧекСумма = Объект.Товары.Итог("СкидкаНаценкаСумма");
	
	СуммаБезСкидки = Объект.Товары.Итог("СуммаБезСкидки");
	
	Если НЕ СуммаБезСкидки = 0 Тогда
		СкидкаНаценкаНаЧекПроцент = СкидкаНаценкаНаЧекСумма * 100 / СуммаБезСкидки;
	Иначе
		СкидкаНаценкаНаЧекПроцент = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСкидкиНаДокумент()
	
	Если НЕ ИспользоватьСкидкиНаценки Тогда
		Возврат;
	КонецЕсли;
	
	Если СкидкаНаценкаНаЧекСумма <= 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"СуммаСкидкиНаценки, СуммаСкидкиНаценкиГоризонт", "Заголовок",
			НСтр("ru = 'Скидка'")
		);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"СуммаСкидкиНаценки, СуммаСкидкиНаценкиГоризонт", "Заголовок",
			НСтр("ru = 'Наценка'")
		);
		
	КонецЕсли;
	
	ШаблонЗначенияСкидки = НСтр("ru = '%1 (%2%)'");
	
	СуммаСкидкиНаценки = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗначенияСкидки,
		Формат(?(СкидкаНаценкаНаЧекСумма < 0,   - СкидкаНаценкаНаЧекСумма,   СкидкаНаценкаНаЧекСумма),   ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()),
		Формат(?(СкидкаНаценкаНаЧекПроцент < 0, - СкидкаНаценкаНаЧекПроцент, СкидкаНаценкаНаЧекПроцент), ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей())
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСкидкиНаЧекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	СкидкаНаценкаНаЧекСумма   = Результат.СкидкаНаценкаСумма;
	СкидкаНаценкаНаЧекПроцент = Результат.СкидкаНаценкаПроцент;
	
	НазначитьСкидкуНаЧек();
	
КонецПроцедуры

&НаСервере
Процедура НазначитьСкидкуНаЧек()
	
	ОбновитьОтображениеСкидкиНаДокумент();
	
	Продажи.НазначитьСкидкуНаДокумент(Объект, "Товары", СкидкаНаценкаНаЧекСумма);
	
	Для Каждого СтрокаЧека Из Объект.Товары Цикл
		РассчитатьНДССтрокиЧека(СтрокаЧека);
	КонецЦикла;
	
	ОбновитьЗаписиПоСтрокамТЧ();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ТолькоПросмотрФормы()
	
	Если Объект.СтатусЧека    = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Пробит")
		ИЛИ Объект.СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Архивный")
		ИЛИ Объект.СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Аннулирован")
		ИЛИ Объект.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплатыЧека.Оплачен")
		ИЛИ Объект.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусыОплатыЧека.ОплаченЧастично")
		ИЛИ ТоварыТолькоПросмотр Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	//ИспользуетсяЕГАИС = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяЕГАИСПриПродаже();
	ИспользоватьСкидкиНаценки = ЗначениеНастроекПовтИсп.ИспользуютсяСкидкиНаценки();
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОформлениеПолей()
	
	ОбщегоНазначения.ОформитьСуммовыеПоля(ЭтаФорма, "Сумма, СуммаОплата, СуммаНДС, СуммаОплатаГоризонт, СуммаНДСГоризонт,
		|ОплаченоНаличными, ОплаченоНаличнымиГоризонт, ОплаченоПлатежнойКартой, ОплаченоПлатежнойКартойГоризонт");
		
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "ОплаченоВидОплаты, ОплаченоВидОплатыГоризонт");
	
	ОбщегоНазначения.УстановитьЦветИтоговыхПолей(ЭтаФорма, 
		"Сумма, СуммаОплата, СуммаНДС, СуммаГоризонт, СуммаОплатаГоризонт, СуммаНДСГоризонт");
	
	СписокКнопок = "Наличные, НаличныеГоризонт, ПлатежнаяКарта, ПлатежнаяКартаГоризонт, СмешаннаяОплата,
		|СмешаннаяОплатаГоризонт, ПодборТоваров, СканированиеШтрихкода, ПодборТоваровГоризонт,
		|СканированиеШтрихкодаГоризонт, ВозвратГоризонт, ОтложитьГоризонт, АннулироватьГоризонт";
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказКлиента()
	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта",
		Новый Структура("Ключ", Объект.ЗаказКлиента),
		ЭтаФорма
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекПродажи()
	
	ОткрытьФорму("Документ.Чек.ФормаОбъекта",
		Новый Структура("Ключ", Объект.ЧекПродажи),
		ЭтаФорма
	);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКассовуюСмену()
	
	КассоваяСмена = ПродажиВызовСервераПовтИсп.ПолучитьСмену(Ложь);
	
	Если ЗначениеЗаполнено(КассоваяСмена) И
		Продажи.КассоваяСменаПросрочена(КассоваяСмена) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуЧекаПоВидуОперации(ИдентификаторСтроки, ДанныеНоменклатуры, ОчищатьСуществующиеМарки = Истина)
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
		
		ЗаполнитьСтрокуЧека(ИдентификаторСтроки, ДанныеНоменклатуры, ОчищатьСуществующиеМарки);
	Иначе
		
		ЗаполнитьСтрокуЧекаВозврат(ИдентификаторСтроки, ДанныеНоменклатуры, ОчищатьСуществующиеМарки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьСтрокуЧека(Номенклатура, Цена = Неопределено)
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		СтрокаЧека = Объект.Товары.Добавить();
		
	Иначе
		СтрокаЧека = Неопределено;
		
		// количество суммируется только если не введена скидка
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			Если Строка.СкидкаНаценкаСумма = 0 Тогда
				
				Если НЕ Цена = Неопределено Тогда
					Если НЕ Строка.Цена = Цена Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаЧека = Строка;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаЧека = Неопределено Тогда
			СтрокаЧека = Объект.Товары.Добавить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаЧека.ПолучитьИдентификатор();
	
КонецФункции

&НаСервере
Функция ОпределитьСтрокуЧекаВозврат(Номенклатура, Цена = Неопределено)
	
	СтрокаЧекаВозврат = Неопределено;
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Номенклатура", Номенклатура);
	
	Если НЕ Цена = Неопределено Тогда
		ПараметрыПоиска.Вставить("ЦенаСУчетомСкидки", Цена);
	КонецЕсли;
	
	НайденныеСтрокиБуфер = БуферВозвратаТоваров.НайтиСтроки(ПараметрыПоиска);
	
	Для Каждого СтрокаБуфера Из НайденныеСтрокиБуфер Цикл
		
		РазрешеноДобавить = СтрокаБуфера.Количество - СтрокаБуфера.КоличествоВозврат;
		
		Если НЕ РазрешеноДобавить > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура("Номенклатура, ЦенаСУчетомСкидки", Номенклатура, СтрокаБуфера.ЦенаСУчетомСкидки);
	
		НайденныеСтроки = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
	
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			СтрокаЧекаВозврат = Объект.Товары.Добавить();
		Иначе
			
			СтрокаЧекаВозврат = НайденныеСтроки[0];
		КонецЕсли;
		
		СтрокаЧекаВозврат.ЦенаСУчетомСкидки = СтрокаБуфера.ЦенаСУчетомСкидки;
		
		Прервать;
		
	КонецЦикла;
	
	Если СтрокаЧекаВозврат = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Товар не доступен к возврату'");
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	Возврат СтрокаЧекаВозврат.ПолучитьИдентификатор();
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьЧек()
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	ЭтаФорма.Записать(ПараметрыЗаписи);
	
	ОбновитьЗаписиПоСтрокамТЧ();
	
	Оповестить("ЗаписанЧек", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПодборТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодборТоваровСервер(Результат.АдресВоВременномХранилище);
	
	УстановитьДоступностьОплаты();
	
КонецПроцедуры

&НаСервере
Процедура ПодборТоваровСервер(АдресВоВременномХранилище)
	
	ТаблицаПодбор = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	ОчищатьСуществующиеМарки = Ложь;
	
	Для Каждого СтрокаПодбора Из ТаблицаПодбор Цикл
		
		Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
			
			ИдентификаторСтроки = ОпределитьСтрокуЧека(СтрокаПодбора.Номенклатура, СтрокаПодбора.Цена);
			
		Иначе
			ИдентификаторСтроки = ОпределитьСтрокуЧекаВозврат(СтрокаПодбора.Номенклатура, СтрокаПодбора.Цена);
		КонецЕсли;
		
		ЗаполнитьСтрокуЧекаПоВидуОперации(ИдентификаторСтроки,СтрокаПодбора, ОчищатьСуществующиеМарки);
		
	КонецЦикла;
	
	Если ИспользоватьСкидкиНаценки Тогда
		РассчитатьСкидкуНаценкуПоДокументу();
		ОбновитьОтображениеСкидкиНаДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьЧекПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет ИЛИ Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Аннулирован");
	
	ЗаписатьЧек();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОбОплате()
	
	ОплаченоНаличными = 0;
	ОплаченоПлатежнойКартой = 0;
	ОплаченоВидОплаты = Неопределено;
	
	Для Каждого СтрокаОплаты Из Объект.Оплаты Цикл
		
		Если СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплаты.Наличные Тогда
			
			ОплаченоНаличными = СтрокаОплаты.Сумма;
			
		ИначеЕсли СтрокаОплаты.ТипОплаты = Перечисления.ТипыОплаты.ПлатежнаяКарта Тогда
			
			ОплаченоПлатежнойКартой = СтрокаОплаты.Сумма;
			ОплаченоВидОплаты = СтрокаОплаты.ВидОплаты;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ОплаченоНаличными, ОплаченоНаличнымиГоризонт", "Видимость",
		ЗначениеЗаполнено(ОплаченоНаличными));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ОплаченоПлатежнойКартой, ОплаченоПлатежнойКартойГоризонт", "Видимость",
		ЗначениеЗаполнено(ОплаченоПлатежнойКартой));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ОплаченоВидОплаты, ОплаченоВидОплатыГоризонт", "Видимость",
		ЗначениеЗаполнено(ОплаченоВидОплаты));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"СуммаНДС, СуммаНДСГоризонт", "Видимость",
		Объект.ЦенаВключаетНДС);
	
	НастроитьВидимостьПоСтатусуИВидуОперации();
	
	НастроитьОтображениеОперацийПлатежнойСистемы();
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяОплатаПлатежнымиКартами() Тогда
		
		// доступность команд оплаты по состоянию предоплаты
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"Наличные, НаличныеГоризонт", "Видимость",
			Элементы.Наличные.Видимость И НЕ ЗначениеЗаполнено(Объект.СтатусОплаты)
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"ПлатежнаяКарта, ПлатежнаяКартаГоризонт", "Видимость",
			((Элементы.ПлатежнаяКарта.Видимость ИЛИ Элементы.СмешаннаяОплата.Видимость) И (
				(ЗначениеЗаполнено(Объект.СтатусОплаты) И ОплаченоПлатежнойКартой = Объект.СуммаДокумента))
				ИЛИ (Элементы.ПлатежнаяКарта.Видимость И НЕ ЗначениеЗаполнено(Объект.СтатусОплаты)))
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"СмешаннаяОплата, СмешаннаяОплатаГоризонт", "Видимость",
			Элементы.СмешаннаяОплата.Видимость 
			И ((ЗначениеЗаполнено(Объект.СтатусОплаты) И НЕ ОплаченоПлатежнойКартой = Объект.СуммаДокумента) 
				ИЛИ НЕ ЗначениеЗаполнено(Объект.СтатусОплаты))
		);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборВидаОплаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОплаты = ДополнительныеПараметры.ПараметрыОплаты;
	ПараметрыОплаты.ВидОплаты = Результат;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОплаты", ЭтотОбъект);
	ОткрытьФорму(ДополнительныеПараметры.ИмяФормыОплаты, ПараметрыОплаты, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОплаты(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьЗаписиПоСтрокамТЧ();
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена ИЛИ НЕ Результат.Свойство("Успешно") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Успешно Тогда
		
		Объект.Дата             = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
		Объект.СтатусЧека       = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Пробит");
		Объект.КассоваяСмена    = Результат.КассоваяСмена;
		//Объект.АдресЧекаЕГАИС   = Результат.АдресЧекаЕГАИС;
		//Объект.ПодписьЧекаЕГАИС = Результат.ПодписьЧекаЕГАИС;
		
		Объект.АдресEmailПокупателя    = Результат.АдресEmailПокупателя;
		Объект.НомерТелефонаПокупателя = Результат.НомерТелефонаПокупателя;
		
		Для Каждого СтруктураОплаты Из Результат.Оплата Цикл
			
			Если СтруктураОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплаты.ПлатежнаяКарта")
				И НЕ СтруктураОплаты.РезультатОперацииПоПлатежнойСистеме = Неопределено Тогда
				
				// добавление платежей происходит в ПослеПолучениеРезультатаПоПлатежнойСистеме
				
			Иначе
				НоваяОплата = Объект.Оплаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяОплата, СтруктураОплаты);
			КонецЕсли;
			
		КонецЦикла;
		
		Объект.ФискальныйНомер = Результат.ФискальныйНомер;
		
		ЗаписатьЧек();
		Оповестить("КассоваяОперация");
		
		Если ОпределитьКоординатыПробития() Тогда
			ЭтаФорма.Закрыть(КодВозвратаДиалога.ОК);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Номенклатура", СтрокаТаблицы.Номенклатура);
		СтруктураСтроки.Вставить("Цена",         СтрокаТаблицы.Цена);
		СтруктураСтроки.Вставить("Количество", 0);
	КонецЕсли;
	
	Если Результат.Свойство("УдалитьСтроку") Тогда
		
		//Если СтрокаТаблицы.НеобходимостьВводаАкцизнойМарки И ЗначениеЗаполнено(СтрокаТаблицы.КлючСвязи) Тогда
		//	
		//	УдалитьАкцизныеМаркиПоКлючуСвязи(Объект.АкцизныеМарки, СтрокаТаблицы.КлючСвязи);
		//	
		//КонецЕсли;
		
		ИндексСтроки = Объект.Товары.Индекс(СтрокаТаблицы);
		Объект.Товары.Удалить(ИндексСтроки);
		
		Модифицированность = Истина;
		
	ИначеЕсли Результат.Свойство("Сохранить") Тогда
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат);
		//
		//Если ИспользуетсяЕГАИС И СтрокаТаблицы.НеобходимостьВводаАкцизнойМарки Тогда
		//	ЗаполнитьМаркиПоВСтрокеЧека(СтрокаТаблицы.КлючСвязи, Результат.АдресМарокВХранилище);
		//КонецЕсли;
		
		ОбновитьЗаписьПоСтроке(,ИдентификаторСтроки);
		
		Модифицированность = Истина;
		
		ПодсветитьСтроку(ИдентификаторСтроки);
	КонецЕсли;
	
	// обновление буфера возврата
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		Если Результат.Свойство("УдалитьСтроку") Тогда
			СтруктураСтроки.Количество = 0;
		ИначеЕсли Результат.Свойство("Сохранить") Тогда
			СтруктураСтроки.Количество = Результат.Количество;
		КонецЕсли;
		
		ОбновитьСтрокуБуфера(СтруктураСтроки);
		
	КонецЕсли;
	
	Если ИспользоватьСкидкиНаценки Тогда
		РассчитатьСкидкуНаценкуПоДокументу();
		ОбновитьОтображениеСкидкиНаДокумент();
	КонецЕсли;
	
	УстановитьДоступностьОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВозвратТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПоСтатусуИВидуОперации()
	
	УстановитьДоступностьРедактированияТоваров();
	
	СписокКнопок = "Наличные, НаличныеГоризонт, ПлатежнаяКарта, ПлатежнаяКартаГоризонт, СмешаннаяОплата, СмешаннаяОплатаГоризонт";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Истина);
	
	Если Объект.СтатусЧека = Перечисления.СтатусыЧеков.Пробит Тогда
		
		СписокКнопок = "Наличные, НаличныеГоризонт, ПлатежнаяКарта, ПлатежнаяКартаГоризонт, СмешаннаяОплата, СмешаннаяОплатаГоризонт,
						|Отложить, ОтложитьГоризонт, Аннулировать, АннулироватьГоризонт
		|";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Ложь);
		
		УстановитьТолькоПросмотрТоваров();
		
		Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Возврат, ВозвратГоризонт", "Видимость", Ложь);
		КонецЕсли;
		
	ИначеЕсли Объект.СтатусЧека = Перечисления.СтатусыЧеков.Архивный Тогда
		
		СписокКнопок = "Наличные, НаличныеГоризонт, ПлатежнаяКарта, ПлатежнаяКартаГоризонт, СмешаннаяОплата, СмешаннаяОплатаГоризонт,
						|Отложить, ОтложитьГоризонт, Аннулировать, АннулироватьГоризонт,
						|ИзменитьАдрес, ИзменитьАдресГоризонт";
						
		УстановитьТолькоПросмотрТоваров();
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Ложь);
		
		Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Возврат, ВозвратГоризонт", "Видимость", Ложь);
		КонецЕсли;
		
		
	ИначеЕсли Объект.СтатусЧека = Перечисления.СтатусыЧеков.Отложен Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Аннулировать, АннулироватьГоризонт", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Возврат, ВозвратГоризонт, Геолокация, ГеолокацияГоризонт",
			"Видимость", Ложь);
		
	ИначеЕсли Объект.СтатусЧека = Перечисления.СтатусыЧеков.Аннулирован Тогда
		
		УстановитьТолькоПросмотрТоваров();
		
		СписокКнопок = "Наличные, НаличныеГоризонт, ПлатежнаяКарта, ПлатежнаяКартаГоризонт, СмешаннаяОплата, СмешаннаяОплатаГоризонт,
						|Отложить, ОтложитьГоризонт, Аннулировать, АннулироватьГоризонт, Возврат, ВозвратГоризонт,
						|Геолокация, ГеолокацияГоризонт";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Ложь);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.СтатусЧека) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, 
			"Возврат, ВозвратГоризонт, Аннулировать, АннулироватьГоризонт,
			|Геолокация, ГеолокацияГоризонт",
			"Видимость", Ложь);
		
	КонецЕсли;
	
	Если Объект.СтатусОплаты = Перечисления.СтатусыОплатыЧека.Оплачен
		ИЛИ Объект.СтатусОплаты = Перечисления.СтатусыОплатыЧека.ОплаченЧастично Тогда
		
		УстановитьТолькоПросмотрТоваров();
	КонецЕсли;
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.СтатусЧека) ИЛИ Объект.СтатусЧека = Перечисления.СтатусыЧеков.Отложен Тогда
			
			ОплатыЧекаПродажи = Объект.ЧекПродажи.Оплаты;
			
			Если ОплатыЧекаПродажи.Количество() = 1 Тогда
				ТипОплатыЧекаПродажи = ОплатыЧекаПродажи[0].ТипОплаты;
				
				Если ТипОплатыЧекаПродажи = Перечисления.ТипыОплаты.Наличные Тогда
					
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПлатежнаяКарта, СмешаннаяОплата, ПлатежнаяКартаГоризонт, СмешаннаяОплатаГоризонт", "Видимость", Ложь);
				Иначе
					
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
						"Наличные, СмешаннаяОплата, НаличныеГоризонт, СмешаннаяОплатаГоризонт",
						"Видимость",
						Ложь);
						
					УстановитьТолькоПросмотрТоваров();
					
				КонецЕсли;
				
			ИначеЕсли ОплатыЧекаПродажи.Количество() = 2 Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Наличные, ПлатежнаяКарта, НаличныеГоризонт, ПлатежнаяКартаГоризонт", "Видимость", Ложь);
				СмешаннаяОплатаВозврата = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЧекПродажи, ЧекПродажиГоризонт", "Видимость",
		ЗначениеЗаполнено(Объект.ЧекПродажи));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЗаказКлиента, ЗаказКлиентаГоризонт", "Видимость",
		ЗначениеЗаполнено(Объект.ЗаказКлиента));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ФискальныйНомер, ФискальныйНомерГоризонт, НомерСмены, НомерСменыГоризонт", "Видимость",
		ЗначениеЗаполнено(Объект.ФискальныйНомер));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ШтрихкодЧека, ШтрихкодЧекаГоризонт", "Видимость",
		ЗначениеЗаполнено(Объект.ШтрихкодЧека));
	//	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ОткрытьДанныеЕГАИС, ОткрытьДанныеЕГАИСГоризонт", "Видимость",
	//	ЗначениеЗаполнено(Объект.АдресЧекаЕГАИС) ИЛИ ЗначениеЗаполнено(Объект.ПодписьЧекаЕГАИС));
	//
КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотрТоваров()
	
	ТоварыТолькоПросмотр = Истина;
	
	СписокКнопок = "ПодборТоваров, СканированиеШтрихкода, ПодборТоваровГоризонт, СканированиеШтрихкодаГоризонт";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРедактированияТоваров()
	
	ТоварыТолькоПросмотр = Ложь;
	
	СписокКнопок = "ПодборТоваров, СканированиеШтрихкода, ПодборТоваровГоризонт, СканированиеШтрихкодаГоризонт";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"СканированиеШтрихкода, СканированиеШтрихкодаГоризонт",
		"Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров() И НЕ ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьПоСтроке(Знач Строка, ИдентификаторСтроки = Неопределено)
	
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТЧ = Строка;
	КонецЕсли;
	
	ЗаписьПоСтроке = НСтр("ru = '%Количество%%ЕдИзм% Х %Цена%%Скидка% = %Сумма%'");
	
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%", Формат(СтрокаТЧ.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ЕдИзм%",      Строка(СтрокаТЧ.Номенклатура.ЕдиницаИзмерения));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Цена%",       Формат(СтрокаТЧ.Цена, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Сумма%",      Формат(СтрокаТЧ.Сумма, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	
	// Скидка
	СкидкаНаценкаСумма = СтрокаТЧ.СкидкаНаценкаСумма;
	Если ЗначениеЗаполнено(СкидкаНаценкаСумма) Тогда
		
		СкидкаНаценкаПроцент = СтрокаТЧ.СкидкаНаценкаПроцент;
		Если ЗначениеЗаполнено(СкидкаНаценкаПроцент) Тогда
			
			ЗаписьСкидкаНаценка = НСтр("ru = '%Знак% %СкидкаНаценкаСумма% (%Процент%%)'");
			Процент = ?(СкидкаНаценкаПроцент > 0, СкидкаНаценкаПроцент, -СкидкаНаценкаПроцент);

			ЗаписьСкидкаНаценка = СтрЗаменить(ЗаписьСкидкаНаценка, "%Процент%", Формат(Процент, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
		Иначе
			
			ЗаписьСкидкаНаценка = НСтр("ru = '%Знак% %СкидкаНаценкаСумма%'");
		КонецЕсли;
		
		СкидкаСумма = ?(СкидкаНаценкаСумма > 0, СкидкаНаценкаСумма, - СкидкаНаценкаСумма);
		Знак = ?(СкидкаНаценкаСумма > 0, "+", "-");
		
		ЗаписьСкидкаНаценка = СтрЗаменить(ЗаписьСкидкаНаценка, "%Знак%", Знак);
		ЗаписьСкидкаНаценка = СтрЗаменить(ЗаписьСкидкаНаценка, "%СкидкаНаценкаСумма%", Формат(СкидкаСумма, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
		
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Скидка%", " " + ЗаписьСкидкаНаценка);
	Иначе
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Скидка%", "");
	КонецЕсли;
	
	СтрокаТЧ.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;
	
	СтрокаТЧ.СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуВозврат(ИдентификаторСтроки, ДанныеНоменклатуры, Количество, СтрокаБуфера)
	
	Номенклатура = ДанныеНоменклатуры.Номенклатура;
	Цена = СтрокаБуфера.Цена;
	
	СтрокаЧека = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаЧека.Номенклатура = Номенклатура;
	ЗаполнитьЗначенияСвойств(СтрокаЧека, Номенклатура, "СтавкаНДС");
	ЗаполнитьЗначенияСвойств(СтрокаЧека, ДанныеНоменклатуры, "Штрихкод");
	
	//Если ИспользуетсяЕГАИС И ДанныеНоменклатуры.НеобходимостьВводаАкцизнойМарки Тогда
	//	
	//	СтрокаЧека.НеобходимостьВводаАкцизнойМарки = Истина;
	//	
	//	ОбработкаТабличнойЧастиТоварыКлиентСервер.ЗаполнитьКлючСвязи(Объект.Товары, СтрокаЧека, "КлючСвязи");
	//	Количество = ЗаполнитьМаркиПоВСтрокеЧека(СтрокаЧека.КлючСвязи, ДанныеНоменклатуры.АкцизныеМарки);
	//КонецЕсли;
	
	СтрокаЧека.Количество = СтрокаЧека.Количество + Количество;
	
	СтрокаЧека.Цена              = Цена;
	СтрокаЧека.Сумма             = СтрокаЧека.Цена * СтрокаЧека.Количество;
	СтрокаЧека.ЦенаСУчетомСкидки = СтрокаБуфера.ЦенаСУчетомСкидки;
	
	Если НЕ СтрокаБуфера.СкидкаНаценкаСуммаПродажи = 0 Тогда
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Количество",                СтрокаЧека.Количество);
		СтруктураДанных.Вставить("КоличествоПродажи",         СтрокаБуфера.КоличествоПродажи);
		СтруктураДанных.Вставить("Цена",                      Цена);
		СтруктураДанных.Вставить("СкидкаНаценкаСуммаПродажи", СтрокаБуфера.СкидкаНаценкаСуммаПродажи);
		СтруктураДанных.Вставить("СкидкаНаценкаСумма",        0);
		СтруктураДанных.Вставить("Сумма",                     0);
		СтруктураДанных.Вставить("ЦенаСУчетомСкидки",         0);
		
		ОбработкаТабличнойЧастиВызовСервера.ОбработатьСтрокуВозвратаПоПродаже(СтруктураДанных);
		
		ЗаполнитьЗначенияСвойств(СтрокаЧека, СтруктураДанных, "Сумма, СкидкаНаценкаСумма");
		
	КонецЕсли;
	
	//Если ИспользуетсяЕГАИС Тогда
	//	
	//	СтрокаЧека.НеобходимостьШтрихкодаПриПродаже = ПродажиВызовСервера.ОпределитьНеобходимостьШтрихкодаПриПродаже(Номенклатура);
	//	
	//	Если СтрокаЧека.НеобходимостьШтрихкодаПриПродаже И НЕ ЗначениеЗаполнено(СтрокаЧека.Штрихкод) Тогда
	//		
	//		СтрокаЧека.Штрихкод = ПродажиВызовСервера.ПодобратьШтрихкодДляПродажи(Номенклатура);
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	РассчитатьНДССтрокиЧека(СтрокаЧека);
	ОбновитьЗаписьПоСтроке(СтрокаЧека);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНДССтрокиЧека(СтрокаЧека)
	
	Если Объект.ЦенаВключаетНДС Тогда
		ПроцентНДС = ЦенообразованиеКлиентСерверПовтИсп.ПолучитьСтавкуНДСЧислом(СтрокаЧека.СтавкаНДС);
		СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаЧека.Сумма, ПроцентНДС);
	КонецЕсли;
	
	СтрокаЧека.СуммаНДС  = СуммаНДС;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуЧека(ИдентификаторСтроки, ДанныеНоменклатуры, ОчищатьСуществующиеМарки = Истина)
	
	СтрокаЧека = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Номенклатура = ДанныеНоменклатуры.Номенклатура;
	
	СтрокаЧека.Номенклатура = Номенклатура;
	ЗаполнитьЗначенияСвойств(СтрокаЧека, Номенклатура, "СтавкаНДС, Цена");
	
	Если ЗначениеЗаполнено(ДанныеНоменклатуры.Штрихкод) Тогда
		СтрокаЧека.Штрихкод = ДанныеНоменклатуры.Штрихкод;
	КонецЕсли;
	
	Если НЕ ДанныеНоменклатуры.Цена = Неопределено Тогда
		СтрокаЧека.Цена = ДанныеНоменклатуры.Цена;
	КонецЕсли;
	//	
	Если ДанныеНоменклатуры.Количество = Неопределено Тогда
		
		СтрокаЧека.Количество = СтрокаЧека.Количество + 1;
	Иначе
		
		СтрокаЧека.Количество = СтрокаЧека.Количество + ДанныеНоменклатуры.Количество;
	КонецЕсли;
	
	СтрокаЧека.Сумма = СтрокаЧека.Цена * СтрокаЧека.Количество;
	
	РассчитатьНДССтрокиЧека(СтрокаЧека);
	
	ОбновитьЗаписьПоСтроке(СтрокаЧека);
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьЗаписиПоСтрокамТЧ()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ОбновитьЗаписьПоСтроке(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыСтроки()
	
	Если ГоризонтальнаяОриентацияЭкрана Тогда
		ТекущиеДанные = Элементы.ТоварыГоризонт.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипДокумента",  ТипДокумента);
	СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	СтруктураПараметров.Вставить("НомерСтроки",         ТекущиеДанные.НомерСтроки);
	СтруктураПараметров.Вставить("Номенклатура",        ТекущиеДанные.Номенклатура);
	СтруктураПараметров.Вставить("Количество",          ТекущиеДанные.Количество);
	СтруктураПараметров.Вставить("Цена",                ТекущиеДанные.Цена);
	СтруктураПараметров.Вставить("СтавкаНДС",           ТекущиеДанные.СтавкаНДС);
	СтруктураПараметров.Вставить("Сумма",               ТекущиеДанные.Сумма);
	СтруктураПараметров.Вставить("СуммаНДС",            ТекущиеДанные.СуммаНДС);
	СтруктураПараметров.Вставить("Штрихкод",            ТекущиеДанные.Штрихкод);
	СтруктураПараметров.Вставить("СкидкаНаценкаПроцент",ТекущиеДанные.СкидкаНаценкаПроцент);
	СтруктураПараметров.Вставить("СкидкаНаценкаСумма",  ТекущиеДанные.СкидкаНаценкаСумма);
	СтруктураПараметров.Вставить("ЦенаСУчетомСкидки",   ТекущиеДанные.ЦенаСУчетомСкидки);

	СтруктураПараметров.Вставить("ЦенаВключаетНДС",     Объект.ЦенаВключаетНДС);
	СтруктураПараметров.Вставить("ВозвратТоваров",      Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат());
	СтруктураПараметров.Вставить("ЧекПродажи",          Объект.ЧекПродажи);
	СтруктураПараметров.Вставить("Чек",                 Объект.Ссылка);
	
	СтруктураПараметров.Вставить("ТолькоПросмотрФормы", ТолькоПросмотрФормы());
	
	Возврат СтруктураПараметров;
КонецФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"СканированиеШтрихкода, СканированиеШтрихкодаГоризонт", 
		"Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров() И НЕ ИспользуетсяАсинхронныйСканер
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"Геолокация, ГеолокацияГоризонт",
		"Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяГеолокация()
	);
	
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма,
		"ТоварыНоменклатура, ТоварыНоменклатураГоризонт"
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ГруппаСкидкаНаценка, ГруппаСкидкаНаценкаГоризонт",
		"Видимость",
		ИспользоватьСкидкиНаценки
	);
	
	ОбщегоНазначения.УстановитьЖирныйШрифтПолей(ЭтаФорма, "СуммаОплата, СуммаОплатаГоризонт");
	
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПараметровДляПечатиЧека()
	
	СуммаДокумента = СуммаДокументаКОплате();
	ПозицииЧека = Новый Массив();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СуммаДокумента", СуммаДокумента);
	СтруктураПараметров.Вставить("ДанныеОплатыПоПлатежнойКартеЧекаПродажи", ДанныеОплатыПоПлатежнойКартеЧекаПродажи);
	СтруктураПараметров.Вставить("ВидОперации", Объект.ВидОперации);
	СтруктураПараметров.Вставить("ДанныеОплатыПоПлатежнойКарте", ДанныеОплатыПоПлатежнойКарте());
	СтруктураПараметров.Вставить("ВидОплаты", Неопределено);
	СтруктураПараметров.Вставить("ЧекПродажи", Объект.ЧекПродажи);
	
	// Печать
	
	Для Каждого СтрокаТаблицы Из Объект.Товары Цикл
		
		СтрокаТаблицыТоваров = Новый Структура();
		СтрокаТаблицыТоваров.Вставить("ФискальнаяСтрока");
		СтрокаТаблицыТоваров.Вставить("Наименование", Строка(СтрокаТаблицы.Номенклатура));  // 1 - Наименование
		СтрокаТаблицыТоваров.Вставить("Количество"  ,СтрокаТаблицы.Количество);             // 2 - Количество
		СтрокаТаблицыТоваров.Вставить("Цена"        ,СтрокаТаблицы.Цена);                   // 3 - Цена
		СтрокаТаблицыТоваров.Вставить("Сумма"       ,СтрокаТаблицы.Сумма);                  // 4 - Сумма
		СтрокаТаблицыТоваров.Вставить("НомерСекции" ,1);                                    // 5 - НомерСекции
		
		Если Объект.ЦенаВключаетНДС Тогда
			Ставка = ЦенообразованиеКлиентСерверПовтИсп.ПолучитьСтавкуНДСЦелымЧислом(СтрокаТаблицы.СтавкаНДС);
		Иначе
			Ставка = Неопределено;
		КонецЕсли;
		
		СтрокаТаблицыТоваров.Вставить("СтавкаНДС"   ,Ставка);                               // 6 - СтавкаНДС
		
		ПозицииЧека.Добавить(СтрокаТаблицыТоваров);
		
	КонецЦикла;
	
	// Печать штрихкода в теле чека.
	Если ЗначениеНастроекВызовСервераПовтИсп.ПечататьШтрихкодНаЧеке() 
		И ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПечати()) Тогда
		
		ЗаполнитьШтрихкодЧека();
		
		СтрокаПозицииЧека = Новый Структура();
		СтрокаПозицииЧека.Вставить("ТипШтрихкода", "EAN13"); // Одно из значений:"EAN8","EAN13","CODE39","QR".
		СтрокаПозицииЧека.Вставить("ШтрихКод", Объект.ШтрихкодЧека);
		
		ПозицииЧека.Добавить(СтрокаПозицииЧека);
		
	КонецЕсли;
	
	// ПОДГОТОВКА ТАБЛИЦЫ ОПЛАТ
	
	ТаблицаОплат = Новый Массив();
	
	// ПОДГОТОВКА ОБЩИХ ПАРАМЕТРОВ
	
	Объект.Дата = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	Если НЕ ЗначениеЗаполнено(Объект.Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;
	
	// Структура чека
	ОбщиеПараметры = Новый Структура();
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
		
		ТипЧека = ПродажиКлиентСерверПовтИсп.ТипЧека_Продажа();
		
	ИначеЕсли Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ТипЧека = ПродажиКлиентСерверПовтИсп.ТипЧека_ВозвратПродажи();
		
	КонецЕсли;
	
	ОбщиеПараметры.Вставить("ТипЧека"            , ТипЧека);
	ОбщиеПараметры.Вставить("ПозицииЧека"        , ПозицииЧека);
	ОбщиеПараметры.Вставить("ТаблицаОплат"       , ТаблицаОплат);
	ОбщиеПараметры.Вставить("НомерЧека"          , Объект.Номер);
	ОбщиеПараметры.Вставить("НомерСмены"         , ПродажиВызовСервера.ПолучитьНомерСмены());
	
	//ОбщиеПараметры.Вставить("ПараметрыЧекаЕГАИС" , Неопределено);
	//
	//Если ИспользуетсяЕГАИС Тогда
	//	
	//	ОбщиеПараметры.ПараметрыЧекаЕГАИС = ПодготовитьДанныеДляПодписиЧека();
	//	
	//КонецЕсли;
	
	СтруктураПараметров.Вставить("ОбщиеПараметры", ОбщиеПараметры);
	
	Возврат СтруктураПараметров;
	
КонецФункции

//&НаСервере
//Функция ПодготовитьДанныеДляПодписиЧека()
//	
//	//Возврат ИнтеграцияЕГАИСМК.ПодготовитьВходящиеДанныеДляПодписиЧека(Объект);
//	
//КонецФункции

&НаСервере
Процедура ПроверитьСмешаннуюОплатуВозврата(ПараметрыОплаты, Отказ)
	
	Если НЕ СмешаннаяОплатаВозврата Тогда
		Возврат;
	КонецЕсли;
	
	ОплатыЧекаПродажи = Объект.ЧекПродажи.Оплаты;
	
	Наличные = 0;
	Безналичные = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекОплаты.ТипОплаты,
		|	ЧекОплаты.Сумма
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	Документ.Чек.Оплаты КАК ЧекОплаты
		|ГДЕ
		|	ЧекОплаты.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекОплаты.ТипОплаты,
		|	-ЧекОплаты.Сумма
		|ИЗ
		|	Документ.Чек.Оплаты КАК ЧекОплаты
		|ГДЕ
		|	ЧекОплаты.Ссылка.ЧекПродажи = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплаты.ТипОплаты КАК ТипОплаты,
		|	СУММА(Оплаты.Сумма) КАК Сумма
		|ИЗ
		|	Оплаты КАК Оплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплаты.ТипОплаты";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ЧекПродажи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипОплаты = Перечисления.ТипыОплаты.Наличные Тогда
			Наличные = Выборка.Сумма;
		Иначе
			Безналичные = Выборка.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыОплаты.СуммаДокумента >= Безналичные Тогда
		
		Если ПараметрыОплаты.СуммаДокумента > Наличные Тогда
			ПараметрыОплаты.Вставить("Безналичные", Безналичные);
		Иначе
			ПараметрыОплаты.Вставить("АльтернативнаяОплата", Истина);
			ПараметрыОплаты.Вставить("Безналичные", Безналичные);
		КонецЕсли;
	Иначе
		
		Если ПараметрыОплаты.СуммаДокумента > Наличные Тогда
			
			ТекстСообщение = НСтр("ru = 'Не хватает суммы наличных для возврата.
			|Оплата картой отменяется только полностью.'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщение);
			Отказ = Истина;
			
		Иначе
			ПараметрыОплаты.Вставить("Безналичные", 0);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СуммаДокументаКОплате()
	
	СуммаКОплате = Объект.Товары.Итог("Сумма");
	
	Возврат СуммаКОплате;
	
КонецФункции

&НаСервере
Процедура УстановитьНовыйНомер()
	
	ЧекОбъект = РеквизитФормыВЗначение("Объект");
	ЧекОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ЧекОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьДанныеОплатыПоПлатежнойКартеЧекаПродажи()
	
	ДанныеОплатыПоПлатежнойКартеЧекаПродажи = Документы.Чек.ДанныеОплатыПоПлатежнойКарте(Объект.ЧекПродажи);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьОплаты()
	
	ПараметрыПоиска = Новый Структура("Сумма", 0);
	СтрокиСНулевойСуммой = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
	ЕстьСтрокиСНулевойСуммой = НЕ СтрокиСНулевойСуммой.Количество() = 0;
	
	ПараметрыПоиска = Новый Структура("НеобходимостьШтрихкодаПриПродаже, Штрихкод", Истина, "");
	СтрокиБезШтрихкода = Объект.Товары.НайтиСтроки(ПараметрыПоиска);
	ЕстьСтрокиБезШтрихкода = НЕ СтрокиБезШтрихкода.Количество() = 0;
	
	СписокКоманд = "Наличные, ПлатежнаяКарта, СмешаннаяОплата, НаличныеГоризонт, ПлатежнаяКартаГоризонт, СмешаннаяОплатаГоризонт";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКоманд, "Доступность", СуммаДокументаКОплате() > 0 И НЕ ЕстьСтрокиСНулевойСуммой И НЕ ЕстьСтрокиБезШтрихкода);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокЧека()
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Продажа'");
		
	ИначеЕсли Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Возврат'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеОперацийПлатежнойСистемы()
	
	КоличествоОпераций = Объект.ОперацииПлатежнойСистемы.Количество();
	
	Если НЕ КоличествоОпераций = 0 Тогда
		
		ЗаголовокСсылки = НСтр("ru = 'Операции платежной системы (%КоличествоОпераций%)'");
		ЗаголовокСсылки = СтрЗаменить(ЗаголовокСсылки, "%КоличествоОпераций%", КоличествоОпераций);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"ОткрытьОперацииПлатежнойСистемы, ОткрытьОперацииПлатежнойСистемыГоризонт", "Заголовок",
			ЗаголовокСсылки
		);
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ОткрытьОперацииПлатежнойСистемы, ОткрытьОперацииПлатежнойСистемыГоризонт", "Видимость",
		НЕ КоличествоОпераций = 0
	);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьГруппуОплаты()
	
	Если Объект.ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"ГруппаПринятьОплату, ГруппаПринятьОплатуГоризонт", "Заголовок",
			НСтр("ru = 'Принять оплату'")
		);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"ГруппаПринятьОплату, ГруппаПринятьОплатуГоризонт", "Заголовок",
			НСтр("ru = 'Вернуть оплату'")
		);
		
	КонецЕсли;
	
КонецПроцедуры

#Область ВозвратТоваров

&НаКлиенте
Процедура ВозвратЧекаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ПолныйВозврат" Тогда
		
		СформироватьПолныйВозврат();
		
	ИначеЕсли Результат = "ЧастичныйВозврат" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Режим", "ПодборВВозврат");
		ПараметрыФормы.Вставить("ЧекПродажи", Объект.Ссылка);
		ПараметрыФормы.Вставить("ЧекВозврата", Неопределено);
		ПараметрыФормы.Вставить("КонтрольДублейМарок", Ложь);
		
		Оповещение = Новый ОписаниеОповещения("ОповещениеПодборВВозврат", ЭтотОбъект);
		
		ОткрытьФорму("Обработка.ПодборТоваров.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Результат = "СканированиеШтрихкода" Тогда
		
		Если ИспользуетсяАсинхронныйСканер Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("СозданиеПослеСканирования", Истина);
			ПараметрыФормы.Вставить("МассивНоменклатуры", Новый Массив);
			ПараметрыФормы.Вставить("ВозвратТоваров", Истина);
			ПараметрыФормы.Вставить("ЧекПродажи", Объект.Ссылка);
			ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
			
			ОткрытьФорму("Документ.Чек.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
			
		Иначе
			ИдетПроцессСканирования = Истина;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
			ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
			ДополнительныеПараметры.Вставить("ВозвратТоваров", Истина);
			ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
			ДополнительныеПараметры.Вставить("КонтрольДублейМарок", Ложь);
			
			ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуЧекаВозврат(ИдентификаторСтроки, ДанныеНоменклатуры, ОчищатьСуществующиеМарки = Истина)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Номенклатура", ДанныеНоменклатуры.Номенклатура);
	
	Если Не ДанныеНоменклатуры.Цена = Неопределено Тогда
		
		ПараметрыПоиска.Вставить("ЦенаСУчетомСкидки", ДанныеНоменклатуры.Цена);
	КонецЕсли;
	
	НайденныеСтрокиБуфер = БуферВозвратаТоваров.НайтиСтроки(ПараметрыПоиска);
	
	Количество = ?(ДанныеНоменклатуры.Количество = Неопределено, 1, ДанныеНоменклатуры.Количество);
	
	Для Каждого СтрокаБуфера Из НайденныеСтрокиБуфер Цикл
		
		Если Количество <=0 Тогда
			Прервать;
		КонецЕсли;
		
		РазрешеноДобавить = СтрокаБуфера.Количество - СтрокаБуфера.КоличествоВозврат;
		
		Если НЕ РазрешеноДобавить > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоДобавления = Мин(Количество, РазрешеноДобавить);
		
		ОбработатьСтрокуВозврат(ИдентификаторСтроки, ДанныеНоменклатуры, КоличествоДобавления, СтрокаБуфера);
		Количество = Количество - КоличествоДобавления;
		
		СтрокаБуфера.КоличествоВозврат = СтрокаБуфера.КоличествоВозврат + КоличествоДобавления;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОплатаТолькоБезналичными()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекОплаты.Ссылка
		|ИЗ
		|	Документ.Чек.Оплаты КАК ЧекОплаты
		|ГДЕ
		|	ЧекОплаты.Ссылка = &Ссылка
		|	И ЧекОплаты.ТипОплаты = &ТипОплаты";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТипОплаты", Перечисления.ТипыОплаты.Наличные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура СформироватьПолныйВозврат()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	
	ОповещениеВозврат = Новый ОписаниеОповещения("ОповещениеВозвратТоваров", ЭтотОбъект);
	ОткрытьФорму("Документ.Чек.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,, ОповещениеВозврат, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПодборВВозврат(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СозданиеИзПодбора", Истина);
		ПараметрыФормы.Вставить("АдресВоВременномХранилище", Результат.АдресВоВременномХранилище);
		ПараметрыФормы.Вставить("ВозвратТоваров", Истина);
		ПараметрыФормы.Вставить("ЧекПродажи", Объект.Ссылка);
		ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
		
		ОткрытьФорму("Документ.Чек.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБуферВозвратаТоваров()
	
	БуферВозвратаТоваров.Очистить();
	
	ТаблицаТоваровДляВозврата = Продажи.ПолучитьТаблицуТоваровЧекаВозврата(Объект.ЧекПродажи,, Объект.Ссылка);
	
	Для Каждого СтрокаТаблицы Из ТаблицаТоваровДляВозврата Цикл
		
		СтрокаБуфера = БуферВозвратаТоваров.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаБуфера, СтрокаТаблицы);
		
		Если СтрокаТаблицы.ЕстьСкидка Тогда
			
			СтрокаБуфера.ЦенаСУчетомСкидки = ?(СтрокаТаблицы.Количество = 0, 0, Окр(СтрокаТаблицы.Сумма/СтрокаТаблицы.Количество, 2));
		Иначе
			
			СтрокаБуфера.ЦенаСУчетомСкидки = СтрокаТаблицы.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьБуферВозвратов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьБуферВозвратов()
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		
		ОбновитьСтрокуБуфера(СтрокаТоваров);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтрокуБуфера(СтруктураСтроки)
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Номенклатура", СтруктураСтроки.Номенклатура);
	ПараметрыПоиска.Вставить("Цена",         СтруктураСтроки.Цена);
	
	НайденныеСтроки = БуферВозвратаТоваров.НайтиСтроки(ПараметрыПоиска);
	
	Если НЕ НайденныеСтроки.Количество() = 0 Тогда
		
		СтрокаБуфера = НайденныеСтроки[0];
		СтрокаБуфера.КоличествоВозврат = СтруктураСтроки.Количество;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПоместитьТоварыВоВременноеХранилище()
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Объект.Товары.Выгрузить(), УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьШтрихкодЧека()
	
	Если ЗначениеЗаполнено(Объект.ШтрихкодЧека) Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксШтрихкода = ПродажиКлиентСерверПовтИсп.ПрефиксШтрихкодаЧека(); //диапазон купонов
	
	Генератор = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = Генератор.СлучайноеЧисло(1000000000, 4294967295);
	
	ИдентификаторЧека = Строка(Формат(СлучайноеЧисло, "ЧГ=0"));
	
	КонтрольныйСимволEAN13 = ПодключаемоеОборудованиеКлиент.КонтрольныйСимволEAN13(ПрефиксШтрихкода + ИдентификаторЧека);
	
	Объект.ШтрихкодЧека = ПрефиксШтрихкода + ИдентификаторЧека + КонтрольныйСимволEAN13;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если НЕ СтрокаТоваров = Неопределено Тогда
		НомерСтрокиДляПодсветки = СтрокаТоваров.НомерСтроки;
		Элементы.Товары.ТекущаяСтрока = ИдентификаторСтроки;
		
		Если НЕ ГоризонтальнаяОриентацияЭкрана Тогда
			
			Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;
			
		КонецЕсли;
		
		ИнтервалСек = 1;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры

#Область Геолокация

&НаКлиенте
Функция ОпределитьКоординатыПробития()
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяГеолокация() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДанныеМестоположения = Неопределено;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ДанныеМестоположения = ГеолокацияКлиент.ПолучитьМестоположение();
		
	#КонецЕсли
	
	Если НЕ ДанныеМестоположения = Неопределено Тогда
		
		ГеоКоординаты = ГеолокацияКлиент.ПолучитьКоординатыПоМестоположению(ДанныеМестоположения);
		
		Объект.КоординатыДолгота = ГеоКоординаты.Долгота;
		Объект.КоординатыШирота  = ГеоКоординаты.Широта;
		
		Объект.ПредставлениеАдресаМестоположения = ГеолокацияКлиент.ПолучитьПредставлениеАдресаМестоположения(, Объект.КоординатыШирота, Объект.КоординатыДолгота);
		
		ЗаписатьЧек();
		Возврат Истина;
		
	Иначе
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ВвестиАдрес", НСтр("ru = 'Ввести адрес вручную'"));
		Кнопки.Добавить("Закрыть", НСтр("ru = 'Закрыть'"));
		
		Оповещение = Новый ОписаниеОповещения("ВопросВвестиАдрес", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Местоположение не определено'"), Кнопки,, "ВвестиАдрес");
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВопросВвестиАдрес(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = "ВвестиАдрес" Тогда
		ЭтаФорма.Закрыть(КодВозвратаДиалога.ОК);
		Возврат;
	КонецЕсли;
	
	ОткрытьДиалогВводаАдреса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВводаАдреса(ПробитиеЧека = Истина)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьФорму", ПробитиеЧека);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВводаАдресаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	Подсказка = НСтр("ru = 'Адрес пробития чека'");
	
	ДлинаАдреса = 200;
	ПоказатьВводСтроки(ОписаниеОповещенияОЗавершении, Объект.ПредставлениеАдресаМестоположения, Подсказка, ДлинаАдреса);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводаАдресаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Если НЕ Объект.ПредставлениеАдресаМестоположения = Результат Тогда
			
			Объект.ПредставлениеАдресаМестоположения = Результат;
			
			СформироватьПредставлениеКоординат();
			ЗаписатьЧек();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ЗакрытьФорму Тогда
		
		ЭтаФорма.Закрыть(КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПредставлениеКоординат()
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяГеолокация() Тогда
		Возврат;
	КонецЕсли;
	
	// доступность команд
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ОпределитьАдрес, ОпределитьАдресГоризонт", "Видимость", 
		НЕ ЗначениеЗаполнено(Объект.ПредставлениеАдресаМестоположения)
		И (ЗначениеЗаполнено(Объект.КоординатыШирота) И ЗначениеЗаполнено(Объект.КоординатыДолгота)));
	
	// доступность команд
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ИзменитьАдрес, ИзменитьАдресГоризонт", "Доступность",
		Объект.СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусыЧеков.Пробит"));
	
	Местоположение = "";
	
	Если ЗначениеЗаполнено(Объект.ПредставлениеАдресаМестоположения) Тогда
		
		Местоположение = Объект.ПредставлениеАдресаМестоположения;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.КоординатыШирота) И ЗначениеЗаполнено(Объект.КоординатыДолгота) Тогда
		
		Местоположение = ГеолокацияКлиент.ПолучитьПредставлениеКоординатМестоположения(, 
			Объект.КоординатыШирота, Объект.КоординатыДолгота);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
	ГоризонтальнаяОриентацияЭкрана = ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана;
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
		Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаГоризонтальная;
	Иначе
		Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаВертикальная;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти








