
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеПараметрыСинхронизации");
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "ПодсказкаСообщениеПараметрыСинхронизации");
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	ОбновитьИнформациюОВыгрузке();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		ОбновитьИнформациюОВыгрузке();
		
	ИначеЕсли ИмяСобытия = "ИзмененОтчетОПродажах" Тогда
		
		ОбновитьИнформациюОВыгрузке();
		
	ИначеЕсли ИмяСобытия = "ВыполненОбмен" Тогда
		
		ОбновитьИнформациюОВыгрузке();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРезервнуюКопию(Команда)
	
	РезервноеКопированиеКлиент.СоздатьРезервнуюКопию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьИзРезервнойКопии(Команда)
	
	РезервноеКопированиеКлиент.ВосстановитьИзРезервнойКопии();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Загрузка");
	ОткрытьФорму("Обработка.Сервис.Форма.Синхронизация", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Выгрузка");
	ОткрытьФорму("Обработка.Сервис.Форма.Синхронизация", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
	
	ОткрытьФорму("Обработка.Сервис.Форма.ИмпортПрайсЛиста",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокУдаленныхОбъектов(Команда)
	
	ОткрытьФорму("Обработка.Сервис.Форма.МусорнаяКорзина",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетокЦенников(Команда)
	
	ОткрытьФорму("Обработка.Сервис.Форма.ПечатьЭтикетокЦенников",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалениеДанных(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОчисткиДанных", ЭтотОбъект);
	ОткрытьФорму("Обработка.Сервис.Форма.УдалениеДанных",, ЭтаФорма,,,, ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СообщениеПараметрыСинхронизацииНажатие(Элемент)
	
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыСинхронизации", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОВыгрузкеДанныхНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.Сервис.Форма.ИнформацияОВыгрузке", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОчисткиДанных(Результат, ДополнительныеПараметры) Экспорт
	
	УдаленыНастройки = Ложь;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("УдаленыНастройки") Тогда
		УдаленыНастройки = Результат.УдаленыНастройки;
	КонецЕсли;
	
	Если УдаленыНастройки Тогда
		ОбщегоНазначенияКлиент.ПередНачаломРаботыСистемы(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеКомандРезервногоКопирования()
	
	РезервныеКопииНаУстройстве = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("РезервныеКопииНаУстройстве");
	РезервныеКопииГлобал = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("РезервныеКопииГлобал");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СоздатьРезервнуюКопию,ВосстановитьИзРезервнойКопии" , "Доступность",
																РезервныеКопииНаУстройстве ИЛИ РезервныеКопииГлобал);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	НастроитьОтображениеКомандРезервногоКопирования();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСообщениеПараметрыСинхронизации", "Видимость", 
		НЕ ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыСинхронизации());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСинхронизация", "Видимость", 
		ЗначениеЗаполнено(ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("РежимСинхронизацииДанных")) 
		И НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЗагрузитьДанные, ВыгрузитьДанные, ГруппаИнфоОВыгрузке", "Видимость", 
		ЗначениеНастроекВызовСервераПовтИсп.ЗаполненыПараметрыСинхронизации());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИмпорт", "Видимость",
		ЗначениеЗаполнено(ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("РежимСинхронизацииДанных")) 
		И ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечатьЭтикетокЦенников", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ПечататьЭтикеткиЦенники());
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОВыгрузке()
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
		
		ОтчетыКВыгрузке = Документы.ОтчетОРозничныхПродажах.ОтчетыОПродажахКВыгрузке();
		
		Шаблон = НСтр("ru = 'Отчеты о продажах: %КоличествоОтчетов%'");
		ТекстИнформации = СтрЗаменить(Шаблон, "%КоличествоОтчетов%", ОтчетыКВыгрузке.Количество());
		
		ИнформацияОВыгрузкеДанных = ТекстИнформации;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры


#КонецОбласти

