&НаКлиенте
Перем ВыполняетсяЗакрытие;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	
	ПустойРК = Истина;
	Если Параметры.Свойство("Global_ID") Тогда
		ПустойРК = Ложь; 
		Global_ID = Параметры.Global_ID;
		сч_скан   = Параметры.сч_скан; 
		сч_док    = Параметры.сч_док;
		ТД        = Параметры.ТД;
		Для Каждого ПКГ Из   Параметры.PKG  Цикл 
			 НоваяСтрокаПКГ =  ТаблицаPKG.Добавить();
			 ЗаполнитьЗначенияСвойств(НоваяСтрокаПКГ,ПКГ);
		КонецЦикла;
		
	КонецЕсли;  
	Если Параметры.Свойство("RK_ID") Тогда
		RK_ID     = Параметры.RK_ID;
		РК_Инф     = Параметры.РК_Инф;
	КонецЕсли;  
	Для Каждого АдресТТ Из Параметры.АдресаДоставки Цикл 
		НовАдрес = АдресаДоставки.Добавить(); 
		ЗаполнитьЗначенияСвойств(НовАдрес,АдресТТ);
	КонецЦикла;
	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Декорация4", "Видимость",НЕ ПустойРК И сч_скан = сч_док);
	
	ОбработкаФормыСервер.ПриСозданииНаСервере(ЭтотОбъект,Отказ,СтандартнаяОбработка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Декорация3", "Видимость",НЕ ПустойРК И сч_док<>сч_скан);
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТД,ГруппаPKG", "Видимость",НЕ ПустойРК);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерваяПривязка", "Видимость",ПустойРК);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполняетсяЗакрытие = Ложь;  
	ОбработкаФормыКлиент.ПриОткрытии(ЭтотОбъект,Отказ);

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ВыполняетсяЗакрытие Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити RK?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры 

 &НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;     
		
		Закрыть(Новый Структура("Global_ID,сч_скан,PKG",Global_ID,сч_скан,ТаблицаPKG));
	КонецЕсли;
	
	
КонецПроцедуры  


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЧислоВхождений(ПолученныйШтрихкод,";")=2 Тогда
		МассивСтрок = СтрРазделить(ПолученныйШтрихкод,";");
		ИД_PKG = МассивСтрок[0];
		Рез = РазместитьПКГ_На_РК(ИД_PKG);
		Если Не Рез.Результат Тогда
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры


  &НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры 



 &НаСервере
Функция РазместитьПКГ_На_РК(ШК_ПКГ)


	текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/PKGaddRK?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&pkgchk="+ШК_ПКГ+"&rkchk="+RK_ID;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	УстановитьВидимость = Ложь;
	Если ПустойРК Тогда
		УстановитьВидимость = Истина;  
	КонецЕсли;	
		
	Если РезОтвет.Результат Тогда  
		ПустойРК = Ложь;
		Для Каждого ПКГ Из РезОтвет.Ответ.МассивPKG Цикл 
			  МассивСтрок =  ТаблицаPKG.НайтиСтроки(Новый Структура("ИД_PKG",ПКГ.ИД_PKG)); 
			  Если МассивСтрок.Количество() = 0 Тогда
				  НовСтрока = ТаблицаPKG.Добавить();
				  ЗаполнитьЗначенияСвойств(НовСтрока,ПКГ);
			  КонецЕсли;                              
		КонецЦикла;
		Global_ID = РезОтвет.Ответ.Global_ID;
		ТД = РезОтвет.Ответ.ТД;

		сч_скан = РезОтвет.Ответ.Размещено;
		
		сч_док = АдресаДоставки.НайтиСтроки(Новый Структура("ТЧ_Global_ID",Global_ID))[0].сч_док;
		
		
		Если сч_скан = сч_док Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Декорация4", "Видимость",Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Декорация3", "Видимость",Ложь);

		КонецЕсли;
		Если УстановитьВидимость Тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТД,ГруппаPKG", "Видимость",Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерваяПривязка", "Видимость",Ложь)  
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат РезОтвет; 
	
КонецФункции

&НаКлиенте
Процедура ТаблицаPKGВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаPKGПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаPKGПередНачаломИзменения(Элемент, Отказ)
	Отказ=Истина;
	ТаблицаPKGВыбор(Элемент,,,);
КонецПроцедуры

&НаКлиенте
Процедура ТДНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",СформироватьСтруктуруДляПечатиНаСервере(),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаСервере
Функция СформироватьСтруктуруДляПечатиНаСервере()
	
	
	//текстЗапроса = "/Logistika/"+ПараметрыСеанса.UUID+"/PKGaddRK?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&pkgchk="+ШК_ПКГ+"&rkchk="+RK_ID;
	//
	//РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);

	
	СтруктураСтрок = Новый Структура;
	СтруктураСтрок.Вставить("PKG");
	СтруктураСтрок.Вставить("ТочкаДоставки",ТД);
	МассивPKG = Новый Массив;
	СтруктураСтрок.Вставить("ДанныеPKG",МассивPKG);
	
	Возврат СтруктураСтрок;
	
КонецФункции

