&НаКлиенте
Перем ВыполняетсяЗакрытие;

//&НаКлиентеНаСервере
//Перем	Лог; 
//   
   
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 		
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Параметры.Свойство("ТипДокумента",ТипДокумента);
	ИнициализироватьКонстантыФормы();
	ОбновитьПодразделение();
	ОбновитьСотрудника();	

	
	
	НастроитьФормуПоЗначениямНастроек();
  	ИД_Лог = Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(),"ЧГ=");

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ВыполняетсяЗакрытие = Ложь;
	
	
	#Если МобильноеПриложениеКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость", Ложь);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДокументUUID) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		//Если ЗначениеЗаполнено(ДокументUUID) Тогда
		//	ОтменитьОтборРезерваПередЗакрытием();	
		//Иначе	
			ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити комплектувальника?",РежимДиалогаВопрос.ДаНет);
		//КонецЕсли;	
КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Функция ВсегоТекВведеноУпаковщик(АртикулУпаковка = Ложь,ТолькоУпаковка = Ложь)
	
	
	Если АртикулУпаковка Тогда  
		оСтруктураУп = 	Новый Структура("Артикул,Характеристика,КоробкаНомер",ТекАртикул,ТекХарактеристика,КоробкаНомер);
	ИначеЕсли ТолькоУпаковка Тогда	
		оСтруктураУп = 	Новый Структура("КоробкаНомер",КоробкаНомер);
	Иначе     
		оСтруктураУп = 	Новый Структура("Артикул,Характеристика",ТекАртикул,ТекХарактеристика);
	КонецЕсли;
	
	
	нСтрокиУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(оСтруктураУп); 
	КолУпаковано = 0;
	Для Каждого стрУпаковщик Из нСтрокиУпаковщик Цикл 
		КолУпаковано = КолУпаковано +стрУпаковщик.КоличествоВведено;	
	КонецЦикла; 
	Возврат КолУпаковано;	
КонецФункции

&НаКлиенте
Функция ТоваровВУпаковке(ВыбКорокаНомер)
	нСтрокиУпаковщик =  ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("КоробкаНомер",ВыбКорокаНомер));
	Возврат нСтрокиУпаковщик.Количество();	
КонецФункции


&НаКлиенте
Асинх Процедура ОтменитьОтборРезерваПередЗакрытием()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Скасувати відбір резерву?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	ОтменитьСборкуРезерва();
	ВыполняетсяЗакрытие = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры



&НаСервере
Процедура ИнициализироватьКонстантыФормы()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);
    ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник); 
	
	СисИнфо = Новый СистемнаяИнформация;
   	Элементы.ИД_Устройства.Заголовок = Строка(СисИнфо.ИдентификаторКлиента);
	
КонецПроцедуры
 
&НаСервере
Процедура ОбновитьПодразделение()
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
		
	Иначе

		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;
		
	КонецЕсли;
	
	ОпределитьДоступностьКнопкиСканирования();
	
КонецПроцедуры

 &НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
	КонецЕсли;
	   
	УстановитьДоступностьПоНастройкам();
	Если ПользовательИнициализирован И Инициализирован И ТипДокумента <> "КомплектовщикОтбор" Тогда
		ОбновитьКоличестворезервовНаСервере(КоличествоРезервов);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент", "Видимость", Ложь);

КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	Если ТипДокумента = "КомплектовщикОтбор" Тогда
		ЭтаФорма.Заголовок = "Компл. відбір"; 
		ИдетПроцессСканированияТелеги = Истина;  
	КонецЕсли;
	
	
	ОпределитьДоступностьКнопкиСканирования();
	
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПоНастройкам()

	ОпределитьДоступностьКнопкиСканирования();

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечЭтикетка","Видимость",Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность", Инициализирован И ПользовательИнициализирован);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаСборку,ТекМестоХранение", "Видимость", Инициализирован И ПользовательИнициализирован И ТипДокумента <> "КомплектовщикОтбор");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаКомплект,ТекТележкаНомер", "Видимость", Инициализирован И ПользовательИнициализирован И ТипДокумента = "КомплектовщикОтбор");
	
КонецПроцедуры


&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
		(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован
		);   
 
	
КонецПроцедуры   











&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

 &НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
КонецПроцедуры




&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры 

 &НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);  
		
		
		
		//Иначе	
			ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		//КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);

		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необхідна авторизація користувача");
		КонецЕсли;
		
		Возврат; 
	ИначеЕсли ИдетПроцессСканированияТелеги Тогда
		ОбработатьШтрихкодТелеги(ПолученныйШтрихкод, Параметры); 
		Возврат;
	
	ИначеЕсли ПустаяСтрока(ДокументUUID) Тогда 
		Сообщить("Резерв не вибраний");
         Возврат;	  
	ИначеЕсли ИдетПроцессСканированияПринтера Тогда
	    Возврат;
	КонецЕсли;
	//
	Если ИД_Статус <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если КомплектовщикУпаковщик И НЕ КоробкаОткрыта Тогда
		Возврат;
	КонецЕсли;
	
		
	
	
	тквВведено = ТекКоличествоВведеноКоробка;
	//тквВведено = ?(ТекВесовой = 0,ТекКоличествоВведено,ТекКоличествоВведеноВес);	
	Если тквВведено >= ТекКоличество Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Кількість відібрано, перейдіть до наступного");	
		Возврат;
	КонецЕсли;
	
	нСтркиШтрихКод = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("ШтрихКод",ПолученныйШтрихкод));
	
	Если ТекПроизводитель <> 0 И (ТекидУпаковка  = 2 Или ТекидУпаковка  = 3) Тогда //ФМ/БАТ Блоки,Ящики, 
		
		ЭтоИсключение = Ложь;
		Если нСтркиШтрихКод.Количество() > 0 И нСтркиШтрихКод[0].Артикул = ТекАртикул Тогда
			ЭтоИсключение = ПроверитьИсключение(ТекАртикул);	
		КонецЕсли;
		Если НЕ ЭтоИсключение Тогда
			ОбработатьШтрихКодФМ_БАТ(ПолученныйШтрихкод,Параметры);	
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ПоМаскеШтрихКода = Ложь;	
	Если нСтркиШтрихКод.Количество()= 0 Тогда
		СтрШтрихКод = Новый Структура;
		СтрШтрихКод.Вставить("Штрихкод",ПолученныйШтрихкод);
		//СтрШтрихКод.Вставить("ТипШтрихКода",ТипШтрихКода);
		СтрШтрихКод.Вставить("Количество",1); 
		СтрШтрихКод.Вставить("Коэффициент",1);
		СтрШтрихКод.Вставить("КодВесовогоТовара","");
		СтрШтрихКод.Вставить("ПрефиксВесовогоТовара","");   
		ОбработатьВесовойШтрихкод(СтрШтрихКод);    
		Если ПустаяСтрока(СтрШтрихКод.КодВесовогоТовара) Тогда
			Сообщить("У документі немає товару з цим штрихкодом - "+ПолученныйШтрихкод);
			Возврат;   
		Иначе  
			
			Если НЕ СтрШтрихКод.КодВесовогоТовара = ТекАртикул Тогда
				Сообщить("Ваговий артикул не належить товару - "+ТекНаименованиеТовара);
               	Возврат;
			КонецЕсли;
			
			ПоМаскеШтрихКода = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	Если НЕ ПоМаскеШтрихКода  Тогда
		СтрШтрихКод = нСтркиШтрихКод[0]; 
		Если НЕ СтрШтрихКод.Артикул = ТекАртикул Тогда
			Сообщить("Штрихкод не належить товару - "+ТекНаименованиеТовара);
			Возврат;
		КонецЕсли;  
	КонецЕсли; 

	Если ТекШтрихКодОтсканирован = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", Ложь );
		ТаблицаТовары[СтрокаТовараТекущая-1].ШтрихКодОтсканирован = Истина;	 
		
	КонецЕсли;
	

	ТекШтрихКодОтсканирован = Истина;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено,ТекКоличествоВведеноВес,ДобавитьКолВо", "Доступность", ТекКоличество>=25);

	 Если ТекКоэффициент = СтрШтрихКод.Коэффициент Тогда
		 новКоличество = ?(ПоМаскеШтрихКода,СтрШтрихКод.Количество,1); 
  
	 Иначе
		 новКоличество = СтрШтрихКод.Коэффициент/?(ТекКоэффициент=0,1,ТекКоэффициент); 
	 КонецЕсли;
	 
	 Если ТекВесовой = 0 И новКоличество < 1 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не можна додати "+новКоличество + " відскануйте штрихкод "+ТекУпаковка+Символы.ПС+"Додайте кількість в ручну");	
		Возврат; 
	 КонецЕсли;
	 
	 Если ТекВесовой и ТекКоличествоВведеноКоробка + новКоличество > КомплектовщикТК_Клиент.ДопускВесовойТовар(ТекВесовой,ТекКоличество) Тогда  
		 ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не можна додати "+новКоличество+Символы.ПС+"Доступно - "+Формат(КомплектовщикТК_Клиент.ДопускВесовойТовар(ТекВесовой,ТекКоличество) -ТекКоличествоВведеноКоробка,"ЧЦ=8; ЧДЦ=3"));	
		 Возврат; 
		 
	 КонецЕсли;
	 
		 
		 
	 
	 Если ТекиспХарактеристика = 1  Тогда 
		 ВыбратьМРЦ_Асинх(ТекХарактеристика,ПолученныйШтрихкод,СтрШтрихКод.Коэффициент); 
	 Иначе	
		 Если ТекВесовой = 1 Тогда
			 ТекКоличествоВведеноВес = ТекКоличествоВведеноВес + новКоличество ;
		 Иначе
			 ТекКоличествоВведено = ТекКоличествоВведено + новКоличество;
		 КонецЕсли; 
		 
		мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,КоробкаНомер",ТекАртикул,КоробкаНомер));
		Если мУпаковщик.Количество() Тогда 
			смУпаковка = мУпаковщик[0];
		Иначе
			смУпаковка = ТаблицаТоварыУпаковщик.Добавить();  
			смУпаковка.Артикул = ТекАртикул; 
			смУпаковка.КоробкаНомер = КоробкаНомер;
			
		КонецЕсли;
		
		смУпаковка.КоличествоВведено = ?(ТекВесовой=1,ТекКоличествоВведеноВес,ТекКоличествоВведено);  
		смУпаковка.Коэффициент = ТекКоэффициент;

		ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик(); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость",  ТекКоличествоВведеноКоробка = ТекКоличество ); 

	 КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодТелеги(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;

	Результат = ПроверитьТележку(ПолученныйШтрихкод);
	Если ПустаяСтрока(Результат.ТекстОшибки) И Результат.ТележкаРабочий Тогда
		
		РезультатРезервыКомплект = ПолучитьРезервТележки(ПолученныйШтрихкод);		
		
		Если  РезультатРезервыКомплект.Результат = Ложь Тогда
			Если Не ПустаяСтрока(РезультатРезервыКомплект.ОписаниеОшибки) Тогда
				Сообщить(РезультатРезервыКомплект.ОписаниеОшибки);
			Иначе
				Сообщить("Помилка отримання резервів!");	  
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		ОбработатьСтрукуруРезерваНаСервере(РезультатРезервыКомплект);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаКомплект", "Видимость",  Ложь );
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаТовара", "Видимость",  Истина );
	Иначе
		Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
			Сообщить(Результат.ТекстОшибки);
		Иначе
			Сообщить("Не удалось отсканировать тележку!");
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры


#Область Ввод_МРЦ
&НаКлиенте
Процедура ОбработатьШтрихКодФМ_БАТ(ПолученныйШтрихКод,Параметры)
	
	ЭтоШККороба 	= СтрДлина(ПолученныйШтрихкод) > 60 И Лев(ПолученныйШтрихкод, 3) = "010";
	ЭтоШКБлока 	= Не ЭтоШККороба И ((СтрДлина(ПолученныйШтрихкод) > 16 И (Лев(ПолученныйШтрихкод, 3) = "010" ИЛИ Лев(ПолученныйШтрихкод, 3) = "343")));	//тут
	
	Если ЭтоШККороба = Ложь И ЭтоШКБлока = Ложь Тогда
		Сообщить("Відскануйте штрих-код виробника"); 
		Возврат;
	КонецЕсли;
	
	
	Если Лев(ПолученныйШтрихкод, 3) = "010" Тогда
		текШтрихКод = Сред(ПолученныйШтрихкод, 4, 13);
	Иначе
		текШтрихКод = Сред(ПолученныйШтрихкод, 4, 8);
		Пока Лев(текШтрихКод, 1) = "0" Цикл
			текШтрихКод = Прав(текШтрихКод,СтрДлина(текШтрихКод) - 1);
		КонецЦикла;
	КонецЕсли;	
	
	Если ТекПроизводитель = 1 Или ТекПроизводитель = 2 Тогда  // 1-PMU, 2-BAT 
		нмШтрихПроизв =  ТаблицаШтрихКодаПроизводителей.НайтиСтроки(Новый Структура("ДанныеШтрихКода",ПолученныйШтрихКод));
		Если нмШтрихПроизв.Количество()>0 Тогда
			Сообщить("штрих-код виробника відскановано раніше");
			Возврат;
		КонецЕсли;
		
		//ПроверитьШтрихНаСервере
		Если ПроверитьШтрихКодПоставщикаНаСервере(ПолученныйШтрихКод) Тогда
			Сообщить("штрих-код виробника відскановано раніше");
			Возврат;
		КонецЕсли;	
	
	КонецЕсли;
	
	
	
	знПолученныйШтрихкод = текШтрихКод;
	
	нСтркиШтрихКод = ТаблицаШтрихКода.НайтиСтроки(Новый Структура("ШтрихКод",знПолученныйШтрихкод));
	Если нСтркиШтрихКод.Количество()= 0 Тогда
		Сообщить("У документі немає товару з цим штрихкодом - "+ПолученныйШтрихкод);
		Возврат;
	КонецЕсли;   
	
	СтрШтрихКод = нСтркиШтрихКод[0]; 
	Если НЕ СтрШтрихКод.Артикул = ТекАртикул Тогда
		Сообщить("Штрихкод не належить товару - "+ТекНаименованиеТовара);
		Возврат;
	КонецЕсли;  
	ШтрихКодКоэффициент = СтрШтрихКод.Коэффициент;
	
	КодМРЦ = "";	
	Если ТекПроизводитель = 1 Тогда //PMU
		Если ЭтоШКБлока Тогда
			КодМРЦ = Прав(ПолученныйШтрихКод, 11);
		КонецЕсли;
	ИначеЕсли ТекПроизводитель = 2 Тогда  //BAT
		Если ЭтоШКБлока Тогда 
			КодМРЦ = Прав(ПолученныйШтрихКод, 8);	
		ИначеЕсли ЭтоШККороба Тогда 
			ПозицияМРЦ = СтрНайти(ПолученныйШтрихКод, "240", НаправлениеПоиска.СНачала, 14) + 3; 
			Если ПозицияМРЦ > 3 Тогда 
				КодМРЦ = Сред(ПолученныйШтрихКод, ПозицияМРЦ, 8);
			КонецЕсли;  
		КонецЕсли;	
	ИначеЕсли ТекПроизводитель = 3 Тогда  //JTI
		Если ЭтоШКБлока Тогда 
			КодМРЦ = Прав(ПолученныйШтрихКод, 8);	
		КонецЕсли;
	КонецЕсли;
	
	РазмерМРЦ = 0;	
	Если НЕ ПустаяСтрока(КодМРЦ) Тогда 
		РазмерМРЦ = ПолучитьМРЦ_ПоКоду(ТекАртикул,КодМРЦ);
	КонецЕсли;
	
	Если РазмерМРЦ = 0 Тогда // нужно выбрать мрц
		ВыбратьМРЦ_Асинх(РазмерМРЦ,ПолученныйШтрихКод,ШтрихКодКоэффициент);
	Иначе
		ОбработатьВводМРЦ(РазмерМРЦ,ПолученныйШтрихКод,ШтрихКодКоэффициент);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводМРЦ(РазмерМРЦ,ПолученныйШтрихКод,ШтрихКодКоэффициент,РучнойВвод = Ложь)
	
	Если РазмерМРЦ = 0 Тогда 
		 Сообщить("МРЦ не вибрано!"); 
		Возврат;
	КонецЕсли;

	Если РучнойВвод Тогда
		
		мСтрокиТоварМРЦ = ТаблицаШтрихКодаПроизводителей.НайтиСтроки(Новый Структура("Артикул",ТекАртикул));
		Если мСтрокиТоварМРЦ.Количество() = 0 Тогда
			НоваяСтрокаШКП = ТаблицаШтрихКодаПроизводителей.Добавить();
		ИначеЕсли мСтрокиТоварМРЦ.Количество() = 1 Тогда
			НоваяСтрокаШКП = мСтрокиТоварМРЦ[0];
		Иначе
			для Каждого стрТоварМРЦ Из мСтрокиТоварМРЦ Цикл 
				ТаблицаШтрихКодаПроизводителей.Удалить(стрТоварМРЦ);
			КонецЦикла;
			НоваяСтрокаШКП = ТаблицаШтрихКодаПроизводителей.Добавить();
		КонецЕсли;
			
		ТекХарактеристика = РазмерМРЦ;
		НоваяСтрокаШКП.идПроизводитель = ТекПроизводитель;
		НоваяСтрокаШКП.ДанныеШтрихКода = ПолученныйШтрихКод;
		НоваяСтрокаШКП.Артикул = ТекАртикул;
		НоваяСтрокаШКП.Характеристика = РазмерМРЦ;
		НоваяСтрокаШКП.КоличествоВведено = ТекКоличествоВведено;; 

		
		мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,Характеристика,КоробкаНомер",ТекАртикул,ТекХарактеристика,КоробкаНомер));
		Если мУпаковщик.Количество() Тогда 
			смУпаковка = мУпаковщик[0];
		Иначе
			смУпаковка = ТаблицаТоварыУпаковщик.Добавить();  
			смУпаковка.Артикул = ТекАртикул;  
			смУпаковка.Характеристика = ТекХарактеристика; 

			смУпаковка.КоробкаНомер = КоробкаНомер;
		КонецЕсли;
		
		смУпаковка.КоличествоВведено = ТекКоличествоВведено;  
		смУпаковка.Коэффициент = ТекКоэффициент;
		
		ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик(); 	
		

		
		
	Иначе	
		Если ТекКоэффициент = ШтрихКодКоэффициент Тогда
			ДобавитьНовТекКоличествоВведено =  1;   
		Иначе
			ДобавитьНовТекКоличествоВведено = ШтрихКодКоэффициент/?(ТекКоэффициент=0,1,ТекКоэффициент);  
		КонецЕсли;
		
		Если ДобавитьНовТекКоличествоВведено < 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не можна додати "+ДобавитьНовТекКоличествоВведено + " відскануйте штрихкод "+ТекУпаковка);	
			Возврат; 
		КонецЕсли;
		
		
		НовТекКоличествоВведено = ТекКоличествоВведено + ДобавитьНовТекКоличествоВведено; 
		
		Если НовТекКоличествоВведено > КомплектовщикТК_Клиент.ДопускВесовойТовар(ТекВесовой,ТекКоличество) Тогда
			Сообщить("Перевищено кількість відбору!"); 
			Возврат;    
		КонецЕсли;
		
		ТекКоличествоВведено = НовТекКоличествоВведено; 
		
		ТекХарактеристика = РазмерМРЦ;
		НоваяСтрокаШКП = ТаблицаШтрихКодаПроизводителей.Добавить(); 
		НоваяСтрокаШКП.идПроизводитель = ТекПроизводитель;
		НоваяСтрокаШКП.ДанныеШтрихКода = ПолученныйШтрихКод;
		НоваяСтрокаШКП.Артикул = ТекАртикул;
		НоваяСтрокаШКП.Характеристика = РазмерМРЦ;
		НоваяСтрокаШКП.КоличествоВведено = ДобавитьНовТекКоличествоВведено; 
		
		мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,Характеристика,КоробкаНомер",ТекАртикул,ТекХарактеристика,КоробкаНомер));
		Если мУпаковщик.Количество() Тогда 
			смУпаковка = мУпаковщик[0];
		Иначе
			смУпаковка = ТаблицаТоварыУпаковщик.Добавить();  
			смУпаковка.Артикул = ТекАртикул; 
			смУпаковка.Характеристика = ТекХарактеристика;
			смУпаковка.КоробкаНомер = КоробкаНомер;
		КонецЕсли;
		
		смУпаковка.КоличествоВведено = НовТекКоличествоВведено;  
		смУпаковка.Коэффициент = ТекКоэффициент;
		
		ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик(); 	
		
		
	КонецЕсли;	
	

	Если ТекКоличествоВведено  >= ТекКоличество  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", Истина);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьМРЦ_Асинх(РазмерМРЦ,ПолученныйШтрихКод,ШтрихКодКоэффициент,РучнойВвод=Ложь) 
	
	
	 СписокОстаткиМРЦ = ПолучитьМРЦ_НаОстатке(ТекАртикул,СкладUUID);
	 Если СписокОстаткиМРЦ.Количество() = 0 Тогда
		 Сообщить("Немає залишку"); 
		Возврат  
	 КонецЕсли;
	 
	Обещание = СписокОстаткиМРЦ.ВыбратьЭлементАсинх("МРЦ");
	Рез = Ждать Обещание;
	Если Рез = Неопределено Тогда
		РазмерМРЦ = 0;
	Иначе
		РазмерМРЦ = Рез.Значение;
	КонецЕсли;  
	Если ТекХарактеристика <> РазмерМРЦ Тогда 
		 Сообщить("МРЦ резерв - "+ТекХарактеристика+Символы.ПС+"МРЦ вибрано - "+РазмерМРЦ); 
		Возврат;  
	КонецЕсли;
	
	
	ОбработатьВводМРЦ(РазмерМРЦ,ПолученныйШтрихКод,ШтрихКодКоэффициент,РучнойВвод);
	
КонецПроцедуры

#КонецОбласти  

 &НаСервереБезКонтекста
Процедура ОбработатьВесовойШтрихкод(структураШтриход)
	РегистрыСведений.Штрихкоды.ПреобразоватьВесовойШтрихкод(структураШтриход);
КонецПроцедуры
 

 &НаСервереБезКонтекста
Функция ПроверитьШтрихКодПоставщикаНаСервере(ШК)    
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/chkp?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		ШтрихКодОтсканирован = ?(РезОтвет.Ответ.ШКРез=1,Истина,Ложь);	
	Иначе  
		ШтрихКодОтсканирован = Истина;
	КонецЕсли;
	
	Возврат ШтрихКодОтсканирован	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМРЦ_ПоКоду(Знач АртикулТовара,Знач КодМРЦ)    
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/mrc?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&art="+АртикулТовара+"&kodmrc="+КодМРЦ;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		РазмерМРЦ = РезОтвет.Ответ.РазмерМРЦ;	
	Иначе  
		РазмерМРЦ = 0;
	КонецЕсли;
	
	Возврат РазмерМРЦ	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьИсключение(АртикулТовара)    
	
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/isk?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&art="+АртикулТовара;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		РезОтвет = РезОтвет.Ответ.ИсключениеПоставщика;	
	Иначе  
		РезОтвет = 0;
	КонецЕсли;
	
	Возврат Булево(РезОтвет);  

КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьНапечатьЧекрезерв(РезервUUID)    
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/chekrez?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&UUIDrez="+РезервUUID;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		РезОтвет = 1;	
	Иначе  
		РезОтвет = 0;
	КонецЕсли;
	
	Возврат Булево(РезОтвет);  

КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьМРЦ_НаОстатке(Знач АртикулТовара,Знач СкладUUID)
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/mrcost?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&art="+АртикулТовара+"&skladuuid="+СкладUUID;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	СписокОстаткиМРЦ = Новый СписокЗначений;
	Если РезОтвет.Результат Тогда
		
		Для Каждого стрОстМРЦ Из РезОтвет.Ответ.ОстаткиМРЦ Цикл 
			    СписокОстаткиМРЦ.Добавить(стрОстМРЦ.МРЦ,Формат(стрОстМРЦ.МРЦ,"ЧЦ=10; ЧДЦ=2; ЧРД=.; ЧН=Ноль")+ " ост. "+Формат(стрОстМРЦ.Остаток,"ЧЦ=5; ЧДЦ=0; ЧН=Ноль"));
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокОстаткиМРЦ
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбновитьКоличестворезервовНаСервере(КоличествоРезервов)
	
	  текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/rezerv?uuidcom="+ПараметрыСеанса.Сотрудник_ID;
	  РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	  
	  Если РезОтвет.Результат Тогда
		  КоличествоРезервов = РезОтвет.Ответ.ОчередьСборки; 
	  Иначе
		  КоличествоРезервов = 0;
		  Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			  Сообщить(РезОтвет.ОписаниеОшибки);
		  Иначе
			Сообщить("Помилка отримання резервів!");	  
		  КонецЕсли;
		  
	  КонецЕсли;

КонецПроцедуры

 &НаСервереБезКонтекста
Функция ПроверитьПринтерПечати(ШК) Экспорт  
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/prnp?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		ПринтерРабочий = Истина;
	Иначе  
		ПринтерРабочий = Ложь;
	КонецЕсли;
	
	Возврат Новый Структура("ПринтерРабочий,ТекстОшибки",ПринтерРабочий,РезОтвет.ОписаниеОшибки);	
	
КонецФункции

 &НаСервереБезКонтекста
Функция ПроверитьДобавитьТару(ШК,НомерКороба,ДокUUID) Экспорт  
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/chktar?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="
		+ШК+"&nomk="+НомерКороба+"&uuiddoc="+ДокUUID;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);  
	Артикул ="";
	Если РезОтвет.Результат Тогда 
		Артикул = РезОтвет.Ответ.АртикулТара;
		ТараДобавлена = Истина;
	Иначе  
		ТараДобавлена = Ложь;
	КонецЕсли;
	
	Возврат Новый Структура("ТараДобавлена,ТекстОшибки,Артикул",ТараДобавлена,РезОтвет.ОписаниеОшибки,Артикул);	
	
КонецФункции

  
 &НаСервереБезКонтекста
Функция ПроверитьТележку(ШК) Экспорт  
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/tlnp?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	ТележкаОК = Ложь;
	Если РезОтвет.Результат Тогда
		ТележкаОК = Истина;
	КонецЕсли;
	
	Возврат Новый Структура("ТележкаРабочий,ТекстОшибки",ТележкаОК,РезОтвет.ОписаниеОшибки);	
	
КонецФункции 



&НаКлиенте
Процедура ОбновитьКоличестворезервов(Команда)
	ОбновитьКоличестворезервовНаСервере(КоличествоРезервов);
КонецПроцедуры


&НаСервере
Процедура ВзятьРезервВРаботуНаСервере()  
   		
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/rezervrab?uuidcom="+ПараметрыСеанса.Сотрудник_ID;

	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
    ОбработатьСтрукуруРезерваНаСервере(РезОтвет);  
	
КонецПроцедуры 

  &НаСервереБезКонтекста
Функция ПолучитьРезервТележки(ШК) Экспорт  
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/tlnpRezerv?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
		
	Возврат РезОтвет;	
	
КонецФункции

 &НаСервере
 Процедура ОчиситьПеременныеФормы()
	ТаблицаМестаХранений.Очистить(); 
	ТаблицаРасхождений.Очистить();
	ТаблицаТара.Очистить();
	ТаблицаТовары.Очистить(); 
	ТаблицаТоварыТележки.Очистить();
	ТаблицаТоварыУпаковщик.Очистить();
	ТаблицаТУ.Очистить();
	ТаблицаШтрихКода.Очистить();  
	ТаблицаШтрихКодаПроизводителей.Очистить();	
	
	ДокументПеремещениеUUID = "";   
	ДокументUUID = "";
	ТекКоличествоВведеноКоробка = 0;
	ТекАртикул = "";   
	ТекХарактеристика = 0;
	ТекВесовой = 0;
	ТекИдентификаторСтроки =  0;
	ТекидУпаковка = 0;
	ТекиспХарактеристика = 0;   
	ТекКоличество   = 0;
	ТекКоличествоВведено  = 0;
	ТекКоличествоВведеноВес  = 0;
	ТекКоличествоВведеноКоробка  = 0;
	ТекКоэффициент = 0;
	ТекМестоХранение = "";
	ТекМестоХранениеИД = "";
    КоличествоБаз = 0;
	КоличествоРезервов = 0;
	
	КоробкаНомер = 0;
	КоробкаОткрыта = Ложь;
   	ПарамИспользоватьШоллер = Ложь;	              
	ИспользоватьШоллер = Ложь;   
	ИспользоватьТЕ = Ложь;

 КонецПроцедуры
 

&НаСервере
Процедура ОбработатьСтрукуруРезерваНаСервере(РезОтвет)
	
    ОчиситьПеременныеФормы();
	
 	Если РезОтвет.Результат Тогда
	ИД_Статус = 0;		
	СтруктураДокумента = РезОтвет.Ответ;
	
	Если СтруктураДокумента.Товары.Количество() = 0 Тогда
		 Сообщить("Нет товаров для сборки");
		 Возврат;
	КонецЕсли;
	
	СтруктураДокумента.Свойство("КомплектовщикУпаковщик",КомплектовщикУпаковщик);	
	СтруктураДокумента.Свойство("ИспользоватьШоллер",ИспользоватьШоллер);	
	СтруктураДокумента.Свойство("ИспользоватьТЕ",ИспользоватьТЕ);	

	НачалоКонтроля = ТекущаяДатаСеанса();
	ДокументUUID = СтруктураДокумента.ДокументUUID;	
	
	СкладUUID = СтруктураДокумента.СкладUUID;
	Элементы.ДекорацияНомерРезерва.Заголовок =  "Резерв "+СтруктураДокумента.НомерРезерва;
	Элементы.ДекорацияДатаЗаказа.Заголовок =  "Дата заказа "+СтруктураДокумента.ДатаЗаказа;
	Элементы.ДекорацияНомерТочки.Заголовок =  "Адреса "+СтруктураДокумента.ТочкаДоставки;
	Элементы.ДекорацияНомерМаршрута.Заголовок = "Маршрут "+ СтруктураДокумента.Порядок;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтотОбъект, "ГруппаШапкаДокумента,ГруппаСтрокаТовара", "Видимость", Истина);	
	Вес = СтруктураДокумента.Вес;	
    КоличествоБаз = СтруктураДокумента.КоличествоБаз;	
	
	
	
	Для Каждого стТовар Из СтруктураДокумента.Товары Цикл 
		нстрТовар = ТаблицаТовары.Добавить();
		нстрТовар.Артикул = стТовар.Артикул;
		нстрТовар.ТоварнаяМарка = стТовар.ТоварнаяМарка; 
		нстрТовар.НаименованиеТовара = стТовар.Номенклатура; 
		нстрТовар.Упаковка           = стТовар.ЕдиницаИзмерения;
		нстрТовар.Характеристика    = стТовар.ЗначениеМРЦ;
		нстрТовар.испХарактеристика    = стТовар.испХарактеристика;

		нстрТовар.Коэффициент      = стТовар.Коэффициент; 
		нстрТовар.Количество      = стТовар.Количество; 
		нстрТовар.КоличествоБаз      = стТовар.КоличествоБаз;               
		нстрТовар.Производитель      = стТовар.Производитель; //1-ФМ, 2-БАТ, 0-Все остальные
        нстрТовар.идУпаковка      = стТовар.идУпаковка;  //1 - баз ед.изм (шт, пачки), 2 - Упакавка (блоки) , 3 - ящики, 0 - непонятные
		нстрТовар.ЗаказИД       = стТовар.ЗаказИД;
        нстрТовар.СкладИД       = стТовар.СкладИД;
		нстрТовар.Весовой       = стТовар.Весовой;
		нстрТовар.МестоХранение = стТовар.НомерЯчейки;
	КонецЦикла;
	
	Для Каждого стШтрихКод Из СтруктураДокумента.ШтрихКода Цикл  
		
		нстрШтрихКод = ТаблицаШтрихКода.Добавить();
		нстрШтрихКод.ШтрихКод = СокрЛП(стШтрихКод.ШтрихКод);  
		нстрШтрихКод.Артикул = стШтрихКод.Артикул;
		нстрШтрихКод.Упаковка = стШтрихКод.Упаковка;
		нстрШтрихКод.Коэффициент = стШтрихКод.Коэффициент;
		
	КонецЦикла; 
	
	Если СтруктураДокумента.Свойство("ТоварыТележки") Тогда
		
		Для Каждого стТоварыТележки Из СтруктураДокумента.ТоварыТележки Цикл  
			
			нстрШтрихКод = ТаблицаТоварыТележки.Добавить();
			нстрШтрихКод.Артикул = стТоварыТележки.Артикул;
			нстрШтрихКод.Количество = стТоварыТележки.Количество;
			нстрШтрихКод.НомерТележки = стТоварыТележки.НомерТележки;
			
		КонецЦикла;
		
	КонецЕсли;
	СтрокаТовараВсего = ТаблицаТовары.Количество();
	СтрокаТовараТекущая = 1;
	стрТовары = ТаблицаТовары[0];
	
	ТекАртикул = стрТовары.Артикул;
	ТекВесовой = стрТовары.Весовой;
	ТекИдентификаторСтроки = стрТовары.ПолучитьИдентификатор();	
	ТекКоличество = стрТовары.Количество;	
	ТекКоличествоВведено = стрТовары.КоличествоВведено;  
	ТекКоличествоВведеноВес = стрТовары.КоличествоВведено; 

	ТекКоэффициент = стрТовары.Коэффициент; 
    ТекМестоХранение = стрТовары.МестоХранение;
	ТекМестоХранениеИД = стрТовары.МестоХранениеИД;	
	ТекТоварнаяМарка = стрТовары.ТоварнаяМарка;
	ТекНаименованиеТовара = стрТовары.НаименованиеТовара;
	ТекУпаковка	          = стрТовары.Упаковка; 
	ТекХарактеристика     = стрТовары.Характеристика; 
	ТекиспХарактеристика     = стрТовары.испХарактеристика;

	ТекПроизводитель      = стрТовары.Производитель; //1-ФМ, 2-БАТ, 0-Все остальные
	ТекидУпаковка         = стрТовары.идУпаковка;    //1 - баз ед.изм (шт, пачки), 2 - Упакавка (блоки) , 3 - ящики, 0 - непонятные 
	РучнойВводБезШтрикода = Ложь;
	Если ТаблицаШтрихКода.НайтиСтроки(Новый Структура("Артикул",ТекАртикул)).Количество() = 0 и НЕ (ТекПроизводитель = 1 ИЛИ ТекПроизводитель = 2) Тогда
		ТекШтрихКодОтсканирован = Истина;  
		РучнойВводБезШтрикода = Истина;//нет штрихкодов ввод вручную
	Иначе
		ТекШтрихКодОтсканирован = стрТовары.ШтрихКодОтсканирован;   
	КонецЕсли;
	
	мстрокиТележки =  ТаблицаТоварыТележки.НайтиСтроки(Новый Структура("Артикул",ТекАртикул)); 
	
	для Каждого стрТ Из мстрокиТележки Цикл 
		ТекТележкаНомер = ТекТележкаНомер + стрТ.НомерТележки +"-" +Строка(стрТ.Количество) +";";
	КонецЦикла;

	
	
   	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличество,ТекКоличествоВведеноКоробка", "Формат", ?(ТекВесовой = 1,"ЧЦ=15; ЧДЦ=3","ЧЦ=15; ЧДЦ=0"));	
   	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено", "Видимость", ТекВесовой = 0 );
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведеноВес", "Видимость", ТекВесовой = 1 ); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаМРЦ", "Видимость", ТекиспХарактеристика = 1 );
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗакрытьКоробку", "Видимость", КомплектовщикУпаковщик );

	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ГруппаЗадачиНаСборку,ДекорацияПерейти", "Видимость", Ложь);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары,ГруппаКнопки,ДекорацияСканироватьКодТовара", "Видимость", Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено,ТекКоличествоВведеноВес,ДобавитьКолВо", "Доступность", ТекКоличество>=25);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", ТекШтрихКодОтсканирован = Ложь );
	ИдетПроцессСканированияТелеги = Ложь; 
	ИдетПроцессСканированияПринтера = Ложь;
	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка отримання резервів!");	  
		КонецЕсли;
		
	КонецЕсли;
	


КонецПроцедуры


&НаКлиенте
Процедура ВзятьРезервВРаботу(Команда)
	ВзятьРезервВРаботуНаСервере();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНомераТележки()
	мстрокиТележки =  ТаблицаТоварыТележки.НайтиСтроки(Новый Структура("Артикул",ТекАртикул)); 
	СтрВозврат = "";	
	для Каждого стрТ Из мстрокиТележки Цикл 
		СтрВозврат = СтрВозврат + стрТ.НомерТележки +"-" +Строка(стрТ.Количество) +";";
	КонецЦикла;
	
	Возврат СтрВозврат;
	
КонецФункции


&НаКлиенте
Процедура ОбработатьПереходКнопкиВпередНазад(текСтрокаТовара)

	
	ТекАртикул = текСтрокаТовара.Артикул;
	ТекВесовой = текСтрокаТовара.Весовой;
	ТекИдентификаторСтроки = текСтрокаТовара.ПолучитьИдентификатор();	
	ТекКоличество = текСтрокаТовара.Количество;	
	ТекКоличествоВведено = текСтрокаТовара.КоличествоВведено;   
	ТекКоличествоВведеноВес = текСтрокаТовара.КоличествоВведено; 
	ТекКоэффициент = текСтрокаТовара.Коэффициент; 
	ТекМестоХранение = текСтрокаТовара.МестоХранение;
	ТекМестоХранениеИД = текСтрокаТовара.МестоХранениеИД;	
	ТекТоварнаяМарка = текСтрокаТовара.ТоварнаяМарка;	
	ТекНаименованиеТовара = текСтрокаТовара.НаименованиеТовара;	
	ТекУпаковка	          = текСтрокаТовара.Упаковка; 
	ТекХарактеристика     = текСтрокаТовара.Характеристика;
	ТекиспХарактеристика  = текСтрокаТовара.испХарактеристика;
    ТекТележкаНомер       = ПолучитьНомераТележки();
	ТекПроизводитель      = текСтрокаТовара.Производитель;  //1-ФМ, 2-БАТ, 0-Все остальные
    ТекидУпаковка         = текСтрокаТовара.идУпаковка;    //1 - баз ед.изм (шт, пачки), 2 - Упакавка (блоки) , 3 - ящики, 0 - непонятные 
	
	РучнойВводБезШтрикода = Ложь;
	Если ТаблицаШтрихКода.НайтиСтроки(Новый Структура("Артикул",ТекАртикул)).Количество() = 0 и НЕ (ТекПроизводитель = 1 ИЛИ ТекПроизводитель = 2) Тогда
		ТекШтрихКодОтсканирован = Истина;  
		РучнойВводБезШтрикода = Истина;//нет штрихкодов ввод вручную
	Иначе
		
		ТекШтрихКодОтсканирован = текСтрокаТовара.ШтрихКодОтсканирован;   
	КонецЕсли;
	
	Если ТекиспХарактеристика = 1 Тогда
		 нстрокиМРЦ =  ТаблицаШтрихКодаПроизводителей.НайтиСтроки(Новый Структура("Артикул,Характеристика",ТекАртикул,ТекХарактеристика));
		 счМРЦ = 0; 
		 Для Каждого стрнстрокиМРЦ Из нстрокиМРЦ Цикл 
			 счМРЦ = счМРЦ + стрнстрокиМРЦ.КоличествоВведено;
			 ТекХарактеристика = стрнстрокиМРЦ.Характеристика;
		 КонецЦикла;
		 ТекКоличествоВведено = счМРЦ;
	КонецЕсли;
	
	//Итого по товару
	нСтрокиУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,Характеристика",ТекАртикул,ТекХарактеристика)); 
	ТекКоличествоВведеноКоробка = 0;
	Для Каждого стрУпаковщик Из нСтрокиУпаковщик Цикл 
		ТекКоличествоВведеноКоробка = ТекКоличествоВведеноКоробка +стрУпаковщик.КоличествоВведено;	
	КонецЦикла;        
	нСтрокиУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("Артикул,Характеристика,КоробкаНомер",ТекАртикул,ТекХарактеристика,КоробкаНомер));
	//Итого по коробке упаковщика
	текКолКоробкаНом = 0;
	Для Каждого стрУпаковщик Из нСтрокиУпаковщик Цикл 
		текКолКоробкаНом = текКолКоробкаНом +стрУпаковщик.КоличествоВведено;	
	КонецЦикла;        
	
	ТекКоличествоВведено = текКолКоробкаНом;	
	ТекКоличествоВведеноВес = текКолКоробкаНом;
	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличество,ТекКоличествоВведеноКоробка", "Формат", ?(ТекВесовой = 1,"ЧЦ=15; ЧДЦ=3; ЧН=0,000","ЧЦ=15; ЧДЦ=0; ЧН=0"));	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено", "Видимость", ТекВесовой = 0 );
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведеноВес", "Видимость", ТекВесовой = 1 );

	//Если ПустаяСтрока(ТекМестоХранениеИД) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЯчейка,ДекорацияПерейти", "Видимость", Ложь);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаТовара,ГруппаСтрокаТовараОтборЕдиница,ГруппаКнопки", "Видимость", Истина);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаМРЦ", "Видимость", ТекиспХарактеристика = 1);	
		
		Если ТекПроизводитель = 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено,ТекКоличествоВведеноВес,ДобавитьКолВо", "Доступность", ТекКоличество>=25);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", ТекШтрихКодОтсканирован = Ложь );
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено,ТекКоличествоВведеноВес", "Доступность", ТекПроизводитель = 0);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", ТекПроизводитель <> 0);	
		КонецЕсли;
		
		ТекКоличествоВведеноВесШт = ?(ТекВесовой = 1,ТекКоличествоВведеноВес,ТекКоличествоВведено); 
		Если ТекКоличествоВведеноВесШт = ТекКоличество Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСканироватьКодТовара", "Видимость", Ложь ); 
		КонецЕсли;
	 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость",  ТекКоличествоВведеноКоробка = ТекКоличество ); 
		
	//Иначе
	//	
	//	Элементы.ДекорацияОтсканируйтеМестоХранения.Заголовок = "Відскануйте місце " + ТекМестоХранение;
	//	Элементы.ДекорацияОтсканируйтеМестоХранения.ЦветТекста = WebЦвета.Красный; 
	//	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено", "Видимость", МестоХраненияОтсканировано);	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаМРЦ", "Видимость", МестоХраненияОтсканировано и ТекиспХарактеристика = 1);	
	//КонецЕсли;
КонецПроцедуры

           
  &НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ОбработатьПереходВперед();

КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьПереходВперед() 
	
	МестоХраненияОтсканировано = Ложь;
	текСтрокатовары = ТаблицаТовары.НайтиПоИдентификатору(ТекИдентификаторСтроки);	
	текСтрокатовары.КоличествоВведено = ВсегоТекВведеноУпаковщик();//?(ТекВесовой = 0,ТекКоличествоВведено,ТекКоличествоВведеноВес);		
	текСтрокатовары.Отобрано = текСтрокатовары.Количество = текСтрокатовары.КоличествоВведено;
	текСтрокатовары.ШтрихКодОтсканирован = ТекШтрихКодОтсканирован;
	
	
	
	СтрокаТовараТекущая = СтрокаТовараТекущая +1;
	
	Если СтрокаТовараТекущая <= СтрокаТовараВсего Тогда
		новСтрокатовары = ТаблицаТовары[СтрокаТовараТекущая-1];
		ОбработатьПереходКнопкиВпередНазад(новСтрокатовары);
		
	Иначе  
		СтрокаТовараТекущая = СтрокаТовараТекущая - 1;
		ТаблицаРасхождений.Очистить();	
		мНеОтобранныеСтроки =  ТаблицаТовары.НайтиСтроки(Новый Структура("Отобрано",Ложь));
		Если мНеОтобранныеСтроки.Количество() >  0 Тогда
			Для Каждого стрТоварыОт Из мНеОтобранныеСтроки Цикл 
				стрТаблицаРасхождений = ТаблицаРасхождений.Добавить(); 
				ЗаполнитьЗначенияСвойств(стрТаблицаРасхождений,стрТоварыОт,"НаименованиеТовара,Упаковка,Артикул,Коэффициент,Количество,КоличествоВведено,Весовой,КоличествоБаз");
				стрТаблицаРасхождений.ИдентификаторСтрокиТоваров = стрТоварыОт.ПолучитьИдентификатор();
			КонецЦикла;
			//	Иначе
			
		КонецЕсли;  
		
		Если КоробкаОткрыта И ВсегоТекВведеноУпаковщик(Ложь,Истина) Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Истина);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Ложь);	
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Ложь);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Истина);	
			
		КонецЕсли;
		
		Элементы.ГруппаШапкаДокумента.Показать();
		
		ПерейтиНаЗапросФормированияДокументов();
		
	КонецЕсли;                      
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПерейтиНаЗапросФормированияДокументов()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаТовара,ГруппаЯчейка,ГруппаКнопки", "Видимость", Ложь);	
 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкиОтменаОК", "Видимость", Истина);	
   	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаРасхождения", "Видимость", ТаблицаРасхождений.Количество()>0);	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКоличествоТовары()
	
	ПроверкаОК = Истина;
	Для Каждого СтрТовар Из ТаблицаТовары Цикл 
		Если СтрТовар.Количество <> СтрТовар.КоличествоВведено Тогда
			ПроверкаОК = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПроверкаОК;

КонецФункции




&НаКлиенте
Процедура КнопкаНазад(Команда)

 	
	СтрокаТовараТекущая = СтрокаТовараТекущая -1;  
	МестоХраненияОтсканировано = Ложь;
	Если СтрокаТовараТекущая =0 Тогда 
		СтрокаТовараТекущая = 1; 
		Если ИД_Статус = 1 Тогда
			ИД_Статус = 0; 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ГруппаУпаковкаКоробка,ГруппаПечЭтикетка", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары,ГруппаКнопки", "Видимость", Истина);
			Возврат;	
		КонецЕсли;
		
		
		ОтменитьОтборРезерва()

	Иначе
		новСтрокатовары = ТаблицаТовары[СтрокаТовараТекущая-1];	
		ОбработатьПереходКнопкиВпередНазад(новСтрокатовары);
	КонецЕсли;
	

КонецПроцедуры



&НаКлиенте
Процедура КнопкаВперед(Команда)
	
	
	Если ИД_Статус = 0 Тогда 
		ИД_Статус = 1;	
		Если КомплектовщикУпаковщик И НЕ КоробкаОткрыта Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаУпаковкаКоробка", "Видимость", Истина);	 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопки,ГруппаТовары", "Видимость", Ложь);	
			
		Иначе
	

			//Если ПустаяСтрока(ТекМестоХранениеИД) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЯчейка,ГруппаЗадачиНаСборку,ГруппаТовары,ДекорацияПерейти", "Видимость", Ложь);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличество", "Формат", ?(ТекВесовой = 1,"ЧЦ=15; ЧДЦ=3","ЧЦ=15; ЧДЦ=0"));	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведено", "Видимость", ТекВесовой = 0 );
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТекКоличествоВведеноВес", "Видимость", ТекВесовой = 1 );
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ГруппаСтрокаТовара,ГруппаСтрокаТовараОтборЕдиница,ГруппаКнопки", "Видимость", Истина);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаМРЦ", "Видимость", ТекиспХарактеристика = 1);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость",  ТекКоличествоВведеноКоробка = ТекКоличество); 
           // ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечЭтикетка", "Видимость",  ТипДокумента = "КомплектовщикОтбор");

		КонецЕсли;	
		//Иначе
		//	Элементы.ДекорацияОтсканируйтеМестоХранения.Заголовок = "Відскануйте місце " + ТекМестоХранение; 
		//	Элементы.ДекорацияОтсканируйтеМестоХранения.ЦветТекста = WebЦвета.Красный; 
		//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаСборку,ГруппаСтрокаМРЦ,ГруппаСтрокаТовараОтборЕдиница,ТекКоличествоВведено", "Видимость", Ложь);	
		//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаШапкаДокумента,ГруппаСтрокаТовара,ГруппаЯчейка", "Видимость", Истина);	
		//КонецЕсли;
	//	ОтправитьНапечатьЧекрезерв(ДокументUUID);
		Возврат;
	КонецЕсли;
	
	 тквВведено =  ТекКоличествоВведеноКоробка;
	//тквВведено = ?(ТекВесовой = 0,ТекКоличествоВведено,ТекКоличествоВведеноВес);	
	Если тквВведено > КомплектовщикТК_Клиент.ДопускВесовойТовар(ТекВесовой,ТекКоличество) Тогда
		Сообщить("Перевищено кількість відбору!"); 
		Возврат;
	ИначеЕсли ТекКоличество > тквВведено ИЛИ тквВведено = 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение,"Кількість введена менше ніж потрібно, перейти до наступного місця?", Режим, 0);
		Возврат;
	КонецЕсли; 
	
    ОбработатьПереходВперед();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекКоличествоВведеноПриИзменении(Элемент)
	
	ДобавитьКолВоУпаковщик();
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКолВо(Команда)

	колВоДобавить = ТекКоличество - ТекКоличествоВведеноКоробка;	
	Если ТекВесовой Тогда 
		ТекКоличествоВведеноВес = ТекКоличествоВведеноВес + колВоДобавить; 
	Иначе    
		ТекКоличествоВведено = ТекКоличествоВведено + колВоДобавить;
	КонецЕсли;
    ДобавитьКолВоУпаковщик();

КонецПроцедуры    

&НаКлиенте
Процедура ДобавитьКолВоУпаковщик()
	
	ТекКолВВод =  ?(ТекВесовой=1,ТекКоличествоВведеноВес,ТекКоличествоВведено);
	ВсегоВведено = ТекКолВВод + ВсегоТекВведеноУпаковщик()-ВсегоТекВведеноУпаковщик(Истина);
	
	Если ВсегоВведено>КомплектовщикТК_Клиент.ДопускВесовойТовар(ТекВесовой,ТекКоличество) Тогда
		Сообщить("перевищення! - "+Формат(ВсегоВведено-КомплектовщикТК_Клиент.ДопускВесовойТовар(ТекВесовой,ТекКоличество),"ЧЦ=15; ЧДЦ=3"));
		Возврат;
	КонецЕсли;
	
	
	Если ТекиспХарактеристика = 1 Тогда
		
		ВыбратьМРЦ_Асинх(ТекХарактеристика,ТекАртикул,ТекКоэффициент,Истина);  
		Возврат;
	КонецЕсли;
	
	отборКоробка = Новый Структура("Артикул,Характеристика,КоробкаНомер",ТекАртикул,ТекХарактеристика,КоробкаНомер);
	
	мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(отборКоробка);
	Если мУпаковщик.Количество() Тогда 
		смУпаковка = мУпаковщик[0];
	Иначе
		смУпаковка = ТаблицаТоварыУпаковщик.Добавить();  
		смУпаковка.Артикул = ТекАртикул;  
		смУпаковка.Характеристика = ТекХарактеристика; 
		смУпаковка.КоробкаНомер = КоробкаНомер;
	КонецЕсли;
	
	смУпаковка.КоличествоВведено = ТекКолВВод;  
	смУпаковка.Коэффициент = ТекКоэффициент;

	ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость",  ТекКоличествоВведеноКоробка = ТекКоличество ); 

КонецПроцедуры


&НаКлиенте
Процедура ТекКоличествоВведеноОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//
	//   ДобавитьКолВоУпаковщик();

	//ВсегоВведено = ВыбранноеЗначение + ВсегоТекВведеноУпаковщик();

	//
	//Если ВсегоВведено > ТекКоличество Тогда
	//	Сообщить("Перевищено кількість відбору!");
	//	Возврат;
	//КонецЕсли;
	//

	//Если ТекиспХарактеристика = 1 Тогда
	//	
	//	ВыбратьМРЦ_Асинх(ТекХарактеристика,ТекАртикул,ТекКоэффициент,Истина);
	//	отборКоробка = Новый Структура("Артикул,Характеристика,КоробкаНомер",ТекАртикул,ТекХарактеристика,КоробкаНомер);
	//Иначе	
	//	отборКоробка = Новый Структура("Артикул,КоробкаНомер",ТекАртикул,КоробкаНомер);
	//КонецЕсли;
	//
	//мУпаковщик = ТаблицаТоварыУпаковщик.НайтиСтроки(отборКоробка);
	//Если мУпаковщик.Количество() Тогда 
	//	смУпаковка = мУпаковщик[0];
	//Иначе
	//	смУпаковка = ТаблицаТоварыУпаковщик.Добавить();  
	//	смУпаковка.Артикул = ТекАртикул;  
	//	смУпаковка.Характеристика = ТекХарактеристика; 
	//	смУпаковка.КоробкаНомер = КоробкаНомер;
	//КонецЕсли;
	//
	//смУпаковка.Коэффициент = ТекКоэффициент;
	//смУпаковка.КоличествоВведено = ВыбранноеЗначение;
	//ТекКоличествоВведеноКоробка = ВсегоТекВведеноУпаковщик();
	//   ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПерейти", "Видимость",  ТекКоличествоВведеноКоробка = ТекКоличество ); 

КонецПроцедуры




&НаКлиенте
Процедура ЗакончитьОтбор(Команда)  
	//Если КоробкаОткрыта И ВсегоТекВведеноУпаковщик(Ложь,Истина) Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Истина);	
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Ложь); 
	//	Сообщить("Залишилася не закрита коробка, закрийте коробку");
	//	Возврат;
	//КонецЕсли;		
	//		

	 ЗакончитьОтборАсинх();
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗакончитьОтборАсинх()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Сформувати документ?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	//ОтправитьНапечатьЧекрезерв(ДокументUUID);
	ИД_Статус = 2;
	РезультатВыгрузки = ВыгрузитьРезультатыСканирования();
	Если НЕ РезультатВыгрузки.Результат Тогда
		Возврат;
	КонецЕсли;
	
	Если  ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
		мПечатнаяФорма = Неопределено;	
		РезультатВыгрузки.Ответ.Свойство("ПечатнаяФорма",мПечатнаяФорма);
		
		Если мПечатнаяФорма = Неопределено Тогда
			Возврат;	
		Иначе  
			
			Если ТипЗнч(мПечатнаяФорма)= Тип("Массив") Тогда
				
				Для Каждого СтрукПечФомра Из мПечатнаяФорма Цикл 
					
					
					РезПечать =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтрукПечФомра);
					
					Если РезПечать.Результат Тогда
						ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(РезПечать.Ответ);
					Иначе
						Сообщить(РезПечать.ОписаниеОшибки);
					КонецЕсли; 
					
					
				КонецЦикла;
				
				
			КонецЕсли;
			
			
			
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтменитьОтборРезерва()
    Режим = РежимДиалогаВопрос.ДаНет;
    Ответ = Ждать ВопросАсинх("Скасувати відбір резерву?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	ИД_Статус = 0;
	ОтменитьСборкуРезерва();
	
КонецПроцедуры

 
&НаСервере
Процедура ОтменитьСборкуРезерва()

	Если ТипДокумента = "КомплектовщикОтбор" Тогда
		ПарамОтмена = "rezervotmenavol";
	Иначе
		ПарамОтмена = "rezervotmena";
	КонецЕсли;
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/"+ПарамОтмена+"?uuiddoc="+ДокументUUID+"&uuidcom="+ПараметрыСеанса.Сотрудник_ID;
	Если НЕ ПустаяСтрока(ДокументПеремещениеUUID) Тогда  
		  текстЗапроса = текстЗапроса+"&uuiddocp="+ДокументПеремещениеUUID;
	КонецЕсли;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		ТаблицаМестаХранений.Очистить();
		ТаблицаРасхождений.Очистить();
		ТаблицаТовары.Очистить();
		ТаблицаШтрихКода.Очистить();
		ДокументUUID ="";
		ДокументПеремещениеUUID = "";
		КоробкаНомер = 0;  
		КоробкаОткрыта = Ложь;
		ИспользоватьТЕ = Ложь;
		ТаблицаТУ.Очистить();
	

		КоличествоРезервов = РезОтвет.Ответ.ОчередьСборки; 	
		Если ТипДокумента = "КомплектовщикОтбор" Тогда
			ИдетПроцессСканированияТелеги = Истина; 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары,ГруппаДокумент,ГруппаУпаковкаКоробка,ГруппаКнопкиОтменаОК,ГруппаКнопки,ДекорацияПерейти", "Видимость", Ложь);	
  			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаКомплект", "Видимость", Истина);	
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаСборку", "Видимость", Истина);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТовары,ГруппаДокумент,ГруппаУпаковкаКоробка,ГруппаКнопкиОтменаОК,ГруппаКнопки", "Видимость", Ложь);	
		КонецЕсли;
	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка скасування резерву!");	  
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ВыгрузитьРезультатыСканирования()
	
	МассивТовары = Новый Массив;	
	ФиксСтруктура ="Артикул,Характеристика,Коэффициент,КоличествоВведено,ЗаказИД,СкладИД"; 
	Для Каждого стрТовар Из ТаблицаТовары Цикл 
		Если стрТовар.КоличествоВведено = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтруктураСтрока = Новый Структура(ФиксСтруктура);    
		ЗаполнитьЗначенияСвойств(СтруктураСтрока,стрТовар);	
		МассивТовары.Добавить(СтруктураСтрока);	
		
	КонецЦикла;  
	                
	МассивТоварыМРЦ = Новый Массив; 
	ФиксСтруктура = "идПроизводитель,ДанныеШтрихКода,Артикул,Характеристика,КоличествоВведено";
	Для Каждого стрТовар Из ТаблицаШтрихКодаПроизводителей Цикл 
		нстрокаСтруктура = Новый Структура(ФиксСтруктура);	
		ЗаполнитьЗначенияСвойств(нстрокаСтруктура,стрТовар);
		МассивТоварыМРЦ.Добавить(нстрокаСтруктура);
	КонецЦикла;
	
	
	Если МассивТовары.Количество()  = 0 Тогда
		Сообщить("Немає товарів для вивантаження");
		Возврат Новый Структура("Результат",Ложь);
	КонецЕсли;
	
	МассивТара = Новый Массив;
	ФиксСтруктура = "Артикул,Количество";
	Для Каждого стТара Из ТаблицаТара Цикл 
		нстрокаСтруктура = Новый Структура(ФиксСтруктура);	
		ЗаполнитьЗначенияСвойств(нстрокаСтруктура,стТара);
		МассивТара.Добавить(нстрокаСтруктура);
	КонецЦикла;
	
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID); 
	СтруктураДокумента.Вставить("UUID_Сотрудник",ПараметрыСеанса.Сотрудник_ID);
	СтруктураДокумента.Вставить("НачалоКонтроля",НачалоКонтроля);
	СтруктураДокумента.Вставить("Товары",МассивТовары);
	СтруктураДокумента.Вставить("МассивТоварыМРЦ",МассивТоварыМРЦ); 
	СтруктураДокумента.Вставить("МассивТара",МассивТара);
	СтруктураДокумента.Вставить("ИспользоватьШоллер",ИспользоватьШоллер);

	СтруктураДокумента.Вставить("ПечатьТСД",?(ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер(),1,0));
	Если Не ПустаяСтрока(ДокументПеремещениеUUID) Тогда
		СтруктураДокумента.Вставить("UUID_Перемещение",ДокументПеремещениеUUID);
	КонецЕсли;

	Если ТипДокумента ="КомплектовщикОтбор" Тогда
		парамЗапрос = "DocFinihvol";	
	Иначе
		парамЗапрос = "DocFinih";	
	КонецЕсли;

	
   	ТекстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/"+парамЗапрос;
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента,ТекстЗапроса);
	Если РезОтвет.Результат Тогда 
		КоличествоРезервов = РезОтвет.Ответ.ОчередьСборки; 	
		
		Если ТипДокумента = "КомплектовщикОтбор" Тогда     
			ИдетПроцессСканированияТелеги = Истина;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаКомплект", "Видимость", Истина);			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЗадачиНаСборку", "Видимость", Истина);	
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ГруппаРасхождения,ГруппаКнопкиОтменаОК", "Видимость", Ложь);	
			   
		ТаблицаМестаХранений.Очистить();
		ТаблицаРасхождений.Очистить();
		ТаблицаТовары.Очистить();  
		ТаблицаТоварыТележки.Очистить(); 
		ТаблицаТоварыУпаковщик.Очистить();
		ТаблицаШтрихКода.Очистить();
		ТаблицаШтрихКодаПроизводителей.Очистить();   
		ТаблицаТара.Очистить();
		ДокументUUID = "";
		ДокументПеремещениеUUID = "";  
		КоробкаОткрыта = Ложь;  
		ИспользоватьШоллер = Ложь; 
		ИспользоватьТЕ = Ложь;
		ТаблицаТУ.Очистить();
		

	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка вивантаження документа!");	  
		КонецЕсли;
		
	КонецЕсли;
	Возврат РезОтвет;
	
КонецФункции

&НаСервере
Функция СоздатьРаспечататьКоробку(ИД_Принтер,КолВоСтик = 1)
	
	МассивТовары = Новый Массив;	
	ФиксСтруктура ="Артикул,Характеристика,Коэффициент,КоличествоВведено"; 

    нМассивКоробка = ТаблицаТоварыУпаковщик.НайтиСтроки(Новый Структура("КоробкаНомер",КоробкаНомер));
	
	Для Каждого стрКоробка Из нМассивКоробка Цикл 
		Если стрКоробка.КоличествоВведено = 0 Тогда Продолжить; КонецЕсли;
		нстрокаСтруктура = Новый Структура(ФиксСтруктура);	
		ЗаполнитьЗначенияСвойств(нстрокаСтруктура,стрКоробка);	
		МассивТовары.Добавить(нстрокаСтруктура);
	КонецЦикла;
	
   	
	Если МассивТовары.Количество()  = 0 Тогда
		Сообщить("Немає товарів для друку коробки");
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID); 
	СтруктураДокумента.Вставить("UUID_Сотрудник",ПараметрыСеанса.Сотрудник_ID);  
	СтруктураДокумента.Вставить("UUID_Принтер",ИД_Принтер);
	СтруктураДокумента.Вставить("КоличествоСтикеров",КолВоСтик);

	Если Не ПустаяСтрока(ДокументПеремещениеUUID) Тогда
		СтруктураДокумента.Вставить("UUID_Перемещение",ДокументПеремещениеUUID);
	КонецЕсли;
	
	СтруктураДокумента.Вставить("НомерУпаковки",КоробкаНомер);
	СтруктураДокумента.Вставить("НачалоУпаковки",КоробкаДатаОткрыта);
	СтруктураДокумента.Вставить("КонецУпаковки",ТекущаяДата());
	СтруктураДокумента.Вставить("Товары",МассивТовары);      
	
	
	Если ТипДокумента ="КомплектовщикОтбор" Тогда
		парамЗапрос = "DocTUPvol";	
	Иначе
		парамЗапрос = "DocTUP";	
	КонецЕсли;
	
	
	ТекстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/"+парамЗапрос;
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента,ТекстЗапроса);
	Если РезОтвет.Результат Тогда 
		ДокументПеремещениеUUID = РезОтвет.Ответ.UUID_Перемещение;	
		Возврат Истина;
	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("Помилка вивантаження документа!");	  
		КонецЕсли;    
		ДокументПеремещениеUUID = "";
        Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции


&НаСервере
Функция РаспечататьЧек(ИД_Принтер,Копий)
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID); 
	СтруктураДокумента.Вставить("UUID_Сотрудник",ПараметрыСеанса.Сотрудник_ID);  
	СтруктураДокумента.Вставить("UUID_Принтер",ИД_Принтер);
	СтруктураДокумента.Вставить("Копий",Копий);
	парамЗапрос = "PrintChek";	
	
	
	ТекстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/"+парамЗапрос;
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумента,ТекстЗапроса);
	Если РезОтвет.Результат Тогда 
		
		Возврат Истина;
	Иначе
		Если Не ПустаяСтрока(РезОтвет.ОписаниеОшибки) Тогда
			Сообщить(РезОтвет.ОписаниеОшибки);
		Иначе
			Сообщить("помилка друку!");	  
		КонецЕсли;    
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции


&НаКлиенте
Процедура ВернутсяКОтбору(Команда)   

	Если ПустаяСтрока(ТекМестоХранениеИД) Тогда
		стрГрФорм =",ГруппаЯчейка";	
	Иначе
		стрГрФорм ="";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСтрокаТовара,ГруппаЯчейка,ГруппаКнопки", "Видимость", Истина);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкиОтменаОК,ГруппаРасхождения"+стрГрФорм, "Видимость", Ложь);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаШапкаДокумента", "Видимость", Истина);
	Элементы.ГруппаШапкаДокумента.Скрыть();    
	
	ИД_Статус = 1;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьКоробку(Результат,ПараметрыКоробка)Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьШоллер = Результат.Ответ;
	ОткрытиеКоробки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеКоробки()

 		КоробкаОткрыта = Истина;
		КоробкаНомер = КоробкаНомер+1;
		КоробкаДатаОткрыта = ТекущаяДата();
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаУпаковкаКоробка", "Видимость", Ложь);   
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ГруппаКнопки", "Видимость", Истина);  
		//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПечЭтикетка", "Видимость",  ТипДокумента = "КомплектовщикОтбор");

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьКоробку(Команда)
	
	//Если ПарамИспользоватьШоллер Тогда
	//	
	//	
	//	ДополнительныеПараметры = Новый Структура;
	//	ДополнительныеПараметры.Вставить("ПарамФормы", "ТекстВопроса");
	//	ДополнительныеПараметры.Вставить("Вопрос", "Використовувати Шоллер?");
	//	
	//	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьКоробку", ЭтотОбъект);
	//	
	//	ОткрытьФорму("ОбщаяФорма.ФормаВопрос", ДополнительныеПараметры, ЭтаФорма,,,,ОписаниеОповещения);
	//	
	//Иначе
		ОткрытиеКоробки();
	//КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКоробку(Команда)
	
	
	ВсегоВКоробке = ВсегоТекВведеноУпаковщик(Ложь,Истина);
	
	Если ВсегоВКоробке = 0 Тогда
		Сообщить("Коробка порожня!");
		Возврат;	
	КонецЕсли; 
	ПараметрыСтруктура = Новый Структура;
	Если ТоваровВУпаковке(КоробкаНомер)  = 1 И ТипДокумента ="КомплектовщикОтбор" Тогда
         ПараметрыСтруктура.Вставить("ВводКоличества");
	КонецЕсли;
	
	ИдетПроцессСканированияПринтера = Истина;
	ОповещениеПечатьКоробки = Новый ОписаниеОповещения("ОповещениеПринтерОтсканирован", ЭтотОбъект,ПараметрыСтруктура);
	ОткрытьФорму("ОбщаяФорма.ПечатьКоробки",ПараметрыСтруктура,ЭтаФорма,,,,ОповещениеПечатьКоробки,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);


КонецПроцедуры

&НаКлиенте
Процедура ОповещениеТараОтсканирована(Результат,ПараметрыТараСтруктура)Экспорт	
	
	ПринтерОтсканированЗавершение(ПараметрыТараСтруктура);

КонецПроцедуры

	

&НаКлиенте
Процедура ОтсканироватьШтрихКодКороба(ПараметрыТараСтруктура)
	
	ПараметрыТараСтруктура.Вставить("НомерКороба",КоробкаНомер);
	ПараметрыТараСтруктура.Вставить("uuiddoc",ДокументПеремещениеUUID);

	ОповещениеТараОтсканирована = Новый ОписаниеОповещения("ОповещениеТараОтсканирована", ЭтотОбъект,ПараметрыТараСтруктура);
	ОткрытьФорму("ОбщаяФорма.ФормаСканироватьУпаковку",ПараметрыТараСтруктура,ЭтаФорма,,,,ОповещениеТараОтсканирована,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры



&НаКлиенте
Процедура ОповещениеПринтерОтсканирован(Результат,ПараметрыКоробка)Экспорт
	
	ИдетПроцессСканированияПринтера = Ложь;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СоздатьРаспечататьКоробку(Результат.ИД_Принтер,Результат.КоличествоСтикеров) Тогда
		
		Если ИспользоватьШоллер Тогда
			ОтсканироватьШтрихКодКороба(ПараметрыКоробка);
		Иначе  
			ПринтерОтсканированЗавершение(ПараметрыКоробка)
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОповещениеТЕ_Отсканирована(Результат,ПараметрыКоробка)Экспорт
	
	//Если Результат = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	ТЕОстканирован = Истина;  
	
	СтрокаТТУ = ТаблицаТУ.Добавить();
	СтрокаТТУ.КоробкаНомер = КоробкаНомер;
	СтрокаТТУ.Размещено = Результат;
	
	ПринтерОтсканированЗавершение(ПараметрыКоробка);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПринтерОтсканированЗавершение(ПараметрыКоробка) 
	
	Если ИспользоватьТЕ И НЕ ТЕОстканирован Тогда
		
		ОповещениеТЕ_Отсканирована = Новый ОписаниеОповещения("ОповещениеТЕ_Отсканирована", ЭтотОбъект,ПараметрыКоробка);
		ОткрытьФорму("ОбщаяФорма.ФормаСканироватьТЕ",ПараметрыКоробка,ЭтаФорма,,,,ОповещениеТЕ_Отсканирована,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	Иначе
		
		Если ПараметрыКоробка.Свойство("ПоследняяКоробка") Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Ложь);	
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Истина);	
		КонецЕсли;	
		КоробкаНомер = КоробкаНомер+1; 
		КоробкаДатаОткрыта = ТекущаяДата();
		ТЕОстканирован = Ложь;	
		ТекКоличествоВведеноВес = 0;
		ТекКоличествоВведено = 0;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьКоробкуЗавершение(Команда)

	ВсегоВКоробке = ВсегоТекВведеноУпаковщик(Ложь,Истина);
	Если ВсегоВКоробке = 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗавершитьЗакрытьКоробку", "Видимость", Ложь);	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопкаЗак", "Видимость", Истина);	
		Возврат;
	КонецЕсли;
	ПараметрыСтруктура = Новый Структура;
    ПараметрыСтруктура.Вставить("ПоследняяКоробка");
	Если ТоваровВУпаковке(КоробкаНомер)  = 1 И ТипДокумента ="КомплектовщикОтбор" Тогда
		ПараметрыСтруктура.Вставить("ВводКоличества");
	КонецЕсли;

	ОповещениеПечатьКоробки = Новый ОписаниеОповещения("ОповещениеПринтерОтсканирован", ЭтотОбъект,ПараметрыСтруктура);
	ОткрытьФорму("ОбщаяФорма.ПечатьКоробки",ПараметрыСтруктура,ЭтаФорма,,,,ОповещениеПечатьКоробки,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводШКПриИзменении(Элемент)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);  
	
	ОбработатьПолученныйШтрихкод(ВводШК, ДополнительныеПараметры);
	
КонецПроцедуры


&НаКлиенте
Процедура ПечатьЭтикетки(Команда)  
	
	 Печ_асинх_ПоказатьВводЧисла();
	//ПечатьЭтикеткиНаСервере();
КонецПроцедуры

&НаКлиенте
Асинх Процедура Печ_асинх_ПоказатьВводЧисла()
	Обещание = ВвестиЧислоАсинх(1,"Кол-во стикер",1,0);
	Результат = Ждать Обещание;
	
	ОткрытьФормуВыбораПринтера(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПринтера(чекКопий) 
	Если Не ЗначениеЗаполнено(чекКопий) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСтруктура = Новый Структура;
	ПараметрыСтруктура.Вставить("Копий",чекКопий);
	ОповещениеПечатьКоробки = Новый ОписаниеОповещения("ОповещениеПринтерЧекаОтсканирован", ЭтотОбъект,ПараметрыСтруктура);
	ОткрытьФорму("ОбщаяФорма.ПечатьКоробки",ПараметрыСтруктура,ЭтаФорма,,,,ОповещениеПечатьКоробки,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

 &НаКлиенте
Процедура ОповещениеПринтерЧекаОтсканирован(Результат,ПараметрыЧек)Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаспечататьЧек(Результат.ИД_Принтер,ПараметрыЧек.Копий);
		
КонецПроцедуры

&НаКлиенте
Процедура КоробкаНомерНажатие(Элемент, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	Если НЕ ТоваровВУпаковке(КоробкаНомер) Тогда 
		ОчиститьСообщения();
		Сообщить("Коробка порожня!");
		Возврат;
	КонецЕсли;
	

КонецПроцедуры



