
#Область ПрограммныйИнтерфейс

// Вычисляет допустимый ввод весового товара резерва. Для товара первого типа увеличивает количество на 20%.
//
// Параметры:
//   ТипТов - Число - тип товара (1 - весовой товар)
//   Количество - Число - количество товара
//
// Возвращаемое значение:
//   Число - допустимое количество товара резерва
Функция ДопускВесовойТовар(Знач ТипТов, Знач Количество) Экспорт
    Если ТипТов = 1 Тогда
        Рез = Количество * 1.2;
    Иначе
        Рез = Количество;
    КонецЕсли;
    Возврат Рез
КонецФункции

#КонецОбласти 