
Функция ЭтоАсинхронныйСканерШтрихкодов(ОборудованиеСканирования) Экспорт
	
	Если ЗначениеЗаполнено(ОборудованиеСканирования)
			И( ОборудованиеСканирования.ДрайверОборудования = Справочники.ДрайверыОборудования.Драйвер1ССканерШтрихкода 
			ИЛИ ОборудованиеСканирования.ДрайверОборудования = Справочники.ДрайверыОборудования.ДрайверRightScanУстройстваВвода 
			ИЛИ ОборудованиеСканирования.ДрайверОборудования = Справочники.ДрайверыОборудования.ДрайверFaino)Тогда
			Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СканерШтрихкодовИнициализирован() Экспорт
	
	Возврат ПараметрыСеанса.СканерШтрихкодовИнициализирован;
	
КонецФункции

Процедура УстановитьСканерШтрихкодовИнициализирован(Инициализирован) Экспорт
	
	ПараметрыСеанса.СканерШтрихкодовИнициализирован = Инициализирован;
	
КонецПроцедуры