
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "ТекущаяВерсияПриложения");
	
	ТекущаяВерсияПриложения = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ТекущаяВерсияПриложения");
	
	Если Параметры.Свойство("СтрокаПодключения") Тогда 
		ЭтаФорма.РезервноеКопированиеСтрокаПодключения = Параметры.СтрокаПодключения;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыгруженныеБазы") Тогда 
		
		ВыгруженныеБазыМассив = Параметры.ВыгруженныеБазы;
		
		Для Каждого ВыгруженнаяБаза Из ВыгруженныеБазыМассив Цикл
			Если ВыгруженнаяБаза.ВерсияПриложения = ТекущаяВерсияПриложения Тогда
				НоваяСтрока = ВыгруженныеБазы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыгруженнаяБаза);
			КонецЕсли;
		КонецЦикла;
		
		ВыгруженныеБазы.Сортировать("ДатаВыгрузки Убыв");
	КонецЕсли;
	
	Если ВыгруженныеБазы.Количество() = 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНетДоступныхКопий;
	КонецЕсли;
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВыгруженныеБазыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстВопроса = НСтр("ru = 'При восстановлении информационной базы, все текущие данные будут удалены.
					|Продолжить?'");
	
	ОповещениеПослеВопросаВосстановления = Новый ОписаниеОповещения("ПослеВопросаВосстановления", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеПослеВопросаВосстановления, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВопросаВосстановления(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ВыгруженныеБазы.ТекущиеДанные;
	
	ВыбраннаяБаза = ТекущиеДанные.ИмяФайла;
	ВерсияПриложения = ТекущиеДанные.ВерсияПриложения;
	МестоХранения = ТекущиеДанные.МестоХранения;
	
	ПараметрыРезервнойКопии = Новый Структура;
	ПараметрыРезервнойКопии.Вставить("ВыбраннаяБаза",    ТекущиеДанные.ИмяФайла);
	ПараметрыРезервнойКопии.Вставить("ВерсияПриложения", ТекущиеДанные.ВерсияПриложения);
	ПараметрыРезервнойКопии.Вставить("МестоХранения",    ТекущиеДанные.МестоХранения);
	ПараметрыРезервнойКопии.Вставить("ПолноеИмя",        ТекущиеДанные.ПолноеИмя);
	
	ОписаниеПослеВосстановления = Новый ОписаниеОповещения("ПослеВосстановления", ЭтотОбъект);
	РезервноеКопированиеКлиент.ЗагрузитьБазуИзXML(ПараметрыРезервнойКопии,ОписаниеПослеВосстановления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВосстановления(ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция УстановитьСоответствиеСМетаданными(ВерсияПриложенияВыгрузка, ФайлВыгрузки)
	
	ОпределитьДобавляемыеМетаданные(ВерсияПриложенияВыгрузка);
	ОбновляемыеОбъекты = ЭтаФорма.ДобавляемыеМетаданные.Выгрузить(, "ОбъектМетаданных");
	ОбновляемыеОбъекты.Свернуть("ОбъектМетаданных");
	МассивОбновляемыхОбъектов = ОбновляемыеОбъекты.ВыгрузитьКолонку("ОбъектМетаданных");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлВыгрузки);
	
	ОбновленныйФайлВыгрузки = ПолучитьИмяВременногоФайла(".xml");
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ОбновленныйФайлВыгрузки);
	
	НеобходимоДобавитьРеквизит = Ложь;
	ИмяОбновляемогоЭлементаXML = "";
	ИмяОбновляемогоЭлемента = "";
	
	Пока ЧтениеXML.Прочитать() Цикл 
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			Для каждого ОбновляемыйОбъект Из МассивОбновляемыхОбъектов Цикл 
				Если ИзXMLТипа(ПолучитьXMLТип(ЧтениеXML)) = Тип(ОбновляемыйОбъект) Тогда 
					НеобходимоДобавитьРеквизит = Истина;
					ИмяОбновляемогоЭлементаXML = ПолучитьXMLТип(ЧтениеXML).ИмяТипа;
					ИмяОбновляемогоЭлемента = ОбновляемыйОбъект;
				КонецЕсли;
			КонецЦикла;
			
			Если НеобходимоДобавитьРеквизит Тогда 
				
				ТабличныеЧасти = Метаданные.НайтиПоТипу(Тип(ИмяОбновляемогоЭлемента)).ТабличныеЧасти;
				Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл 
					Если ЧтениеXML.Имя = ТабличнаяЧасть.Имя Тогда 
						ДобавляемыеРеквизиты = ДобавляемыеМетаданные.НайтиСтроки(Новый Структура("ОбъектМетаданных", ИмяОбновляемогоЭлемента));
						Для Каждого Реквизит Из ДобавляемыеРеквизиты Цикл 
							ДобавитьНовыйРеквизит(ЗаписьXML, Реквизит.Реквизит, Реквизит.Значение);
						КонецЦикла;
						
						НеобходимоДобавитьРеквизит = Ложь;
					КонецЕсли;
				КонецЦикла;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента(ЧтениеXML.Имя);
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					ЗаписьXML.ЗаписатьАтрибут(ЧтениеXML.Имя, ЧтениеXML.Значение);
				КонецЦикла;
				
				ДобавляемыеРеквизиты = ДобавляемыеМетаданные.НайтиСтроки(Новый Структура("ОбъектМетаданных", ИмяОбновляемогоЭлемента));
				Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл 
					Если ЧтениеXML.Имя = Реквизит.Реквизит Тогда 
						ДобавитьНовыеАтрибутыРеквизиту(ЗаписьXML, Реквизит.Атрибуты);
						НеобходимоДобавитьРеквизит = Ложь;
					КонецЕсли;
				КонецЦикла;
				
			Иначе 
				ЗаписьXML.ЗаписатьНачалоЭлемента(ЧтениеXML.Имя);
				
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					ЗаписьXML.ЗаписатьАтрибут(ЧтениеXML.Имя, ЧтениеXML.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда 
			ЗаписьXML.ЗаписатьТекст(ЧтениеXML.Значение);
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
			
			Если НеобходимоДобавитьРеквизит И ЧтениеXML.Имя = ИмяОбновляемогоЭлементаXML Тогда 
				ДобавляемыеРеквизиты = ДобавляемыеМетаданные.НайтиСтроки(Новый Структура("ОбъектМетаданных", ИмяОбновляемогоЭлемента));
				Для каждого Реквизит Из ДобавляемыеРеквизиты Цикл 
					ДобавитьНовыйРеквизит(ЗаписьXML, Реквизит.Реквизит, Реквизит.Значение);
				КонецЦикла;
				
				НеобходимоДобавитьРеквизит = Ложь;
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	ЗаписьXML.Закрыть();
	
	Возврат ОбновленныйФайлВыгрузки;
	
КонецФункции

&НаСервере
Процедура ДобавитьНовыйРеквизит(ЗаписьXML, Наименование, Значение)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(Наименование);
	ЗаписьXML.ЗаписатьТекст(Значение);
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеАтрибутыРеквизиту(ЗаписьXML, Атрибуты)
	
	Для каждого Атрибут Из Атрибуты Цикл 
		ЗаписьXML.ЗаписатьАтрибут(Атрибут.Представление, Атрибут.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьДобавляемыеМетаданные(ВерсияПриложенияВыгрузка)
	//
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

