
#Область ПрограммныйИнтерфейс

Процедура ПередЗакрытиемФормыНастроек(Форма, Отказ) Экспорт
	
	Если Форма.Модифицированность И НЕ Форма.ОповеститьОбИзмененииЗначенийНастроек Тогда
		
		Отказ = Истина;
		
		ДополнительныеПараметры = Новый Структура("Форма", Форма);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПередЗакрытием", ЭтотОбъект, ДополнительныеПараметры);
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	ПервыйЗапуск = ОбщегоНазначенияВызовСервера.ОбработатьЗапускПриложения();
	
	Если ПервыйЗапуск Тогда
		
		// ПодключаемоеОборудование
		МенеджерОборудованияВызовСервераПереопределяемый.ОбновлениеБиблиотеки();
		// Конец ПодключаемоеОборудование
		
		//РезервноеКопированиеКлиент.УстановитьПутьРезервногоКопированияПриПервомЗапуске();
		
		ОбщегоНазначенияВызовСервера.УстановитьРежимСинхронизацииДемоверсии();
		
		ПодключитьОбработчикОжидания("Подключаемый_НастроитьРежимСинхронизации", 0.2, Истина);
		
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ОбновитьПриложение();
	ОбщегоНазначенияВызовСервера.УстановитьОриентациюЭкрана();
	
КонецПроцедуры

Процедура УстановитьРасширенныйЗаголовокПриложения()Экспорт
	
	ЗаголовокПриложения = Формат(ОбщегоНазначенияВызовСервера.ПолучитьПараметрСеанса("НомерТТ"),"ЧЦ=4; ЧГ=")
	+" "+ОбщегоНазначенияВызовСервера.ПолучитьПараметрСеанса("Подразделение");
	КлиентскоеПриложение.УстановитьЗаголовок(ЗаголовокПриложения);

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОповещениеПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Форма.СохранитьНаКлиенте();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Форма.Модифицированность = Ложь;
		Форма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры


Процедура СообщитьОбОшибке(Знач ТекстПредупреждения, Отказ = Ложь, Знач Заголовок = "", Знач ТаймАут = 0) Экспорт
	
	Если ЗначениеЗаполнено(Заголовок) Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения, ТаймАут, Заголовок);
	Иначе
		ПоказатьПредупреждение(,, ТаймАут, ТекстПредупреждения);
	КонецЕсли;
	Если Отказ = Ложь Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Функция СделатьФото()Экспорт
	
	Данные = Неопределено;
	
	
	#Если МобильноеПриложениеКлиент Тогда 
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			
			ФайлКартинки = ПолучитьИмяВременногоФайла("jpg");
			Запуск = Новый ЗапускПриложенияМобильногоУстройства("android.media.action.IMAGE_CAPTURE");
			
			Запуск.ДополнительныеДанные.Добавить("output", "file://" + ФайлКартинки, "Uri");
			
			Рез = Запуск.Запустить(Истина);
			Если Рез = 0 Тогда
				Возврат Неопределено;
			Иначе
			//	  //Данные = Новый ДвоичныеДанные(ФайлКартинки);
			//	  НовыйФайлКартинки = ПолучитьИмяВременногоФайла("JPEG");
			//
			//	  Картинка = Новый Картинка(ФайлКартинки);
			//	  Картинка.Записать(НовыйФайлКартинки);
			//	  УдалитьФайлы(ФайлКартинки);
				  
				 // Возврат НовыйФайлКартинки;
				 
				Возврат ФайлКартинки; 
				  
			КонецЕсли;
			//
			//
			//Данные = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя,,100); 
			//Возврат Данные.ПолучитьДвоичныеДанные(); 
		Иначе 
			Сообщить("Данное устройство не поддерживает фотоснимок!") 
		КонецЕсли; 
		
	#КонецЕсли
	
	Возврат Данные;
КонецФункции

Процедура ВывестиПДФ_НаПечать(ДанныеПечати)Экспорт

	
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла("PDF");
	Если ТипЗнч(ДанныеПечати) = Тип("ТабличныйДокумент") Тогда
		ДанныеПечати.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF);
	Иначе
		ДанныеПечати.Записать(ПолноеИмяФайла);
	КонецЕсли;
	
	
	
	// Вызываем системный просмотрщик операционной системы (универсально для Windows и Android)
	Попытка
		// Использование Асинх-метода в 8.3.27 работает более гладко с правами ОС
		ЗапуститьПриложениеАсинх(ПолноеИмяФайла);
	Исключение
		ПоказатьПредупреждение(, "Не удалось открыть файл: " + ОписаниеОшибки());
	КонецПопытки;
	
	
	//ПолноеИмяФайла = ПолучитьИмяВременногоФайла("PDF");
	//Если ТипЗнч(ДанныеПечати) = Тип("ТабличныйДокумент") Тогда
	//	ДанныеПечати.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF);
	//Иначе
	//	ДанныеПечати.Записать(ПолноеИмяФайла);
	//КонецЕсли;
	//ЗапуститьПриложение(ПолноеИмяФайла,,Истина);
	
	//#КонецЕсли   
	
КонецПроцедуры


// Создает полную копию структуры, соответствия, массива, списка или таблицы значений, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// См. ОбщегоНазначения.СкопироватьРекурсивно
//
// Параметры:
//  Источник - Структура
//           - ФиксированнаяСтруктура
//           - Соответствие
//           - ФиксированноеСоответствие
//           - Массив
//           - ФиксированныйМассив
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево
//                    - Неопределено - если Истина - фиксировать,
//                          если Ложь - снять фиксацию, если Неопределено - не изменять.
//
// Возвращаемое значение:
//  Структура - , ФиксированнаяСтруктура,
//  Соответствие
//  ФиксированноеСоответствие
//  Массив
//  ФиксированныйМассив
//  СписокЗначений - копия объекта, переданного в параметре Источник.
//
Функция СкопироватьРекурсивно(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("Структура")
		Или ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Приемник = ОбщегоНазначенияСлужебныйКлиент.СкопироватьСтруктуру(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Соответствие")
		Или ТипИсточника = Тип("ФиксированноеСоответствие") Тогда
		Приемник = ОбщегоНазначенияСлужебныйКлиент.СкопироватьСоответствие(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Массив")
		Или ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Приемник = ОбщегоНазначенияСлужебныйКлиент.СкопироватьМассив(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = ОбщегоНазначенияСлужебныйКлиент.СкопироватьСписокЗначений(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции



//Функция ИнициализироватьВнешнююКомпонентуRSDriver () Экспорт
//	
//	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда

//		УстановитьВнешнююКомпоненту ("ОбщийМакет.ДрайверRightScanУстройстваВвода");
//		
//		Если ПодключитьВнешнююКомпоненту("ОбщийМакет.ДрайверRightScanУстройстваВвода", "RSDriver", ТипВнешнейКомпоненты.Native) Тогда
//			
//			Попытка
//				
//				глВКRSDriver = Новый ("AddIn.RSDriver.RSDriver");
//				
//				ИмяДрайвера         = "";
//				ОписаниеДрайвера    = "";
//				ДоступныеУстройства = "";
//				Версия = 0;
//				ТипВК  = ""; 
//				Загружен = Ложь;
//				Адрес = "";
//				
//				глВКRSDriver.ПолучитьОписание(ИмяДрайвера,ОписаниеДрайвера,ДоступныеУстройства,Версия,ТипВК,Загружен,Адрес);
//				//Сообщить(ДоступныеУстройства);
//				
//		  		Возврат Истина;  
//			Исключение
//				Сообщить(ОписаниеОшибки());
//		  		Сообщить("Ошибка создания класса RSDriver");
//			Конецпопытки;
//			
//		Иначе
//			Сообщить("Компонента RSDriver не загружена");
//		КонецЕсли;

//  	#КонецЕсли
//  
//  Возврат Ложь;

//КонецФункции

