


Функция ПолучитьДанныеPKG(ШК,БезТоваров = Ложь) Экспорт  
	
	текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/PKG?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК+"&aktsep="+?(БезТоваров,"0","1");
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса,"Дата");
		
	Возврат РезОтвет;	
	
КонецФункции

Функция ПолучитьДанныеPKG_На_РК(ШК) Экспорт 
	
	текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/PKG_RK?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса,"Дата");
		
	Возврат РезОтвет;	

КонецФункции




Функция ПолучитьСписокДокументовPKG(ТипДокумента)Экспорт
	
	Если ТипДокумента = Справочники.ТипыДокументов.БезакцептныйПриемPKG Тогда 
		текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/PKGRC?uuidcom=0&bpPKG=1"; 
	Иначе
		текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/PKGRC?uuidcom=0&bpPKG=0";
	КонецЕсли;
	
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса,"Дата");
	
	Возврат РезОтвет;	

КонецФункции

Функция ВыгрузитьДокументПриемРЦ(СтруктураДокумент,БезТоваров = Ложь) Экспорт  
	
	текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/PKGloadRC"+"?aktsep="+?(БезТоваров,"0","1");
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумент,текстЗапроса);
		
	Возврат РезОтвет;	
	
КонецФункции

Функция ЗавершитьЗаданиеПросмотрАнкеты(ИД_Задача) Экспорт  
	
	текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/anketa?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&uuidz="+ИД_Задача;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
		
	Возврат РезОтвет;	
	
КонецФункции

Функция ПолучитьДанныеПечатиВыдачиДС(ИД_Задача) Экспорт  
	
	текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/pvds?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&uuidz="+ИД_Задача;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
		
	Возврат РезОтвет;	
	
КонецФункции

Функция ОтправитьТокенНаСервер(ID_Устройства,Модель,Токен)Экспорт 
	
	СтруктураДокумент = Новый Структура;
	СтруктураДокумент.Вставить("token",Токен);
	СтруктураДокумент.Вставить("device_id",ID_Устройства);
	СтруктураДокумент.Вставить("model",Модель);
	
	
	текстЗапроса = "/Roznitsa/"+ПараметрыСеанса.UUID+"/token?uuidcom=0";
	РезОтвет = КомплектовщикТК.ОтправитьНаСервер(СтруктураДокумент,текстЗапроса);
		
	Возврат РезОтвет;	


КонецФункции
