&НаКлиенте
Перем ВыполняетсяЗакрытие;




&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек(Отказ)
	
	
	Параметры.Свойство("ТипДокумента",ТипДокумента);
	
	Параметры.Свойство("ДокументUUID",ДокументUUID);
	
	БазаПодключения = Перечисления.БазаПодключения.ТК;
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);	
	ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбновитьПодразделение();
	ОбновитьСотрудника();
	
	УстановитьДоступностьПоНастройкам();	
	

	ЗаполнитьДанныеПоСчетчикам(Отказ);
	
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоСчетчикам(Отказ)
	Если НЕ Инициализирован Тогда
		Возврат;
	КонецЕсли;

	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьMarketDoc(ТипДокумента.ИмяПредопределенныхДанных);
	Если  ДанныеДокумента.Результат = Ложь Тогда
		Отказ = Истина;
		Если НЕ ПустаяСтрока(ДанныеДокумента.ОписаниеОшибки) Тогда
			Сообщить(ДанныеДокумента.ОписаниеОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	сч = 1;
	Для Каждого СтрСч Из ДанныеДокумента.Ответ Цикл
		нСтр = ТаблицаСчетчики.Добавить();
		нСтр.Номер = сч;
		ЗаполнитьЗначенияСвойств(нСтр,СтрСч);
		сч =  сч + 1;
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьПоНастройкам()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТаблицаСчетчики,ГруппаФото,ДекорацияСчетчик,Сохранить", "Видимость", ПользовательИнициализирован);

	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДобавитьВдокумент", "Видимость",
	//ВводкКоличества
	//);

	//
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы", "Видимость",
	//Инициализирован И ПользовательИнициализирован  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	//);
	//
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Контрагент", "Видимость",
	//Инициализирован И ПользовательИнициализирован  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() И НЕ КонтрагентВыбран
	//);
	
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьПодразделение()
	
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Устройство не инициализировано";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;

	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();
	
	

	
КонецПроцедуры


&НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Пользователь не инициализирован";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		Сотрудник = "";
		ПользовательИнициализирован = Ложь;
		
	Иначе
		Если ПараметрыСеанса.Сотрудник <> Элементы.СообщениеИнициализацииПользователя.Заголовок Тогда
			Сотрудник = "";
		КонецЕсли;
		

		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
		
	КонецЕсли;
	
	
	
	
	УстановитьДоступностьПоНастройкам();

	
КонецПроцедуры







&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	

	НастроитьФормуПоЗначениямНастроек(Отказ);
	НастроитьФормуПоОриентацииЭкрана();

КонецПроцедуры






///События формы
&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


&НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход") Тогда
		ДопПарметрыФормы.Вставить("СотрудникЗУП");
	КонецЕсли;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
	
КонецПроцедуры


&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;

	ВыполняетсяЗакрытие = Ложь;


КонецПроцедуры







&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ВыполняетсяЗакрытие Тогда
		ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
	Иначе
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрыть документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПользовательИнициализирован Тогда
		
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);
		
		
		Если Результат.Результат Тогда
			Оповестить("ИзмененСотрудник");
		Иначе
			Сообщить("Необходима авторизация пользователя (ТКС)");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьФото(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда 
		ТекСтрока = Команда.ИспользуемаяТаблица.ТекущиеДанные;
		Если ТекСтрока = Неопределено Тогда
			Сообщить("Потрібно вибрати лічильник");
			Возврат;
		 КонецЕсли;
		 
		Если СредстваМультимедиа.ПоддерживаетсяФотоснимок(ТипКамерыУстройства.Задняя) Тогда
			Результат =  СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя,,100,Истина,,Новый ОтметкаНаФотоснимке(Истина,,));
			Если НЕ Результат = Неопределено Тогда
								
				Двоичные = Результат.ПолучитьДвоичныеДанные();
				ПутьФото = ПоместитьВоВременноеХранилище(Двоичные,Новый УникальныйИдентификатор);
				ТекСтрока.Фото = ПутьФото;
				ТекСтрока.ЕстьФото = Истина;
				
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЕстьФото", "Видимость",  Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНетФото", "Видимость",  Ложь);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЕстьФото", "Видимость",  Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНетФото", "Видимость",  Истина);

			КонецЕсли;
			
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСчетчикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСчетчикиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаСчетчики.ТекущиеДанные;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЕстьФото", "Видимость",  ТекущиеДанные.ЕстьФото);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаНетФото", "Видимость",  НЕ ТекущиеДанные.ЕстьФото);
	ПутьФото = ТекущиеДанные.Фото;
	Элементы.ДекорацияСчетчик.Заголовок = ТекущиеДанные.Счетчик  +" "+Формат(ТекущиеДанные.Показание,"ЧЦ=15; ЧС=; ЧН=Введіть!; ЧГ=");
	НомерСтрокиДляПодсветки = ТекущиеДанные.Номер;
КонецПроцедуры


&НаСервере
Функция СохранитьНаСервере()
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
	СтруктураДокумента.Вставить("ДокументUUID", ДокументUUID);
	
	мСчетчики = Новый Массив;
	
	Для Каждого стрСчетчики Из ТаблицаСчетчики Цикл 
		Если стрСчетчики.ЕстьФото Тогда
			СодержимоеФайла	 = Base64Строка(ПолучитьИзВременногоХранилища(стрСчетчики.Фото));
			мСчетчики.Добавить(Новый Структура("СчетчикИД,Фото,Показание",стрСчетчики.СчетчикИД,СодержимоеФайла,стрСчетчики.Показание));
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Счетчики", мСчетчики);

	Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
	
	Возврат Рез;

КонецФункции


&НаКлиенте
Процедура Сохранить(Команда)
	
	стрВопрос = "";
	счВсего = 0;
	счБезФото = 0;
	счБезПоказания = 0;
	Для Каждого стрСчетчик  Из ТаблицаСчетчики Цикл 
		счВсего = счВсего + 1;
		Если стрСчетчик.ЕстьФото = Ложь Тогда
			счБезФото = счБезФото +1;
			стрВопрос = стрВопрос + "Лічильник "+  стрСчетчик.Счетчик + " немає фото"+Символы.ПС;
		КонецЕсли;
		Если стрСчетчик.ЕстьНомер = Ложь Тогда
			счБезПоказания = счБезПоказания +1;
			стрВопрос = стрВопрос + "Лічильник "+  стрСчетчик.Счетчик + "  немає свідчення"+Символы.ПС;

		КонецЕсли;
		
	КонецЦикла;
	Если счВсего = счБезФото ИЛИ счВсего = счБезПоказания Тогда
		Сообщить(стрВопрос);
		Возврат;
	КонецЕсли;

	ПоказатьВопрос(Новый ОписаниеОповещения("ОповещенияОтправки",ЭтотОбъект),стрВопрос +"Вивантажити дані на сервер?",РежимДиалогаВопрос.ДаНет);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияОтправки(Результат, Параметры)Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыгрузитьДокументНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументНаКлиенте()
	
	Рез = СохранитьНаСервере();
	Если Рез.Результат Тогда
		Сообщить("Фото вивантажено успішно");
		Оповестить("ОбновитьЗадания");

		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		Если ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
			Сообщить("Помилка надсилання фото!");
		Иначе
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСчетчикНажатие(Элемент)
	ТекущиеДанные = Элементы.ТаблицаСчетчики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран счетчик");
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ТекСчетчик",ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект,ДопПараметры);
	ПоказатьВводЧисла(Оповещение, ТекущиеДанные.Показание, "Введите показания "+ТекущиеДанные.Счетчик,,0);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Число, Параметры) Экспорт
    Если НЕ Число = Неопределено Тогда
		Параметры.ТекСчетчик.Показание = Число;
		Параметры.ТекСчетчик.ЕстьНомер = Истина;
		
		Элементы.ДекорацияСчетчик.Заголовок = Параметры.ТекСчетчик.Счетчик +" "+Формат(Число,"ЧЦ=15; ЧС=; ЧН=Введіть!; ЧГ=");
		
    КонецЕсли;
КонецПроцедуры;