
&НаКлиенте
Процедура Готово(Команда)
	
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные;
	Закрыть(Новый Структура("UUID,Name",ТекДанные.UUID,ТекДанные.Name));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	кUUID =	Параметры.UUID;
	кName =	Параметры.Name;	
	
	й =  кUUID.Количество();
	
	Для к=0 По й-1 Цикл 
		нСтрока = Контрагенты.Добавить();
		нСтрока.UUID =кUUID[к];
		нСтрока.Name =кName[к];
	КонецЦикла;
	

	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыNameНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные;

	Закрыть(Новый Структура("UUID,Name",ТекДанные.UUID,ТекДанные.Name));

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыNameНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные;

	Закрыть(Новый Структура("UUID,Name",ТекДанные.UUID,ТекДанные.Name));

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.Контрагенты.ТекущиеДанные;
	
	Закрыть(Новый Структура("UUID,Name",ТекДанные.UUID,ТекДанные.Name));

КонецПроцедуры
