&НаКлиенте
Перем ВыполняетсяЗакрытие;



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
		
	НастроитьФормуПоЗначениямНастроек();

	НастроитьФормуПоОриентацииЭкрана();
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;

	ВыполняетсяЗакрытие = Ложь;

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
			
	КонецЕсли;

КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);

	
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) );

	
	НастроитьЭлементыАсинхронногоСканера();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканирование,ЗавершитьСканирование", "Видимость",Ложь);

	
	
	
КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры


&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры


&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

 &НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПШК, Параметры) Экспорт
	Если ПустаяСтрока(ПШК) Тогда
		Возврат;
	КонецЕсли;
	ПолученныйШтрихкод = СтрЗаменить(ПШК,"\","_");
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда

		ОчиститьСообщения();
		Если ПустаяСтрока(ДокументUUID) Тогда
			ДанныеПоНакладной =  ИнтеграцияТК_Клиент.ПолучитьДанныеПоСканировкеТабак(ПолученныйШтрихкод,,,"1");
			
			Если ДанныеПоНакладной.Результат Тогда
				
				
				СтруктураДокумента = ДанныеПоНакладной.Ответ;
				Элементы.ДекорацияНакладная.Заголовок = "Накладная №"+ СтруктураДокумента.НомерДокумента+" от "+СтруктураДокумента.ДатаДокумента
				+Символы.ПС +СтруктураДокумента.Контрагент
				+Символы.ПС +СтруктураДокумента.АдресДоставки;
				
				БлокБАТ_План = СтруктураДокумента.СканированиеБАТ.КвоЕдУпаковкиВсего;
				ЯщикБАТ_План = СтруктураДокумента.СканированиеБАТ.КвоЕдЯщиковВсего;
				
				БлокФМ_План = СтруктураДокумента.СканированиеФМ.КвоЕдУпаковкиВсего;
				ЯщикФМ_План = СтруктураДокумента.СканированиеФМ.КвоЕдЯщиковВсего;

				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПоискНакладной", "Видимость",Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканирование", "Видимость",Истина);
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаБАТ", "Видимость",БлокБАТ_План+ЯщикБАТ_План <> 0);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "БлокБАТ_План,БлокБАТ_Факт", "Видимость",БлокБАТ_План <> 0);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЯщикБАТ_План,ЯщикБАТ_Факт", "Видимость",ЯщикБАТ_План <> 0);

				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаФМ", "Видимость",БлокФМ_План+ЯщикФМ_План <> 0);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "БлокФМ_План,БлокФМ_Факт", "Видимость",БлокФМ_План <> 0);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЯщикФМ_План,ЯщикФМ_Факт", "Видимость",ЯщикФМ_План <> 0);

				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЗавершитьСканирование", "Видимость",БлокФМ_План+ЯщикФМ_План+БлокБАТ_План+ЯщикБАТ_План <> 0);
			
				ДокументUUID = ПолученныйШтрихкод;
			Иначе
				Сообщить("Ошибка, "+ ДанныеПоНакладной.ОписаниеОшибки);
			КонецЕсли;
		Иначе
			СтрокаШтрихКода = ПШК;			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСканирование(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ВыполняетсяЗакрытие Тогда
		
	ИначеЕсли Не ПустаяСтрока(ДокументUUID) Тогда
		
		Отказ = Истина;
		ТекстЗакытия="";
		
		ВсегоЯщПлан   = ЯщикБАТ_План + ЯщикФМ_План ; 
		ВсегоБлокПлан = БлокФМ_План + БлокБАТ_План;
		ВсегоЯщФакт   = ЯщикБАТ_Факт+ЯщикФМ_Факт;
		ВсегоБлокФакт = БлокБАТ_Факт+БлокФМ_Факт;
		Если ВсегоЯщПлан<>ВсегоЯщФакт ИЛИ ВсегоБлокПлан<>ВсегоБлокФакт Тогда
			ТекстЗакытия = "Не все данные отсканированы, завершить?";
		Иначе
			ТекстЗакытия = "Завершить сканирование документа?";
		КонецЕсли;
		
			
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),ТекстЗакытия,РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если не ПустаяСтрока(ДокументUUID) Тогда
			ДанныеПоНакладной =  ИнтеграцияТК_Клиент.ПолучитьДанныеПоСканировкеТабак(ДокументUUID,,,"2");
			Если Не ДанныеПоНакладной.Результат Тогда
				Сообщить(ДанныеПоНакладной.ОписаниеОшибки);
			Иначе
				ПоказатьПредупреждение(,"Накладная сохранена");
				ВыполняетсяЗакрытие = Истина;  
				Закрыть();
			КонецЕсли;
		Иначе
			ВыполняетсяЗакрытие = Истина;
			Закрыть();
		КонецЕсли;

	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		
		Если не ПустаяСтрока(ДокументUUID) Тогда
			ДанныеПоНакладной =  ИнтеграцияТК_Клиент.ПолучитьДанныеПоСканировкеТабак(ДокументUUID,,,"3");
			
			Если Не ДанныеПоНакладной.Результат Тогда
				Сообщить(ДанныеПоНакладной.ОписаниеОшибки);
			Иначе
				ВыполняетсяЗакрытие = Истина;
				Закрыть();
			КонецЕсли;
			
			
		Иначе
			ВыполняетсяЗакрытие = Истина;
			Закрыть();
		КонецЕсли;
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	ПолученныйШтрихкод = СтрокаШтрихКода;
//	ПолученныйШтрихкод = СтрЗаменить(СтрокаШтрихКода,"\","_");
	Если ПустаяСтрока(ПолученныйШтрихкод)Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПоШтрихКоду =  ИнтеграцияТК_Клиент.ПолучитьДанныеПоСканировкеТабак(ДокументUUID,ПолученныйШтрихкод,Ложь,"select");
	Если ДанныеПоШтрихКоду.Результат Тогда
		
		
		Ответ = ДанныеПоШтрихКоду.Ответ;	
		
		Если Ответ.СоставнойШтрихКод = Ложь И Ответ.ТолькоЦифрыШК Тогда
			Сообщить("Отсканируйте QR - код");
			Возврат;
		КонецЕсли;
		
		
		ПарамУп ="";
		Если Ответ.ЭтоШКБлока Тогда
			ПарамУп = "Блок";
		ИначеЕсли  Ответ.ЭтоШККороба Тогда
			ПарамУп = "Ящик";
		Иначе
			Если ЯщикФМ_План<> ЯщикФМ_Факт Тогда
				ПарамУп = "Ящик";
				
			ИначеЕсли БлокФМ_План<> БлокФМ_Факт Тогда
				ПарамУп = "Блок";
				
			Иначе
				Сообщить("Неизвестный штри код");
				Возврат;
			КонецЕсли
			
		КонецЕсли;
		ПаоамПр ="";
		Если Ответ.Производитель="БАТ" Тогда
			ПаоамПр = ПаоамПр+"БАТ";
		ИначеЕсли Ответ.Производитель="ФМ" Тогда
			ПаоамПр= ПаоамПр+"ФМ";
		Иначе
			Сообщить("Неизвестный производитель");
			Возврат;
		КонецЕсли;
		
		Если ПарамУп ="" Тогда
			Если ЭтотОбъект["Блок"+ПаоамПр+"_План"] <> 0 И ЭтотОбъект["Блок"+ПаоамПр+"_План"]<ЭтотОбъект["Блок"+ПаоамПр+"Факт"] Тогда
				ПарамУп = "Блок";
			ИначеЕсли ЭтотОбъект["Ящик"+ПаоамПр+"_План"] <> 0 И ЭтотОбъект["Ящик"+ПаоамПр+"_План"]<ЭтотОбъект["Ящик"+ПаоамПр+"Факт"] Тогда
				ПарамУп = "Ящик";
				
			Иначе
				Сообщить("Неизвестная упаковка");
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		ПармФакт  = ПарамУп+ПаоамПр+"_Факт";
		ПарамПлан = ПарамУп+ПаоамПр+"_План";
		
		Если ЭтотОбъект[ПармФакт]< ЭтотОбъект[ПарамПлан] Тогда
			ДанныеПоШтрихКоду =  ИнтеграцияТК_Клиент.ПолучитьДанныеПоСканировкеТабак(ДокументUUID,ПолученныйШтрихкод,Ложь,"insert");
			Если ДанныеПоШтрихКоду.Результат Тогда
				ЭтотОбъект[ПармФакт] = ЭтотОбъект[ПармФакт]+1;
			Иначе
				Сообщить(ДанныеПоШтрихКоду.ОписаниеОшибки);	
			КонецЕсли;
		Иначе
			Сообщить(ПарамУп +" "+ ПаоамПр+" отсканированы");
			
		КонецЕсли;
		 СтрокаШтрихКода = "";
	Иначе
		Сообщить(ДанныеПоШтрихКоду.ОписаниеОшибки);	
	КонецЕсли;
	

КонецПроцедуры


