

Функция ЕстьДанныеВРаботе(ДокументUUID,ТипДокумента)Экспорт
	
	флВозврат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ДанныеВРаботе КАК ДанныеВРаботе
		|ГДЕ
		|	ДанныеВРаботе.ДокументUUID = &ДокументUUID
		|	И ДанныеВРаботе.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ДокументUUID", ДокументUUID);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		флВозврат = Ложь;
	КонецЕсли;
	Возврат флВозврат;
КонецФункции

Процедура ОчиститьДанныеВРаботе(ДокументUUID,ТипДокумента)Экспорт
	
	Если ДокументЗаписываетДанныеВРегистр(ТипДокумента) Тогда
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТипДокумента);
		
		Набор.Записать();
		
	КонецЕсли;

КонецПроцедуры

Функция ДокументЗаписываетДанныеВРегистр(ТипДокумента) 

	Если  ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТБД 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеИН 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТНП 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПеремещениеТоваров
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеВФ
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда   
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

	

Процедура ДобавитьЗапись(ТекСтрока)Экспорт
	
	Если  ДокументЗаписываетДанныеВРегистр(ТекСтрока.ТипДокумента) Тогда
		
		Набор = РегистрыСведений.ДанныеВРаботе.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ТекСтрока.ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТекСтрока.ТипДокумента);
		Набор.Отбор.Артикул.Установить(ТекСтрока.Артикул);
		Набор.Отбор.МРЦ.Установить(ТекСтрока.МРЦ);
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,ТекСтрока);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

