
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстЗаголовка = НСтр("ru = '%ПредставлениеНомера% от %ПредставлениеДата%'");
	
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеНомера%", 
		ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(Данные.Ссылка.Номер));
		
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеДата%",
		Формат(Данные.Ссылка.Дата,"ДФ=dd.MM; ДЛФ=D"));
	
	Представление = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает список чеков, которые содержат переданную номенклатуру
// 
// Возвращаемое значение:
//   Массив   - пустой массив, если чеков с номенклатурой нет.
//
Функция СписокДокументовСодержащихНоменклатуру(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЧеков = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивЧеков;
	
КонецФункции

// Возвращает список чеков, которые содержат переданную номенклатуру
// 
// Возвращаемое значение:
//   Массив   - пустой массив, если чеков с номенклатурой нет.
//
Функция ПолучитьЧекПоЗаказуКлиента(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Чек.Ссылка
		|ИЗ
		|	Документ.Чек КАК Чек
		|ГДЕ
		|	Чек.ЗаказКлиента = &ЗаказКлиента
		|	И Чек.СтатусЧека <> ЗНАЧЕНИЕ(Перечисление.СтатусыЧеков.Аннулирован)";
		
	Запрос.УстановитьПараметр("ЗаказКлиента", Заказ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСостояниеЗаказовНаСегодня() Экспорт
	//
	//Дата = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	//
	//Результат = Новый Структура;
	//Результат.Вставить("НеСогласовано", 0);
	//Результат.Вставить("Согласовано", 0);
	//Результат.Вставить("Выполнено", 0);
	//Результат.Вставить("Отменено", 0);
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК НеСогласовано,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Согласовано,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Выполнен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Выполнено,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК Отменено
	//|ПОМЕСТИТЬ Т
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	ЗаказКлиента.ЖелаемаяДатаПокупки МЕЖДУ &ДатаС И &ДатаПо
	//|	И ЗаказКлиента.Проведен
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Выполнен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)
	//|			ТОГДА 1
	//|		ИНАЧЕ 0
	//|	КОНЕЦ
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	ЗаказКлиента.ЖелаемаяДатаПокупки < &ДатаС
	//|	И ЗаказКлиента.Проведен
	//|	И ЗаказКлиента.СтатусЗаказа В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован), ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(СУММА(Т.НеСогласовано), 0) КАК НеСогласовано,
	//|	ЕСТЬNULL(СУММА(Т.Согласовано), 0) КАК Согласовано,
	//|	ЕСТЬNULL(СУММА(Т.Выполнено), 0) КАК Выполнено,
	//|	ЕСТЬNULL(СУММА(Т.Отменено), 0) КАК Отменено
	//|ИЗ
	//|	Т КАК Т";
	//
	//Запрос.УстановитьПараметр("ДатаС",  НачалоДня(Дата));
	//Запрос.УстановитьПараметр("ДатаПо", КонецДня(Дата));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	//	
	//КонецЕсли;
	//
	//Возврат Результат;
	//
КонецФункции

Функция ПолучитьСостояниеЗаказовНаЗавтра() Экспорт
	//
	//Дата = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату() + 86400;
	//
	//Результат = Новый Структура;
	//Результат.Вставить("НеСогласовано", 0);
	//Результат.Вставить("Согласовано", 0);
	//Результат.Вставить("Выполнено", 0);
	//Результат.Вставить("Отменено", 0);
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК НеСогласовано,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Согласован)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК Согласовано,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Выполнен)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК Выполнено,
	//|	ЕСТЬNULL(СУММА(ВЫБОР
	//|				КОГДА ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)
	//|					ТОГДА 1
	//|				ИНАЧЕ 0
	//|			КОНЕЦ), 0) КАК Отменено
	//|ИЗ
	//|	Документ.ЗаказКлиента КАК ЗаказКлиента
	//|ГДЕ
	//|	ЗаказКлиента.ЖелаемаяДатаПокупки МЕЖДУ &ДатаС И &ДатаПо
	//|	И ЗаказКлиента.Проведен";
	//
	//Запрос.УстановитьПараметр("ДатаС",  НачалоДня(Дата));
	//Запрос.УстановитьПараметр("ДатаПо", КонецДня(Дата));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	
	//	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	//	
	//КонецЕсли;
	//
	//Возврат Результат;
	
КонецФункции


Функция ЗаказыКВыгрузке() Экспорт
	
	МассивДокументов = Новый Массив;
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоАвтономныйРежим() Тогда
		
		Возврат МассивДокументов;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Проведен
	|	И ЗаказКлиента.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.ГотовКОбмену)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивДокументов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивДокументов;
	
КонецФункции



#КонецОбласти

#КонецЕсли

