
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЦенаВключаетНДС = ЗначениеНастроекПовтИсп.ЦенаВключаетНДС();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуДокумента();
	
	Если НЕ ЗначениеЗаполнено(НомерЗаказа) Тогда
		НомерЗаказа = Номер;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтатусЗаказа) Тогда
		СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	КонецЕсли;
	
	 ПредставлениеЗаказа = "№"+Строка(НомерЗаказа)+" - "+" от " +Формат(Дата,"ДФ=dd.MM.yyyy") + " "+ Строка(Контрагент);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЗаказКлиента.Дата КАК Дата,
	                |	ЗаказКлиента.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.ЗаказКлиента КАК ЗаказКлиента
	                |ГДЕ
	                |	ЗаказКлиента.СтатусЗаказа = &СтатусЗаказа
	                |	И ЗаказКлиента.АдресДоставки = &АдресДоставки
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("АдресДоставки",АдресДоставки);
	Запрос.УстановитьПараметр("СтатусЗаказа",Перечисления.СтатусыЗаказовКлиентов.Отправлен);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивУдаляемыДокументов = Новый Массив;
	НачДня = НачалоДня(ТекущаяДата());
	сч = 0;
	Пока Выборка.Следующий() Цикл 
		сч = сч+1;
		Если сч = 5 Тогда
			Если Выборка.Дата< НачДня Тогда
				МассивУдаляемыДокументов.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивУдаляемыДокументов.Количество() > 0 Тогда
		УдалитьОбъекты(МассивУдаляемыДокументов);
	КонецЕсли;
	

	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.ВРаботе;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьСуммуДокумента()
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#КонецЕсли