&НаКлиенте
Перем ВыполняетсяЗакрытие;




////Служебные   
 &НаСервереБезКонтекста
Функция ДоступнаяНоменклатураВозвратРЦ_НаСеревере(АртикулТовара)
	
	МенЗаписи =	РегистрыСведений.ДоступнаяНоменклатураДляВозвратара.СоздатьМенеджерЗаписи();
	МенЗаписи.Артикул = АртикулТовара;
	МенЗаписи.Прочитать();
	Если МенЗаписи.Выбран() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
 

&НаКлиенте
Функция ДоступныеАртикулаНаВозвратРЦ(АртикулТовара)   
	
	Возврат ДоступнаяНоменклатураВозвратРЦ_НаСеревере(АртикулТовара);
	//Массив = Новый Массив;
	//Массив.Добавить("249990");  
	//Массив.Добавить("9056");  
	//Массив.Добавить("9392");
	//Массив.Добавить("9153");
	//Массив.Добавить("764921");
	//Массив.Добавить("719775");
	//  Массив.Добавить("720087");
	//Массив.Добавить("9015");   
	//Массив.Добавить("9025"); 
	//Массив.Добавить("764549");
	//Массив.Добавить("764550");  
	//Массив.Добавить("9055");   
	//Массив.Добавить("761600");

	//Рез = Массив.Найти(АртикулТовара);
	//Если Рез = Неопределено Тогда
	//	Возврат Ложь;
	//Иначе
	//	Возврат Истина;
	//КонецЕсли;
	
КонецФункции


&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	
	Параметры.Свойство("ТипДокумента",ТипДокумента);
	Параметры.Свойство("ЦветоваяИндикация",ЦветоваяИндикация);
	Параметры.Свойство("ПриходПоПеремещению",ПриходПоПеремещению);

	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		БазаПодключения = Перечисления.БазаПодключения.ТК;
	Иначе
		БазаПодключения = Перечисления.БазаПодключения.Общепит;
	КонецЕсли;
	
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	Если БазаПодключения = Перечисления.БазаПодключения.Общепит Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОбщепит", "Видимость", Истина);
		Инициализирован = Ложь;
		ПользовательИнициализирован = Ложь;
		Элементы.СообщениеИнициализацииПользователя.Заголовок ="Відскануйте ШК комірки";
		ОбщепитДатаЗаказа = ТекущаяДата();
		ЭтаФорма.УсловноеОформление.Элементы.Получить(5).Использование = Истина;

		
		Элементы.СтрокаТоварыКоличествоПринято.Заголовок    = "Подтв.";
		Элементы.СтрокаТоварыЗаказаноПодтверждено.Заголовок = "Заказано";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);

	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОбщепит", "Видимость", Ложь);

		Инициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Подразделение);	
		ПользовательИнициализирован = НЕ ПустаяСтрока(ПараметрыСеанса.Сотрудник);
		КонтрагентВыбран = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаАвторизация", "Видимость", НЕ Инициализирован И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК());

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтатьяСписания", "Видимость", ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Списание2"));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТипУценки", "Видимость", ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уценка"));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалСохранить,СтраницаАнкета", "Видимость",Ложь);

	Параметры.Свойство("СкладUUID",СкладUUID);
	Параметры.Свойство("НаименованиеДокумента",НаименованиеДокумента);
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") Тогда
		НеПосчитанныеСервер();
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтраницаСтрока,СтрокаПоискаТовары,ГруппаПодвалКнопки", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "НеПосчитаные,ВыгрузитьДокументСтраницаТовары,ГруппаПечатьДокумент", "Видимость",Истина);
		ЭтаФорма.УсловноеОформление.Элементы.Получить(4).Использование = Истина;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтрокаПоискаТовары,СтраницаСтрока,ГруппаПодвалКнопки", "Видимость",Ложь);
		НеПосчитанныеСервер();

		ЭтаФорма.УсловноеОформление.Элементы.Получить(4).Использование = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "НеПосчитаные,ВыгрузитьДокументСтраницаТовары", "Видимость",Истина);
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")  Тогда
		ЭтаФорма.УсловноеОформление.Элементы.Получить(2).Использование = Истина;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(3).Использование = Истина;

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаТоварыПриемДо", "Видимость",Истина);

		ВводкКоличества = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтраницаСканирование,СтраницаСтрока,ВыгрузитьДокумент,СтрокаТоварыДопустимоеКоличествоПриема", "Видимость",Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	ИначеЕсли 	ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
		
		ЭтаФорма.УсловноеОформление.Элементы.Получить(2).Использование = Истина;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(3).Использование = Истина;
		
		ВводкКоличества = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаТоварыКоличествоПоставщика,СтраницаСведения,СтраницаСканирование,СтраницаСтрока,ВыгрузитьДокумент,СтрокаТоварыЗаказаноПодтверждено", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаТоварыПриемДо", "Видимость",Истина);

	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") Тогда 
		
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СкладОтправитель,ХозОперация,ВыгрузитьДокумент1", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,СтрокаПоискаТовары,ГруппаПодвалКнопки", "Видимость",Ложь);
		
		//Заполним список хоз операций
		СписокХозОпераций = Элементы.ХозОперация.СписокВыбора;
		СписокХозОпераций.Очистить();		
		СписокХозОпераций.Добавить("ПеремещениеТоваровВФилиал", "Перемещение товаров в филиал");
		СписокХозОпераций.Добавить("ПеремещениеТоваров", "Перемещение товаров");
		ХозОперация  = "ПеремещениеТоваров";
		
		Если ЦветоваяИндикация Тогда
		ЭтаФорма.УсловноеОформление.Элементы.Получить(2).Использование = Истина;
		ЭтаФорма.УсловноеОформление.Элементы.Получить(3).Использование = Истина;
		КонецЕсли;
		
		
		
	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Переоценки") Тогда	
		ПользовательИнициализирован = Истина;
		Параметры.Свойство("ИД_Переоценки",ИД_Переоценки);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтраницаСканирование,СтраницаСтрока,ГруппаПользователь,СтрокаПоискаТовары,ГруппаПодвал,СтраницаТовары", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТоварыПереоценки", "Видимость",Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма,"ТоварыПереоценкиЗаписьПоСтроке");
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтраницаСканирование,СтрокаПоискаТовары,СтраницаСтрока,СтрокаТоварыКоличествоПоставщика,ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);
			Элементы.СтрокаТоварыЗаказаноПодтверждено.Заголовок = "Отгр.\ подтв. кол-во";
			Элементы.СтрокаТоварыДопустимоеКоличествоПриема.Заголовок = "Допустимое кол-во";
			Элементы.СтрокаТоварыКоличествоПринято.Заголовок = "Подтв.";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,СтрокаПоискаТовары,ГруппаПодвалКнопки,СтраницаСведения,СтраницаСканирование,СтраницаТовары,ВводКоличества,ФормаОбщаяКомандаПереинициализация", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаПриходУход,ГруппаПодменюОтчеты", "Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);

	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаТоварыКоличествоПоставщика,СтраницаСведения,СтраницаСканирование,СтраницаСтрока,ВыгрузитьДокумент,СтрокаТоварыЗаказаноПодтверждено", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСумма", "Видимость",Истина);
	
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратТоваров") Тогда
		
		КонтрагентВыбран = Не ПустаяСтрока(КонтрагентUUID);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,СтрокаПоискаТовары,ГруппаПодвалКнопки", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКонтрагент", "Видимость",НЕ КонтрагентВыбран);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		 ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы,СтраницаСтрока,СтраницаСканирование,СтраницаСведения,СтрокаПоискаТовары,ГруппаОстатокПродажи,ВводКоличества","Видимость", Ложь);
		 ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОжидается","Видимость", Истина);
		 ЭтаФорма.ТекущийЭлемент = Элементы.Товары;

		 ЭтаФорма.УсловноеОформление.Элементы.Получить(7).Использование = Истина;
		 ЭтаФорма.УсловноеОформление.Элементы.Получить(8).Использование = Истина;
		 ЭтаФорма.УсловноеОформление.Элементы.Получить(9).Использование = Истина;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов") Тогда
	 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаАнкета","Видимость", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСервисДеск,СтраницаТоварыПереоценки,СтраницаСтрока,СтраницаТовары,СтраницаСканирование,СтраницаСведения,СтраницаПриходУход,ГруппаПодвал,Подвал,ГруппаРекламация,СтрокаПоискаТовары,Сканировать", "Видимость",Ложь);
        ЭтаФорма.ТекущийЭлемент = Элементы.Товары;

	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ВводКоличества,СтраницаСведения,СтраницаСканирование,СтраницаСтрока,СтрокаПоискаТовары","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ЭтаФорма.УсловноеОформление.Элементы.Получить(4).Использование = Истина;

		//ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтраницаСтрока,Продажи,ВводКоличества,СтрокаПоиска","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаТНП,НеПосчитаные","Видимость", Истина);
		ВводкКоличества = Истина;
		Элементы.НеПосчитаные.Пометка = Истина;
		УстановитьОформление(Истина,4);
		УстановитьОформление(Истина,0);
		ПричинаПеремещения      = "Подходящие сроки";
		//ПричинаПеремещенияUUID  = "7d1bc3cc-7fc1-11ee-a25b-005056bcccf8";  
		ПричинаПеремещенияUUID  = "cbaae775-e4d3-11ed-bbb9-005056bc658e";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ВводКоличества,СтраницаСведения,СтраницаСканирование,СтраницаСтрока,СтрокаПоискаТовары","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ФормаНеПосчитаныеТовары","Видимость", Истина);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		УстановитьОформление(Истина,4);
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уведомление") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвал,ГруппаПодвалСохранить,ДекорацияНадписьПроверка","Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалКнопки,ГруппаПодвалСохранитьРеквизитыДокумента,ГруппаПодвалДанныеПоставщика,СтраницаСведения,СтраницаСканирование,СтраницаТовары,СтраницаСтрока,СтрокаПоискаТовары","Видимость", Ложь);
		
		Элементы.ДекорацияНадписьПроверка.Заголовок = Параметры.Инфо;
		Параметры.Свойство("ДокументUUID",ДокументUUID);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВыдачаДС") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвал,ГруппаПодвалСохранить,ДекорацияНадписьПроверка,ГруппаПечатьДок","Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалКнопки,ГруппаПодвалСохранитьРеквизитыДокумента,ГруппаПодвалДанныеПоставщика,СтраницаСведения,СтраницаСканирование,СтраницаТовары,СтраницаСтрока,СтрокаПоискаТовары","Видимость", Ложь);
		
		Элементы.ДекорацияНадписьПроверка.Заголовок = Параметры.Инфо;
		Параметры.Свойство("ДокументUUID",ДокументUUID);
	
   	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы,СтраницаСтрока,СтраницаСканирование,СтраницаСведения,СтрокаПоискаТовары,ГруппаОстатокПродажи,ВводКоличества","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОжидается","Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары; 
		Элементы.СообщениеНеобходимоОтсканироватьДокумент.Заголовок ="Відскануйте маршрутний лист";
		УстановитьОформление(Истина,0);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратПеремещение") Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы,ГруппаПодвал,СтраницаСтрока,СтраницаСканирование,СтраницаСведения,СтрокаПоискаТовары,ГруппаОстатокПродажи,ВводКоличества","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,СообщениеВведитеНомерТТ","Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
		Элементы.СообщениеНеобходимоОтсканироватьДокумент.Заголовок ="Відскануйте переміщення";
		УстановитьОформление(Истина,4);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.БезакцептныйПрием") Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы,ГруппаПодвал,СтраницаСтрока,СтраницаСканирование,СтраницаСведения,СтрокаПоискаТовары,ГруппаОстатокПродажи,ВводКоличества","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент","Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
		Элементы.СообщениеНеобходимоОтсканироватьДокумент.Заголовок ="Відскануйте переміщення";
		УстановитьОформление(Истина,4);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,СтраницаПриходУход,СтраницаСведения,СтраницаСканирование,СтраницаТовары,СтраницаСтрока,СтраницаТоварыПереоценки","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСервисДеск","Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Рекламация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,ВводКоличества,СообщениеНеобходимоОтсканироватьДокумент,СообщениеВведитеНомерТТ,СтраницаСведения,СтраницаСканирование,СтраницаСтрока,ГруппаПодвалКнопки,ГруппаПодвалСохранить","Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ДекорацияСообщение","Видимость", Истина);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоиска,ВводКоличества,СтрокаПоискаТовары,СтраницаСведения,СтраницаСканирование,СтраницаСтрока","Видимость", Ложь);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);

	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,СтрокаПоискаТовары,ГруппаПодвалКнопки", "Видимость",Ложь);
	КонецЕсли;
	
		
		
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДобавитьВдокумент", "Видимость",ВводкКоличества);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "Доступность",ВводкКоличества);
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, ,"СтрокаНаименование,СтрокаТоварыНаименование");

	
	ОбщегоНазначения.УстановитьВысотуТекстовогоПоляНаименованиеТовара(ЭтаФорма);
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()  Тогда
		ОбновитьПодразделение();
		Если  ТипДокумента <> ПредопределенноеЗначение("Справочник.ТипыДокументов.Переоценки") Тогда	
			ОбновитьСотрудника();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();	
	
	//ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма,,
	//"ТоварыТоварыЗаписьПоСтроке"
	//);
	//
	//

	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовок()
	
	ЭтаФорма.Заголовок = НСтр("ru = '"+ТипДокумента.Наименование+"'");
	
КонецПроцедуры


&НаСервере
Процедура УстановитьДоступностьПоНастройкам()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());

	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент", "Видимость",
		 Инициализирован И ПользовательИнициализирован И ПустаяСтрока(ДокументUUID)
		И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
		);
		
		Возврат;
	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Рекламация") И Инициализирован Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаРекламация", "Видимость",Истина);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		флВк =  Инициализирован И ЗначениеЗаполнено(Элементы.ДекорацияСклад.Заголовок) И ЗначениеЗаполнено(Элементы.ДекорацияПричина.Заголовок);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаИнфоЗаявка", "Видимость",
			флВк
			); 
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов") И Инициализирован Тогда
		флНашКлиент = ПараметрыСеанса.Сотрудник_ID = КонтрагентUUID;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Табдок,АнкетаОК", "Видимость",флНашКлиент);
	   	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияАнкета", "Видимость",НЕ флНашКлиент);

	КонецЕсли;
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость",
	(ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер) И Инициализирован И ПользовательИнициализирован И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДобавитьВдокумент", "Видимость",
	ВводкКоличества
	);

	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы", "Видимость",
	Инициализирован И ПользовательИнициализирован  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК()
	);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Контрагент", "Видимость",
	Инициализирован И ПользовательИнициализирован  И ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() И НЕ КонтрагентВыбран
	);
	


КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	ГоризонтальнаяОриентацияЭкрана = ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана;
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
	//	Элементы.страницы.ТекущаяСтраница = Элементы.СтраницаГоризонтальная;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВертикальная;
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура ОбновитьПодразделение()
	
	
	Если ПустаяСтрока(ПараметрыСеанса.Подразделение) Тогда
		Элементы.СообщениеИнициализации.Заголовок = "Пристрій не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Ложь;
	Иначе
		Элементы.СообщениеИнициализации.Заголовок = ПараметрыСеанса.Подразделение;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализации");
		Инициализирован = Истина;

	КонецЕсли;
	
	УстановитьДоступностьПоНастройкам();

	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСотрудника()
	
	Если ПустаяСтрока(ПараметрыСеанса.Сотрудник) Тогда
		Элементы.СообщениеИнициализацииПользователя.Заголовок = "Користувач не ініціалізований";
		ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма, "СообщениеИнициализацииПользователя");
		Сотрудник = "";
		ПользовательИнициализирован = Ложь;
		
	Иначе
		Если ПараметрыСеанса.Сотрудник <> Элементы.СообщениеИнициализацииПользователя.Заголовок Тогда
			Сотрудник = "";
		КонецЕсли;
		

		Элементы.СообщениеИнициализацииПользователя.Заголовок = ПараметрыСеанса.Сотрудник;
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "СообщениеИнициализацииПользователя");
		ПользовательИнициализирован = Истина;
		
	КонецЕсли;
	
	
	
	
	УстановитьДоступностьПоНастройкам();

	
КонецПроцедуры


&НаКлиенте 
Функция ОписаниеСтруктурыДокумента()
	СтрокаВозврат ="";
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация") Тогда
		СтрокаВозврат = "НомерСтроки,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,Остаток,Продажи,ИспМРЦ,МРЦ,Весовой";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") 
		ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
	    СтрокаВозврат = "НомерСтроки,ШтрихКод,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоВведено,КоличествоПоставщика,КоличествоПодтверждено,ЭтоТара,ИспМРЦ,МРЦ,АМ,Весовой,ПриемДо";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда
	    СтрокаВозврат = "НомерСтроки,ШтрихКод,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоВведено,Весовой,ЭтоТара";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание")Тогда	
		СтрокаВозврат = "НомерСтроки,ШтрихКод,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоВведено,ИспМРЦ,МРЦ";
	ИначеЕсли ТипДокумента	 = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров")	И ХозОперация ="ПеремещениеТоваровИзФилиала" тогда
	    СтрокаВозврат = "НомерСтроки,ШтрихКод,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоПоставщика,ЭтоТара,ИспМРЦ,МРЦ,Весовой,ПриемДо";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
		СтрокаВозврат = "НомерСтроки,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,Остаток,Продажи,ИспМРЦ,МРЦ,Весовой";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		СтрокаВозврат = "НомерСтроки,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,КоличествоВведено,Остаток,Продажи,ИспМРЦ,МРЦ";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		СтрокаВозврат = "НомерСтроки,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,КоличествоВведено,КоличествоПоставщика,ИспМРЦ,МРЦ,Весовой";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")  Тогда
		СтрокаВозврат = "НомерСтроки,Артикул,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,Остаток,Продажи,ИспМРЦ,МРЦ,Весовой";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") 
		ИЛИ ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ")Тогда
		СтрокаВозврат = "НомерСтроки,Артикул,НаименованиеТовара,СканированиеТовар,СканированиеЦенник,Остаток,АМ,ЦенаЦенник,Цена,ИспМРЦ,МРЦ,Весовой,Продажи";
 	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
       	СтрокаВозврат = "НомерСтроки,Артикул,Артикул2,НаименованиеТовара,НаименованиеТовара2,Количество,КоличествоВведено,КоличествоПоставщика,ИспМРЦ,МРЦ,Весовой";

	Иначе
		СтрокаВозврат = "НомерСтроки,НаименованиеТовара,НаименованиеЕдиницы,Коэффициент,Количество,Весовой";
	КонецЕсли;
	
	Возврат СтрокаВозврат;
			
КонецФункции


&НаКлиенте
Функция ПолучитьПараметрыСтроки()
	//
	//Если ГоризонтальнаяОриентацияЭкрана Тогда
	//	ТекущиеДанные = Элементы.ТоварыГоризонт.ТекущиеДанные;
	//Иначе
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПолей = ОписаниеСтруктурыДокумента();
	
	СтруктураПараметров = Новый Структура(СтруктураПолей);
	ЗаполнитьЗначенияСвойств(СтруктураПараметров,ТекущиеДанные,СтруктураПолей);
	СтруктураПараметров.Вставить("ТипДокумента",ТипДокумента);
	СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	СтруктураПараметров.Вставить("ТолькоПросмотрФормы", Ложь);
	СтруктураПараметров.Вставить("ХозОперация",ХозОперация);

	//Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") Тогда
		СтруктураПараметров.Вставить("СкладUUID",СкладUUID);
	//КонецЕсли;
	
	
	Возврат СтруктураПараметров;
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДокумент(Отказ)
	
	//ВидДокумента = Параметры.ВидДокумента;
	ДокументUUID  = Параметры.ДокументUUID;
	ДокументСервер = Истина; 
	//ДатаДокумента = ТекущаяДата();
	
	НачалоКонтроля = ТекущаяДата();
	НачалоРаботыСдокументом = ТекущаяДата();
	
	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(Параметры);
	// 
	Если ДанныеДокумента.Результат Тогда
	//	
		Документ = ДанныеДокумента.Ответ; 
		
		Если Документ.Свойство("tochkamar")Тогда
			ТочкаМаршрута = Документ.tochkamar;	
		КонецЕсли;
		Если ТочкаМаршрута = 5 Тогда 
			Сообщить("Прийом переміщення доступне через - ""Прийом товарів"" - ""Безакцептне приймання РЦ""");
			Отказ = Истина;  
			Возврат;
		КонецЕсли;
		
		
		Если Документ.Свойство("SkladOn") Тогда
			СкладВидимость = Документ.SkladOn;
		КонецЕсли;
		
		Если Документ.Свойство("sumzak") Тогда
			МинимальнаяСумма = Документ.sumzak;
		КонецЕсли;

		Если Документ.Свойство("СкладСбоки") Тогда
			Элементы.ДекорацияСклад.Заголовок = Документ.СкладСбоки;
		КонецЕсли;
		Если Документ.Свойство("Причина") Тогда
			Элементы.ДекорацияПричина.Заголовок = Документ.Причина;
		КонецЕсли;
			
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу")   Тогда
			
			ОснованиеUUID = Параметры.ДокументUUID;
			ДокументUUID          = "";
			
			Если Документ.Свойство("ВхДокНомер") Тогда
				ПоставщикаНомерНакладной = Документ.ВхДокНомер;
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПоставщикаНомерНакладной", "Доступность", Ложь);
			КонецЕсли;
			
			Если Документ.Свойство("ПриходUUID") Тогда
				 ДокументUUID =  Документ.ПриходUUID;
			КонецЕсли;
			

			Если Документ.Свойство("ВхДокДата") Тогда
				ПоставщикаДатаДокумента = Дата(Документ.ВхДокДата);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПоставщикаДатаДокумента", "Доступность", Ложь);
			КонецЕсли;
			
			Если Документ.Свойство("PredNak") И Документ.PredNak Тогда   
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаТоварыКоличествоПоставщика", "Доступность", Ложь);
			КонецЕсли;
			
			
			
			Для Каждого СтрТовары Из Документ.Tovary Цикл 
				нСтрокаТовары = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрокаТовары,СтрТовары);   
				Если СтрТовары.Свойство("sht") Тогда 
					Если СтрТовары.Свойство("sht2")	И СтрТовары.sht2 <> 0 Тогда  
						нСтрокаТовары.ПриемДо = ТекущаяДата()+(СтрТовары.sht/100)*СтрТовары.sht2*86400;
					Иначе
						нСтрокаТовары.ПриемДо = ТекущаяДата()+(СтрТовары.sht/3*2)*86400;   
					КонецЕсли;
				КонецЕсли;
				
				ОбновитьЗаписьПоСтроке(,нСтрокаТовары);
			КонецЦикла; 
			
			ОбработатьДанныеВРаботе();
            ПолучитьВремяРаботыСДокументом();
		Иначе
			Если ТипыИнвентаризация() Тогда
				Если Документ.Свойство("СкладUUID") Тогда
					Документ.Свойство("СкладUUID",СкладUUID);
				КонецЕсли;
				Для Каждого СтрТовары Из Документ.Tovary Цикл 
					нСтрокаТовары = Объект.Товары.Добавить();
					нСтрокаТовары.Артикул 			  = СтрТовары.Art;
					нСтрокаТовары.НаименованиеТовара  = СтрТовары.Tovar;
					нСтрокаТовары.НаименованиеЕдиницы = СтрТовары.EdIzm;
					нСтрокаТовары.Коэффициент		  = СтрТовары.Kof;
					нСтрокаТовары.Количество 		  = 0;
					
					Если СтрТовары.Свойство("МРЦ") Тогда
						Если ЗначениеЗаполнено(СтрТовары.МРЦ) Тогда
							нСтрокаТовары.ИспМРЦ = Истина;
						КонецЕсли;
						нСтрокаТовары.МРЦ = СтрТовары.МРЦ;
					КонецЕсли;
					
					Если СтрТовары.Свойство("Весовой") Тогда
						нСтрокаТовары.Весовой  = СтрТовары.Весовой;
					КонецЕсли;


					Если СтрТовары.Свойство("Остаток") Тогда
						нСтрокаТовары.Остаток  = СтрТовары.Остаток;
					КонецЕсли;

					ОбновитьЗаписьПоСтроке(,нСтрокаТовары);
				КонецЦикла;
				Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
					ДокументUUID          = "";
				КонецЕсли;
				
				
			Иначе
				Если Документ.Свойство("UUID_Склад") Тогда
					Документ.Свойство("UUID_Склад",СкладUUID);
				КонецЕсли;
				Если Документ.Свойство("UUID_СкладОтправитель") Тогда
					Документ.Свойство("UUID_СкладОтправитель",СкладОтправительUUID);
				КонецЕсли;
				
				
				Если Документ.Свойство("ОтправительРекламации") Тогда 
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаДокумент,ДекорацияСообщение","Видимость", Истина);

					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияСообщение", "Заголовок", Документ.ОтправительРекламации);
				КонецЕсли;

				
				Для Каждого СтрТовары Из Документ.Tovary Цикл 
					нСтрокаТовары = Объект.Товары.Добавить();
					нСтрокаТовары.Артикул 			  = СтрТовары.Art;
					нСтрокаТовары.НаименованиеТовара  = СтрТовары.Tovar;
					нСтрокаТовары.НаименованиеЕдиницы = СтрТовары.EdIzm;
					нСтрокаТовары.Коэффициент		  = ?(СтрТовары.Kof=0,1,СтрТовары.Kof);
					нСтрокаТовары.Количество 		  = СтрТовары.Kol;
					Если ТочкаМаршрута = 2 ИЛИ ТочкаМаршрута = 3 ИЛИ ТочкаМаршрута = 4 Тогда 
						нСтрокаТовары.КоличествоВведено 		  = СтрТовары.Kol;
					Иначе
						нСтрокаТовары.КоличествоРасхождение = СтрТовары.Kol; 
					КонецЕсли;

					Если СтрТовары.Свойство("МРЦ") Тогда
						Если ЗначениеЗаполнено(СтрТовары.МРЦ) Тогда
							нСтрокаТовары.ИспМРЦ = Истина;
						КонецЕсли;
						нСтрокаТовары.МРЦ = СтрТовары.МРЦ;
					КонецЕсли;
					Если СтрТовары.Свойство("Остаток") Тогда
						нСтрокаТовары.Остаток  = СтрТовары.Остаток;
					КонецЕсли;
					Если СтрТовары.Свойство("Весовой") Тогда
						нСтрокаТовары.Весовой  = СтрТовары.Весовой;
					КонецЕсли;
                   	Если СтрТовары.Свойство("cen") Тогда
						нСтрокаТовары.Цена  = СтрТовары.cen;
					КонецЕсли;

						
					
					//	нСтрокаТовары.Остаток 			  = СтрТовары.Kol;
					ОбновитьЗаписьПоСтроке(,нСтрокаТовары);
				КонецЦикла;
			КонецЕсли; 
			//Задания, возврат только несходняк  
			ЗагружатьДанныеВРаботе = Истина;
			Если Документ.Свойство("КраснаяКнопка") И  Документ.КраснаяКнопка Тогда
				ЗагружатьДанныеВРаботе = Ложь;
			КонецЕсли;
			
			Если ЗагружатьДанныеВРаботе  Тогда 
				ОбработатьДанныеВРаботе(); 
			КонецЕсли;
		КонецЕсли;
		
		Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаСканирование;

	Иначе
		Отказ = Истина;
		Если НЕ ПустаяСтрока(ДанныеДокумента.ОписаниеОшибки) Тогда
			Сообщить(ДанныеДокумента.ОписаниеОшибки);
		Иначе
			Сообщить("Ошибка получение данных с сервера");
		КонецЕсли;
	КонецЕсли;
	//
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоУслуг(Отказ)

	
	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьMarketDoc("ZAYVKA");
	Если  ДанныеДокумента.Результат = Ложь Тогда
		Отказ = Истина;
		Если НЕ ПустаяСтрока(ДанныеДокумента.ОписаниеОшибки) Тогда
			Сообщить(ДанныеДокумента.ОписаниеОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	стрДереваГруппа  = Услуга.ПолучитьЭлементы();

	Для Каждого СтрГр Из ДанныеДокумента.Ответ Цикл
		
		грДерева = стрДереваГруппа.Добавить();
		грДерева.Наименование = СтрГр.Наименование;   
		грДерева.ЭтоГруппа = Истина;
		грДерева.Код = СтрГр.Код;

		стрДерева = грДерева.ПолучитьЭлементы();

		Для Каждого стрУсл ИЗ СтрГр.Услуги Цикл
			нстрДерева = стрДерева.Добавить();
			нстрДерева.Наименование = стрУсл.Наименование;
			нстрДерева.Код = стрУсл.Код;
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПроверкиСтандартов(Отказ)
	
	ДокументUUID  = Параметры.ДокументUUID;
	КонтрагентUUID  = Параметры.КонтрагентUUID;
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьДанныеВРаботе()
	
	Если ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТБД ИЛИ
		 ТипДокумента = Справочники.ТипыДокументов.ЗаданиеИН  ИЛИ
		 ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТНП ИЛИ 
		 ТипДокумента = Справочники.ТипыДокументов.ПеремещениеТоваров ИЛИ
		 ТипДокумента = Справочники.ТипыДокументов.ЗаданиеВФ Тогда
		
		
		Если РегистрыСведений.ДанныеВРаботе.ЕстьДанныеВРаботе(ДокументUUID,ТипДокумента) Тогда
			 ВыбратьДанныеВРаботе();
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда
	  	Если РегистрыСведений.ДанныеВРаботе.ЕстьДанныеВРаботе(ОснованиеUUID,ТипДокумента) Тогда
			 ВыбратьДанныеВРаботе();
		КонецЕсли;

	Иначе
		Возврат;
	КонецЕсли;
	
	
КонецПроцедуры  

&НаСервере
Процедура ПолучитьВремяРаботыСДокументом()
	
	
	Если ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПриемПоПриходу Тогда
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ВремяРаботыСДокументом КАК ВремяРаботы
		|ГДЕ
		|	ВремяРаботы.ДокументUUID = &ДокументUUID
		|	И ВремяРаботы.ТипДокумента = &ТипДокумента";
		
		Если ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда
			Запрос.УстановитьПараметр("ДокументUUID", ОснованиеUUID);  
		Иначе
			Запрос.УстановитьПараметр("ДокументUUID", ДокументUUID);  
		КонецЕсли;
		Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
		
		РезультатЗапроса = Запрос.Выполнить();
			
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ДокументОткрытСекунд = ВыборкаДетальныеЗаписи.ДокументОткрытСекунд; 
			НачалоРаботыСдокументом = ВыборкаДетальныеЗаписи.НачалоРаботыСдокументом; 
			ОтсканированоТовар = ВыборкаДетальныеЗаписи.ОтсканированоТовар; 
			ВводВручнуюТовар = ВыборкаДетальныеЗаписи.ВводВручнуюТовар; 
 
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервере
Процедура ВыбратьДанныеВРаботе() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ *
		|ИЗ
		|	РегистрСведений.ДанныеВРаботе КАК ДанныеВРаботе
		|ГДЕ
		|	ДанныеВРаботе.ДокументUUID = &ДокументUUID
		|	И ДанныеВРаботе.ТипДокумента = &ТипДокумента";
	
	Если ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда
		Запрос.УстановитьПараметр("ДокументUUID", ОснованиеUUID);  
	Иначе
		Запрос.УстановитьПараметр("ДокументUUID", ДокументUUID);  
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 мСтроки =  Объект.Товары.НайтиСтроки(Новый Структура("Артикул,МРЦ",ВыборкаДетальныеЗаписи.Артикул,ВыборкаДетальныеЗаписи.МРЦ));
		 
		 Если мСтроки.Количество()=0 Тогда
			 нСтрокаТовары = Объект.Товары.Добавить();
		 Иначе
			 нСтрокаТовары = мСтроки[0];
		 КонецЕсли;
		 
		   ЗаполнитьЗначенияСвойств(нСтрокаТовары,ВыборкаДетальныеЗаписи);
		   ОбновитьЗаписьПоСтроке(,нСтрокаТовары);

	 КонецЦикла;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТоварыПереоценки(Отказ)
	ТоварыПереоценки.Очистить();
	
	Для Каждого Стр Из Параметры.ТоварыПереоценки Цикл 
		нСтрока = ТоварыПереоценки.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрока,Стр);
		нСтрока.ЗаписьПоСтроке = ""+ нСтрока.Артикул + " " +  нСтрока.НаименованиеТовара +" "+  нСтрока.КодХарактеристики + " цена "+ Формат(нСтрока.Продажи, "ЧЦ=15; ЧДЦ=2; ЧРГ=");
		
	КонецЦикла;
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТоварыЗадания(Отказ)
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	НастроитьФормуПоОриентацииЭкрана();
	             
	СформироватьЗаголовок();
	
	Объект.Документы.Очистить();
	Объект.Товары.Очистить();
	ТочкаМаршрута = 0;
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Рекламация") Тогда

		 ЗаполнитьДокумент(Отказ);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") Тогда 
		ЗаполнитьДокументПеремещение(Отказ);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Переоценки") Тогда 
		ЗаполнитьТоварыПереоценки(Отказ);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка") Тогда 
		ЗаполнитьДеревоУслуг(Отказ);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов") Тогда
		   ЗаполнитьПараметрыПроверкиСтандартов(Отказ);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;

	ВыполняетсяЗакрытие = Ложь;

	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация") Тогда
		Если ПустаяСтрока(СкладUUID) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	
	Если ВыполняетсяЗакрытие Тогда
		Если НЕ (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") И ЦветоваяИндикация) Тогда
			ОбщегоНазначенияКлиентСервер.ОчиститьСотрудника();
		КонецЕсли;
	Иначе
		Отказ = Истина;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",ЭтотОбъект),"Закрити документ?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
	ИначеЕсли  ИмяСобытия = "KeyPress"  И ВводДоступен() Тогда
		
		   ОбработатьПолучениеСКлавиатуры(Параметр)
		   
	ИначеЕсли ИмяСобытия = "ИзмененоПодразделение" Тогда
		
		ОбновитьПодразделение();
		
	ИначеЕсли ИмяСобытия = "ИзмененСотрудник" Тогда
		
		ОбновитьСотрудника();
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПроверкаСтандартов") И ПользовательИнициализирован Тогда
			ПроверкаСтандартовДанныеПоАнкете();	
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

 &НаСервере
Процедура ПроверкаСтандартовДанныеПоАнкете() 
	 
	Если ПараметрыСеанса.Сотрудник_ID <> КонтрагентUUID Тогда
		Возврат;
	КонецЕсли;
	
	Табдок.Очистить();
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "ProverkiZa");
	ПараметрыДокумента.Вставить("ДокументUUID", ДокументUUID);
	рез = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
	Если рез.Результат  Тогда
		
		ДанныеАнкетирования =  рез.Ответ;
		
		//	
		МакетОтчета = ПолучитьОбщийМакет("Анкетирование");
		Область = МакетОтчета.ПолучитьОбласть("Шапка");
		Табдок.Вывести(Область);
		
		Для Каждого Анкета Из ДанныеАнкетирования Цикл 
			Область = МакетОтчета.ПолучитьОбласть("ттАнкета");
			Область.Параметры.Анкета = "Анкета №"+Анкета.Номер +" від "+ Формат(Дата(Анкета.Дата),"ДФ=yyyy-MM-dd");
			Область.Параметры.ТТ = Анкета.Респондент;
			Табдок.Вывести(Область);
			
			Область = МакетОтчета.ПолучитьОбласть("Итого");
			Область.Параметры.Результат = Формат(Анкета.ПроцентВыполнения,"ЧЦ=3; ЧН=0")+"%";
			Область.Параметры.Сумма = Анкета.ИтогОценка;
			Табдок.Вывести(Область);

			Строка = МакетОтчета.ПолучитьОбласть("Строка");
			СтрокаЦвет = МакетОтчета.ПолучитьОбласть("СтрокаЦвет");
			
			НомерСтроки = 1;
			
			
			Для Каждого стрВопрос Из  Анкета.Вопросы Цикл 
				
				Если НомерСтроки % 2 = 0 Тогда
					СтрокаМакета = СтрокаЦвет;
				Иначе
					СтрокаМакета = Строка;
				КонецЕсли;
				
				СтрокаМакета.Параметры.Статья = стрВопрос.Формулировка;
				СтрокаМакета.Параметры.Сумма  = стрВопрос.Оценка;
				Табдок.Вывести(СтрокаМакета); 
				
				НомерСтроки = НомерСтроки + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		//	
		Табдок.Защита = Истина;
	Иначе
		Если ПустаяСтрока(рез.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає даних для показу!");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(рез.ОписаниеОшибки);
		КонецЕсли;

	КонецЕсли; 
	 
	 
КонецПроцедуры
 


&НаКлиенте
Процедура ОбработатьПолучениеСКлавиатуры(ДанныеКлавиатуры)
	
КонецПроцедуры




///События
&НаКлиенте
Процедура СообщениеИнициализацииНажатие(Элемент)
	ОткрытьФорму("Обработка.Сервис.Форма.Инициализация", , ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеИнициализацииПользователяНажатие(Элемент)
	ДополнительныеПараметры = Новый Структура;
	ДопПарметрыФормы = Новый Структура;
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход") Тогда
		ДопПарметрыФормы.Вставить("СотрудникЗУП");
	КонецЕсли;
	опЗакрытие = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВводаСотрудника",ЭтаФорма,ДополнительныеПараметры);
	ОткрытьФорму("Обработка.Сервис.Форма.ИнициализацияСотрудник",ДопПарметрыФормы, ЭтаФорма,,,,опЗакрытие, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВводаСотрудника(Результат,ДополнительныеПараметры)Экспорт 
	
	Если НЕ ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		
		Если ЗначениеЗаполнено(Результат) Тогда
			ПолучитьДанныеПоАдресуДоставки(Результат);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоАдресуДоставки(ДанныеШК)
	
	Рез =  ИнтеграцияТК_ВызовСервера.ПолучитьДанныеОбщепит("GetTovarZakaza",Формат(ОбщепитДатаЗаказа,"ДФ=yyyyMMdd")+"|"+ДанныеШК);
	ТочкаДоставкиGLN =  ДанныеШК;
	Если Рез.Результат Тогда
		Документ = Рез.Ответ;
		ПользовательИнициализирован = Истина;
		
		
		Для Каждого СтрТовары Из Документ.Товары Цикл 
			нСтрокаТовары = Объект.Товары.Добавить();
			нСтрокаТовары.Артикул 			  = СтрТовары.Артикул;
			нСтрокаТовары.НаименованиеТовара  = СтрТовары.Товар;
			нСтрокаТовары.НаименованиеЕдиницы = СтрТовары.Единица;
			нСтрокаТовары.Коэффициент		  = 1;
			нСтрокаТовары.Количество 		  = СтрТовары.Количество;
			нСтрокаТовары.Весовой 			  = СтрТовары.Весовой;
			ОбновитьЗаписьПоСтроке(,нСтрокаТовары);
		КонецЦикла;
		Элементы.СообщениеИнициализацииПользователя.Заголовок = Документ.Магазин;

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСведения,СтраницаСканирование,ГруппаОбщепит,ГруппаОстатокПродажи,ВыгрузитьДокумент,СтрокаТоварыДопустимоеКоличествоПриема,СтрокаТоварыКоличествоПоставщика", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы,СтраницаВертикальная,СтраницаТовары,СтрокаПоискаТовары,ГруппаПодвал,ГруппаПодвалКнопки", "Видимость", Истина);

		
	Иначе
		 Сообщить(Рез.ОписаниеОшибки);
		
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоРезерву(ДанныеШК)
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "REZ");
	ПараметрыДокумента.Вставить("ДокументUUID", ДанныеШК);
	НачалоКонтроля = ТекущаяДата();
	
	ДанныеОтвет = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
	Если ДанныеОтвет.Результат Тогда
		ДанныеДокумента = ДанныеОтвет.Ответ;
		ДокументUUID    = ДанныеШК;
		Склад           = ДанныеДокумента.Sklad;
		СкладUUID       = ДанныеДокумента.SkladUUID;
		 Элементы.СообщениеНеобходимоОтсканироватьДокумент.Заголовок = ДанныеДокумента.Заголовок;
		 Элементы.СообщениеНеобходимоОтсканироватьДокумент.ЦветТекста = WebЦвета.Зеленый;
		Для Каждого стрДок Из ДанныеДокумента.Tovary Цикл 
			нСтрокаТовары = Объект.Товары.Добавить();
			нСтрокаТовары.Артикул 			  = стрДок.Art;
			нСтрокаТовары.НаименованиеТовара  = стрДок.Tovar;
			нСтрокаТовары.НаименованиеЕдиницы = стрДок.EdIzm;
			нСтрокаТовары.Коэффициент		  = стрДок.Kof;
			нСтрокаТовары.Количество 		  = стрДок.Kol;
			нСтрокаТовары.КоличествоПоставщика = стрДок.Kol;
			нСтрокаТовары.МРЦ 		          = стрДок.МРЦ;
			нСтрокаТовары.ИспМРЦ 		      = стрДок.ИспМРЦ;
			нСтрокаТовары.КоличествоРасхождение = стрДок.Kol;
			нСтрокаТовары.Весовой 			  = стрДок.Ves;
			ОбновитьЗаписьПоСтроке(,нСтрокаТовары);
		КонецЦикла;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы", "Видимость", Истина);
	
	Иначе
		Сообщить(ДанныеОтвет.ОписаниеОшибки);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеМаршрутныйЛист(ДанныеШК)
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "MAR");
	ПараметрыДокумента.Вставить("ДокументUUID", ДанныеШК);
	НачалоКонтроля = ТекущаяДата();
	
	ДанныеОтвет = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);   
	БуферИД.Очистить();	

	Если ДанныеОтвет.Результат Тогда
		ДанныеДокумента = ДанныеОтвет.Ответ;
		ДокументUUID    = ДанныеШК;
		ЗаголовокДок = ДанныеДокумента.doc+Символы.ПС+ДанныеДокумента.avto+Символы.ПС+ДанныеДокумента.vod;
		Элементы.СообщениеНеобходимоОтсканироватьДокумент.Заголовок = ЗаголовокДок;
		Элементы.СообщениеНеобходимоОтсканироватьДокумент.ЦветТекста = WebЦвета.Зеленый;
		Для Каждого стрДок Из ДанныеДокумента.docsID Цикл 
			
			мСтрок = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(стрДок.docid,"_");
			Если мСтрок.Количество() = 2 Тогда
				ИД = мСтрок[1];
			Иначе
				Продолжить;
			КонецЕсли;

			
			нСтрокаТовары = Объект.Товары.Добавить();
			нСтрокаТовары.ДокументИД = стрДок.docid;
			нСтрокаТовары.НаименованиеТовара =  стрДок.doc; 
			нСтрокаТовары.Получатель =  стрДок.adr;
			ОбновитьЗаписьПоСтроке(,нСтрокаТовары); 
			ИД_Док = стрДок.docid;		
			
			стБуфер = БуферИД.Добавить();
			стБуфер.ИД_Док = стрДок.docid;  
			стБуфер.ИД = ИД;
					
		КонецЦикла;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Страницы", "Видимость", Истина);
	
	Иначе
		Сообщить(ДанныеОтвет.ОписаниеОшибки);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусДокументаПеремещение(ДанныеШК)
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ДокументUUID", ДанныеШК);
	ПараметрыДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
   	стрСтатус = "Завантажений";
	Если ТипДокумента = Справочники.ТипыДокументов.БезакцептныйПрием Тогда
		ПараметрыДокумента.Вставить("ВидДокумента", "acprtt");	 
		стрСтатус = "Доставлено";
		ДанныеОтвет = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(ПараметрыДокумента,ТипДокумента);   
	Иначе
		ПараметрыДокумента.Вставить("ВидДокумента", "logprvoz");
		//НачалоКонтроля = ТекущаяДата();
		ДанныеОтвет = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(ПараметрыДокумента,Справочники.ТипыДокументов.ВозвратПеремещение);   
	КонецЕсли;

	Если ДанныеОтвет.Результат Тогда
		ДанныеДокумента = ДанныеОтвет.Ответ;
		нСтроки = Объект.Товары.НайтиСтроки(Новый Структура("ДокументИД",ДанныеШК));
		Если нСтроки.Количество()> 0 Тогда
			нСтрокаТовары = нСтроки[0];
		Иначе
			нСтрокаТовары = Объект.Товары.Добавить();
		КонецЕсли;
		нСтрокаТовары.НаименованиеТовара =  стрСтатус +" " + ДанныеДокумента.doc; 
		нСтрокаТовары.Получатель =  ДанныеДокумента.adr; 
		нСтрокаТовары.ДокументИД =  ДанныеШК;
        нСтрокаТовары.Пересчет =  Истина;

        ОбновитьЗаписьПоСтроке(,нСтрокаТовары); 
	Иначе
		Сообщить(ДанныеОтвет.ОписаниеОшибки);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокПеремещенийВозвратТочки(ДанныеШК)  
	
	
	Объект.Товары.Очистить();
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "ttprvoz");
	ПараметрыДокумента.Вставить("НомерТочки", ДанныеШК);
	
	ДанныеОтвет = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(ПараметрыДокумента,Справочники.ТипыДокументов.ВозвратПеремещение);   
	Если ДанныеОтвет.Результат Тогда
		Массивданных = ДанныеОтвет.Ответ; 
		Элементы.СообщениеВведитеНомерТТ.Заголовок = Строка(ДанныеШК) +"-"+Массивданных.ttotpr; 
		
		Для Каждого сДок Из  Массивданных.doc Цикл 
			нСтрокаТовары = Объект.Товары.Добавить();
			нСтрокаТовары.НаименованиеТовара =  "Зіб. "+ сДок.docDate+"/"+ сДок.doc; 
			нСтрокаТовары.Получатель = сДок.adr;
			нСтрокаТовары.ДокументИД = сДок.docUUID;
			ОбновитьЗаписьПоСтроке(,нСтрокаТовары); 
		КонецЦикла;
		
	Иначе
		Элементы.СообщениеВведитеНомерТТ.Заголовок  = "Введіть номер ТТ";
		Сообщить(ДанныеОтвет.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ВводкКоличестваПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДобавитьВдокумент", "Видимость",ВводкКоличества);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "Доступность",ВводкКоличества);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаПеремещенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	ВыборСтатьиПеремещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаПеремещенияТНПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборСтатьиПеремещения();


КонецПроцедуры


&НаКлиенте
Процедура ВыборСтатьиПеремещения()
	
	СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьСписокПричинВозврата();
	
	Если СтуктураОтвет.Результат  Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлементаСтатьиВозврата", ЭтаФорма,""); 
		
		СтуктураОтвет.Ответ.ПоказатьВыборЭлемента(Оповещение,"Статья");
	Иначе
		Сообщить(СтуктураОтвет.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораЭлементаСтатьиВозврата(Рез,ДополнительныеПараметры)Экспорт 
	
	Если Рез = Неопределено Тогда
		ПричинаПеремещения = "";
		ПричинаПеремещенияUUID ="";
		
		Возврат;
	КонецЕсли;
	
	ПричинаПеремещения      = Рез.Представление;
	ПричинаПеремещенияUUID  = Рез.Значение;

	
КонецПроцедуры



&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не Инициализирован Тогда
		Сообщить("Устройство не инициализировано");
		Возврат;
	КонецЕсли;
	
	Если ХозОперация =  "ПеремещениеТоваров" И  Элемент.Имя = "Склад"  И ПустаяСтрока(СкладОтправительUUID) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран склад отправитель");
		Возврат;
	КонецЕсли;
	
		
	
	Если Элемент.Имя = "Склад" И ХозОперация = "ПеремещениеТоваровВФилиал" Тогда 
		СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьСписокТорговыхПлощадок();
	Иначе
		СтуктураОтвет =  ИнтеграцияТК_Клиент.ПолучитьСписокСкладов();
	КонецЕсли;
	
	Если ХозОперация =  "ПеремещениеТоваров" И  Элемент.Имя = "Склад" И СтуктураОтвет.Результат Тогда
		
		
		нСкладСпЗнач = СтуктураОтвет.Ответ.НайтиПоЗначению(СкладОтправительUUID);
		Если НЕ нСкладСпЗнач = Неопределено Тогда
			СтуктураОтвет.Ответ.Удалить(нСкладСпЗнач);
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	Если СтуктураОтвет.Результат  Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтаФорма, Элемент.Имя); 
		
		СтуктураОтвет.Ответ.ПоказатьВыборЭлемента(Оповещение, ?(Элемент.Имя = "Склад" И ХозОперация = "ПеремещениеТоваровВФилиал", "Магазин", "Склад"));
	Иначе
		Сообщить(СтуктураОтвет.ОписаниеОшибки);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(Результат,ДополнительныеПараметры) Экспорт
	
	
	Если ДополнительныеПараметры = "Склад" ИЛИ ДополнительныеПараметры = "Склад1" Тогда 
		
		Если Результат <> Неопределено Тогда
			Если СкладUUID <>  "b0855ae2-fd3e-11e3-8e10-0050568c0032" И Результат.Значение  = "b0855ae2-fd3e-11e3-8e10-0050568c0032" Тогда //смена РЦ
				Объект.Товары.Очистить();   
				Артикул = "";
				
			КонецЕсли;
			Склад      = Результат.Представление;
			СкладUUID  = Результат.Значение;
			СкладТНП  = Результат.Пометка;
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры = "СкладОтправитель" Тогда 
		
		Если Результат <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(СкладОтправительUUID) И СкладОтправительUUID <> Результат.Значение Тогда
				Объект.Товары.Очистить();
				СтрокаНаименование = "";
				Остаток = 0;
				КоличествоВДокументе = 0;
				Продажи = 0;
			КонецЕсли;
			
			
			СкладОтправитель  	 = Результат.Представление;
			СкладОтправительUUID = Результат.Значение;
			СкладОтправительТНП   =Результат.Пометка;
			
		КонецЕсли;
		
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПричинаПеремещения", "Видимость", СкладТНП и ХозОперация =  "ПеремещениеТоваров"); 
 	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	ОбработатьВводСтрокиШК()
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаТоварыПриИзменении(Элемент)
	ОбработатьВводСтрокиШК()
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводСтрокиШК()
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;

	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") 
		И ХозОперация = "ПеремещениеТоваровВФилиал" И СкладUUID = "b0855ae2-fd3e-11e3-8e10-0050568c0032" Тогда //РЦ Харьков
		 Сообщить("Не можна додавати, відскануйте об'єкт");
		Возврат;
	КонецЕсли;



	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ОбработатьПолученныйШтрихкод(СтрокаПоиска, ДополнительныеПараметры);
	
КонецПроцедуры



&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)

	Если КонтрольОстатка Тогда
		Если Количество> Остаток Тогда
			Сообщить("Превышение остатка");
		КонецЕсли;
		
		Количество = Мин(Остаток,Количество);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") 
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист")
			Или ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратПеремещение")  
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Рекламация") 
		 Тогда
		Возврат;
	КонецЕсли;
	
	
	ОчиститьСообщения();
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	
	Если НЕ ПараметрыСтроки = Неопределено Тогда
		
		Если  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
			
			
			ПоказатьСтраницуВводаСтрокиТовара(ПараметрыСтроки);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,"СтрокаПоиска","Вид",ВидПоляФормы.ПолеНадписи);

			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);
			
			ОткрытьФорму("ОбщаяФорма.РедактированиеСтрокиV2", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения);
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСтраницуВводаСтрокиТовара(ПараметрыСтроки)
	ТаблицаСтрока.Очистить();
	стТаблицаСтрока = ТаблицаСтрока.Добавить();
	ЗаполнитьЗначенияСвойств(стТаблицаСтрока,ПараметрыСтроки);
	
	Если ПараметрыСтроки.Свойство("МРЦ") И ЗначениеЗаполнено(ПараметрыСтроки.МРЦ) Тогда 
		стТаблицаСтрока.НаименованиеТовара	 = стТаблицаСтрока.НаименованиеТовара + " МРЦ - "+ПараметрыСтроки.МРЦ;
	КонецЕсли;
	
	Если  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда
		стТаблицаСтрока.СтрокаЗакПод =  Формат(стТаблицаСтрока.Количество,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+" \ "+Формат(стТаблицаСтрока.КоличествоПодтверждено,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=");
	Иначе
		стТаблицаСтрока.СтрокаЗакПод =  Формат(стТаблицаСтрока.Количество,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+" \ "+Формат(стТаблицаСтрока.КоличествоПодтверждено,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=");
	КонецЕсли;
	Элементы.ДекорацияАртикул.Заголовок = ПараметрыСтроки.Артикул+" ("+ПараметрыСтроки.НаименованиеЕдиницы+")";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,СтрокаПоискаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,ДанныеПоТоваруГруппа", "Видимость",Истина);

	
КонецПроцедуры


&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,"СтрокаПоиска","Вид",ВидПоляФормы.ПолеВвода);

	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	
	Если Результат.Свойство("УдалитьСтроку") Тогда
		
		ИндексСтроки = Объект.Товары.Индекс(СтрокаТаблицы);
		Объект.Товары.Удалить(ИндексСтроки);
		//Объект.Товары.Сортировать("НомерСтрокиДокумента");

		Модифицированность = Истина;
		
	ИначеЕсли Результат.Свойство("Сохранить") Тогда
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат);
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") И ЦветоваяИндикация Тогда
			СтрокаТаблицы.КоличествоВведено = СтрокаТаблицы.Количество;
			СтрокаТаблицы.КоличествоРасхождение =      СтрокаТаблицы.Количество-СтрокаТаблицы.КоличествоПоставщика;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
			
			
			Если СтрокаТаблицы.СканированиеТовар > 0 И  СтрокаТаблицы.СканированиеЦенник > 0 Тогда
				СтрокаТаблицы.Пересчет  = Истина;
				СтрокаТаблицы.КоличествоРасхождение = 0
			Иначе  
				СтрокаТаблицы.Пересчет  = Ложь;
				
				СтрокаТаблицы.КоличествоРасхождение = 1
			КонецЕсли;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда  
			 СтрокаТаблицы.КоличествоВведено =  СтрокаТаблицы.Количество * СтрокаТаблицы.КоличествоПоставщика;
		
		КонецЕсли;
		
		
		
		ОбновитьЗаписьПоСтроке(ИдентификаторСтроки);
		
		текСтрокаСтруктура = ОбщегоНазначенияКлиентСервер.СтруктураДанныеВРаботе();
		ЗаполнитьЗначенияСвойств(текСтрокаСтруктура,СтрокаТаблицы);
		текСтрокаСтруктура.ДокументUUID = ДокументUUID;
		текСтрокаСтруктура.ТипДокумента = ТипДокумента;

		ЗаписатьДанныеПотоваруНаСервере(текСтрокаСтруктура);
		Модифицированность = Истина;
	//	Объект.Товары.Сортировать("НомерСтрокиДокумента");
		ПодсветитьСтроку(ИдентификаторСтроки);
	КонецЕсли;

	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") Тогда
		ОбновитьСуммуЗаказа();
	КонецЕсли;
	
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьСуммуЗаказа()  
	смЗам = 0;
	
	Для Каждого СтрЗам Из Объект.Товары Цикл 
		СумЗамСтрока =  СтрЗам.Количество * СтрЗам.Коэффициент * СтрЗам.Цена;
		смЗам = смЗам +СумЗамСтрока; 
	КонецЦикла;
	
	Элементы.ДекорацияСумЗам.Заголовок = "Сум. зам.- "  +Формат(смЗам,"ЧЦ=6");
	
КонецПроцедуры



&НаСервереБезКонтекста
Процедура ЗаписатьДанныеПотоваруНаСервере(СтруктураСтрокаТовара)
	РегистрыСведений.ДанныеВРаботе.ДобавитьЗапись(СтруктураСтрокаТовара);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВремяРаботыСДокументомНаСервере(СтруктураДанныеРаботы)
	РегистрыСведений.ВремяРаботыСДокументом.ДобавитьЗапись(СтруктураДанныеРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ПодготовкаВыгрузкаПеремещенияКлиенте()
	
	тРасхождения.Очистить();

	ВсегоПринято = Объект.Товары.Итог("КоличествоВведено");
	Если ВсегоПринято = 0 Тогда
		Для Каждого пТовары Из Объект.Товары Цикл 
			нтРс = тРасхождения.Добавить();	 
			нтРс.Количество = -пТовары.КоличествоПоставщика;
			нтРс.СтрокаТовара = пТовары.ИтогСтрокаДокумента;
		КонецЦикла; 
		
	Иначе
		
		Для Каждого пТовары Из Объект.Товары Цикл 
			расх = пТовары.КоличествоВведено - пТовары.КоличествоПоставщика;
			Если расх <> 0 Тогда
				нтРс = тРасхождения.Добавить();	 
				нтРс.Количество = расх;
				нтРс.СтрокаТовара = пТовары.ИтогСтрокаДокумента;
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;
	Если тРасхождения.Количество() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТаблицаРасхождений", тРасхождения);
			
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеАктПоПриему", ЭтотОбъект);
		
		ОткрытьФорму("ОбщаяФорма.ФормаВопрос", ДополнительныеПараметры, ЭтаФорма,,,,ОписаниеОповещения);
		
	Иначе
		ТекстВопроса = "Принято: "+Формат(ВсегоПринято,"ЧЦ=15; ЧДЦ=3; ЧН=0")+" из "+Формат(Объект.Товары.Итог("КоличествоПоставщика"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг "+Символы.ПС+"Закрыть окно с сохранением прихода?";	
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;
   // ВыгрузитьДокументНаКлиенте();
КонецПроцедуры
	

&НаКлиенте
Процедура ВыгрузитьДокумент(Команда)
	
	Если ХозОперация = "ПеремещениеТоваровИзФилиала" Тогда
		ПодготовкаВыгрузкаПеремещенияКлиенте();
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ОповещенияОтправки",ЭтотОбъект),"Вивантажити дані на сервер?",РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция ВыгрузитьДокументНаСервере()
	
	СтруктураДокумента = Новый Структура();
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка") Тогда
		СтруктураДокумента.Вставить("info",СокрЛП(НаименованиеТовара));
		СтруктураДокумента.Вставить("usluga",КонтрагентUUID);
		СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
		Если ФотоДокумента.Количество()>0 Тогда
			МассивФото = Новый Массив;
			
			Для Каждого Фото Из ФотоДокумента Цикл 
				СодержимоеФайла	 = Base64Строка(ПолучитьИзВременногоХранилища(Фото.ФотоСсылка));
				МассивФото.Добавить(Новый Структура("Фото",СодержимоеФайла));
			КонецЦикла;
			СтруктураДокумента.Вставить("ФотоДокумента", МассивФото);
			
		КонецЕсли;

		
		Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
		Возврат Рез;
	КонецЕсли;
	
	
	
	СтруктураДокумента.Вставить("ПечатьТСД",?(ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер(),1,0));
	Если ТочкаМаршрута = 4 Тогда
		СтруктураДокумента.Вставить("КоличествоСтикеров",КоличествоСтикеров); 
		СтруктураДокумента.Вставить("UUID_Принтер",ИД_Принтер);
	КонецЕсли;
	
	МассивТоваров = Новый Массив;
	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда
		СтруктураДокумента.Вставить("ТочкаДоставкиGLN",ТочкаДоставкиGLN);
		СтруктураДокумента.Вставить("ДатаЗаказа",Формат(ОбщепитДатаЗаказа,"ДФ=yyyyMMdd"));
		ПеремСтуктура = "Артикул,КоличествоВведено";
		Если Не ПустаяСтрока(ДокументUUID) Тогда
			СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID);
		КонецЕсли;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
		СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID);
		СтруктураДокумента.Вставить("ДоументСервер",Истина);
		СтруктураДокумента.Вставить("НачалоКонтроля",Формат(НачалоКонтроля,"ДФ=yyyyMMddЧЧммсс"));
		ПеремСтуктура = "Артикул,Количество,МРЦ,Коэффициент,КоличествоВведено";   
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
		СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
		Если Не ПустаяСтрока(ДокументUUID) Тогда
			СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID);
		КонецЕсли;

		ПеремСтуктура = "Артикул,Артикул2,Количество,МРЦ,Коэффициент,КоличествоВведено";   

	Иначе
		ПеремСтуктура = "Артикул,МРЦ,Количество,КоличествоВведено";
		
		СтруктураДокумента.Вставить("UUID_Склад",СкладUUID);
		СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
		СтруктураДокумента.Вставить("ДоументСервер",Ложь);
		Если Не ПустаяСтрока(ДокументUUID) Тогда
			СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID);
		КонецЕсли;
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уценка") Тогда
			СтруктураДокумента.Вставить("ПроцентУценки",ТипУценки.Код);
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратТоваров") Тогда
			СтруктураДокумента.Вставить("UUID_Контрагент",КонтрагентUUID);
			ПеремСтуктура = ПеремСтуктура + ",Коэффициент";
			
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") 
			ИЛИ	ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация") Тогда
			
			ПеремСтуктура = ПеремСтуктура+",КоличествоВведено";
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") Тогда
			СтруктураДокумента.Вставить("ДоументСервер",Истина);
			ПеремСтуктура = ПеремСтуктура + ",Коэффициент";
		ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
			
			ПеремСтуктура = ПеремСтуктура + ",СканированиеТовар,СканированиеЦенник,ЦенаПроверена,Продажи,Остаток";
			
		ИначеЕсли ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
			ПеремСтуктура = ПеремСтуктура + ",СканированиеТовар,СканированиеЦенник,ЦенаПроверена";
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Списание2") Тогда 		
		
		СтруктураДокумента.Вставить("Статья", СтатьяСписания.Код);				
		ПеремСтуктура = ПеремСтуктура + ",Коэффициент";						
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация") 
		ИЛИ	ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		ИЛИ	ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД")Тогда 
		
		ПеремСтуктура = ПеремСтуктура+",Продажи";	
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") 
		ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
		ОбновитьВремяРаботыСДокументом();
		СтруктураДокумента.Вставить("ЗакрыватьЗаказ",ЗакрыватьЗаказ);
		СтруктураДокумента.Вставить("ПНомер",ПоставщикаНомерНакладной);
		СтруктураДокумента.Вставить("ПДата",Формат(ПоставщикаДатаДокумента,"ДФ=yyyyMMdd"));
		СтруктураДокумента.Вставить("ОснованиеUUID",ОснованиеUUID);
		
		Если ФотоДокумента.Количество()>0 Тогда
			МассивФото = Новый Массив;
			
			Для Каждого Фото Из ФотоДокумента Цикл 
				СодержимоеФайла	 = Base64Строка(ПолучитьИзВременногоХранилища(Фото.ФотоСсылка));
				МассивФото.Добавить(Новый Структура("Фото",СодержимоеФайла));
			КонецЦикла;
			СтруктураДокумента.Вставить("ФотоДокумента", МассивФото);
			
		КонецЕсли;
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") Тогда
			СтруктураВремяРаботы =	СтруктураВремяРаботыСДокументом(ОснованиеUUID,ТипДокумента);
		Иначе
			СтруктураВремяРаботы = СтруктураВремяРаботыСДокументом(ДокументUUID,ТипДокумента);
		КонецЕсли;

		СтруктураДокумента.Вставить("ВремяРаботы",СтруктураВремяРаботы);
		
		
		
		ПеремСтуктура = ПеремСтуктура +",КоличествоПоставщика,КоличествоВведено,КоличествоРасхождение,ПричинаРасхожденияСтрока,ПричинаРасхожденияПорядок"; 
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда	 
		ПеремСтуктура = ПеремСтуктура+",КоличествоВведено,Коэффициент,СканированиеТовар,СканированиеЦенник";
		СтруктураДокумента.Вставить("UUID_Причина", ПричинаПеремещенияUUID);
		СтруктураДокумента.Вставить("UUID_СкладОтправитель", СкладОтправительUUID);

	КонецЕсли;
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		Для Каждого СтрТовар Из Объект.Товары Цикл 
			Если СтрТовар.КоличествоВведено > 0 Тогда
				СтруктураСтрока = Новый Структура(ПеремСтуктура);
				ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
				МассивТоваров.Добавить(СтруктураСтрока);
			КонецЕсли;
		КонецЦикла; 
		Если МассивТоваров.Количество() =  0 Тогда
			ВызватьИсключение "Таблица товаров пустая!";	
		КонецЕсли;
		
			
	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
		Для Каждого СтрТовар Из Объект.Товары Цикл 
			Если СтрТовар.Пересчет  Тогда
				СтруктураСтрока = Новый Структура(ПеремСтуктура);
				ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
				МассивТоваров.Добавить(СтруктураСтрока);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		Для Каждого СтрТовар Из Объект.Товары Цикл 
			Если СтрТовар.Пересчет Тогда
				СтруктураСтрока = Новый Структура("docid",СтрТовар.ДокументИД);
				МассивТоваров.Добавить(СтруктураСтрока); 
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		Для Каждого СтрТовар Из Объект.Товары Цикл 
			
			СтруктураСтрока = Новый Структура(ПеремСтуктура);
			ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
			МассивТоваров.Добавить(СтруктураСтрока);
			
		КонецЦикла;
	КонецЕсли;
	СтруктураДокумента.Вставить("Товары",МассивТоваров);
	
	Если  ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
	Иначе
		Рез = ИнтеграцияТК_ВызовСервера.ОтправитьДанныеОбщепит("Отгрузка",ТочкаДоставкиGLN,СтруктураДокумента);
	КонецЕсли;
	
	Возврат Рез;

КонецФункции

&НаСервере
Функция ПодготовитьСруктуруАкта()
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("UUID_Склад",СкладUUID);
	СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
	СтруктураДокумента.Вставить("ПНомер",ПоставщикаНомерНакладной);
	СтруктураДокумента.Вставить("ПДата",Формат(ПоставщикаДатаДокумента,"ДФ=yyyyMMdd"));
	СтруктураДокумента.Вставить("ОснованиеUUID",ОснованиеUUID);
	СтруктураДокумента.Вставить("ДоументСервер",Ложь);

	
	МассивТоваров = Новый Массив;
	ПеремСтуктура = "Артикул,КоличествоПоставщика,КоличествоВведено,КоличествоРасхождение,ПричинаРасхожденияСтрока";

	Для Каждого СтрТовар Из Объект.Товары Цикл 
		Если СтрТовар.КоличествоРасхождение = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		СтруктураСтрока = Новый Структура(ПеремСтуктура);
		ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
		МассивТоваров.Добавить(СтруктураСтрока);
		
	КонецЦикла;
	СтруктураДокумента.Вставить("Товары",МассивТоваров);

	Возврат СтруктураДокумента;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруПереоценки()
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("ИД_Переоценки",ИД_Переоценки);

	//
	МассивТоваров = Новый Массив;
	ПеремСтуктура = "Артикул,МРЦ";

	Для Каждого СтрТовар Из ТоварыПереоценки Цикл 
		Если СтрТовар.Вкл = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		
		СтруктураСтрока = Новый Структура(ПеремСтуктура);
		ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
		МассивТоваров.Добавить(СтруктураСтрока);
		
	КонецЦикла;
	СтруктураДокумента.Вставить("Товары",МассивТоваров);

	Возврат СтруктураДокумента;
	
КонецФункции




&НаСервере
Функция Печать()
	
	СтруктруаДокумента = ПодготовитьСруктуруАкта();
	ТипАкта = "АктПриемаЗаказ";
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
		ТипАкта = "АктПриемаПриход";
	КонецЕсли;
	
	
	Рез = ИнтеграцияТК_ВызовСервера.ИнициализироватьДанныеДляПечати(СтруктруаДокумента,ТипАкта);
	Если НЕ Рез.Результат Тогда
		Сообщить("Ошибка печати Акта!!" +Символы.ПС+ Рез.ОписаниеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	
	
	ТабДок = Обработки.ПанельМеню.ПечатьАкта(Рез.Ответ);
	
	Рез = ИнтеграцияТК_ВызовСервера.ПоставитьВочередьНаПечать(ТабДок,"АктПоставки");	
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПечатьПереоценки() 
	
	СтруктураДокумента = ПолучитьСтруктуруПереоценки();
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда	
		СтруктураДокумента.Вставить("ТипДокумента","ПечатьЦенниковТСД");
		Рез =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтруктураДокумента);
	Иначе
		Рез =  ИнтеграцияТК_ВызовСервера.ПечатьЦенниковОбъекта(СтруктураДокумента);
	КонецЕсли;
	
	Возврат  Рез
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда 
		ЗавершениеВыгрузкиДокументаНаКлиенте();
	КонецЕсли;
	
	Если РезультатВопроса.Значение = "Да" Тогда
		
		РезПечать =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(ДопоплнительныеПараметры);
		
		Если РезПечать.Результат Тогда
			ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(РезПечать.Ответ);
		Иначе
			Сообщить(РезПечать.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	ЗавершениеВыгрузкиДокументаНаКлиенте();	
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗавершениеВыгрузкиДокументаНаКлиенте()
	
	Сообщить("Документ вивантажено успішно");
	ВыполняетсяЗакрытие = Истина;
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД")
		ИЛИ ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ")
		ИЛИ ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.Уведомление")
		ИЛИ ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ВыдачаДС")Тогда
		Оповестить("ОбновитьЗадания");
	КонецЕсли;
	//удаляем накопленные данные
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") Тогда
		УдалитьДанныеВРаботе(ОснованиеUUID,ТипДокумента);
	Иначе
		УдалитьДанныеВРаботе(ДокументUUID,ТипДокумента);
	КонецЕсли;
	Если ДокументСервер Тогда
		Закрыть(Новый Структура("УдалитьСтроку"));
	Иначе
		Закрыть();
	КонецЕсли;
	

КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьДокументНаКлиенте(ТаблицаАкт = Неопределено,ФормироватьТУ = Ложь)
	  	
	Отказ = ПроверитьКорректность();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") Тогда 
		Рез = ВыгрузитьДокументПеремещениеНаСервере(ТаблицаАкт,ФормироватьТУ);
	Иначе
		Рез = ВыгрузитьДокументНаСервере();
	КонецЕсли;
	
	
	Если Рез.Результат Тогда
		КоличествоСтикеров = 0;
		ИД_Принтер = "";
		
		Если ТипЗнч(Рез.Ответ) = Тип("Структура") И Рез.Ответ.Свойство("print")
			И ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
			
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить("Да", "Так");
			Кнопки.Добавить("Нет", "Ні");
			ПараметрыНапоминания = Новый Структура;
			ПараметрыНапоминания.Вставить("Заголовок", "Увага");
			ПараметрыНапоминания.Вставить("ПредлагатьБольшеНеЗадаватьЭтотВопрос", Ложь);
			СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
			Новый ОписаниеОповещения("ПоказатьВопросЗавершение",ЭтотОбъект,Рез.Ответ.print), "Друкувати документ?", Кнопки, ПараметрыНапоминания);
			
		Иначе
			
			Если (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу"))  И  ЕстьАктРасхождения()
				И НЕ ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
				
				Рез = Печать();
				Если Не Рез.Результат Тогда
					Сообщить("Не удалось распечатать Акт "+ Символы.ПС+ Рез.ОписаниеОшибки);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			
			
			ЗавершениеВыгрузкиДокументаНаКлиенте();
			
		КонецЕсли;
		
		
	Иначе	
		
		Если ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
			Сообщить("Помилка вивантаження документа!");
		Иначе
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ТипЗнч(Рез.Ответ) = Тип("Структура") Тогда
		
		Если Рез.Ответ.Свойство("UUID_Документ")Тогда
			ДокументUUID = Рез.Ответ.UUID_Документ;
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьДанныеВРаботе(ДокументUUID,ТипДокумента);
	РегистрыСведений.ДанныеВРаботе.ОчиститьДанныеВРаботе(ДокументUUID,ТипДокумента);    
	РегистрыСведений.ВремяРаботыСДокументом.ОчиститьДанныеВРаботе(ДокументUUID,ТипДокумента); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураВремяРаботыСДокументом(ДокументUUID,ТипДокумента)   
	Возврат РегистрыСведений.ВремяРаботыСДокументом.ПолучитьСтруктуруВремяРаботыСдокументом(ДокументUUID,ТипДокумента); 
КонецФункции


&НаКлиенте
Функция ПроверитьКорректность()
	
	Отказ = Ложь;
	ОчиститьСообщения();
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уведомление")
		ИЛИ ТипДокумента =  ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка") 
		ИЛИ ТипДокумента =  ПредопределенноеЗначение("Справочник.ТипыДокументов.ВыдачаДС") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	Если Объект.Товары.Количество() = 0 Тогда
		 Сообщить("Таблица товаров пустая!");
		 Возврат Истина;
	КонецЕсли;
	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") 	 Тогда
		
		Отказ = ПроверитьТоварыИН();
	
		Если Отказ Тогда
			Сообщить("Не всі товари пораховані");	
			ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
		КонецЕсли;   
		
		Для Каждого стТов Из Объект.Товары Цикл 
			Если стТов.Весовой Тогда
				ТекОстаток = ?(стТов.Остаток<0,0,стТов.Остаток);	
				Если ТекОстаток = 0 И стТов.КоличествоВведено > 20 
					ИЛИ  стТов.КоличествоВведено > ТекОстаток * 1.2 Тогда
					Отказ = Истина;
					Сообщить("Введено підозріло велику кількість, перевірте товар "+стТов.НаименованиеТовара);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		Отказ = ПроверитьТоварыКонтроль();
		Если Отказ Тогда
			Сообщить("Немає товару для збереження");	
			ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
		КонецЕсли;

	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
			Отказ = ПроверитьТоварыИНТБД();
			Если Отказ Тогда
				Сообщить("Немає порахованих товарів");	
				ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
			КонецЕсли;

	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Списание2") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратТоваров") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уценка") Тогда 
		
		Если ПустаяСтрока(СкладUUID) Тогда
			Сообщить("Не выбран склад");
			Отказ =  Истина;
		КонецЕсли;

		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уценка") И Не ЗначениеЗаполнено(ТипУценки) Тогда
			Сообщить("Не выбран тип уценки");
			Отказ =  Истина;
		КонецЕсли;
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Списание2") И Не ЗначениеЗаполнено(СтатьяСписания) Тогда
			Сообщить("Не выбрана статья списания");
			Отказ =  Истина;
		КонецЕсли;

		
		Если ПроверитьПревышениеОстаткаВТЧТовары() Тогда
			Отказ = Истина;
			ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
		КонецЕсли;
		
		УстановитьОформление(Отказ,1);
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
		Если НЕ ЗначениеЗаполнено(ПоставщикаДатаДокумента) Тогда
			Отказ = Истина;
			Сообщить("Укажите дату накладной поставщика");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПоставщикаНомерНакладной) Тогда
			Отказ = Истина;
			Сообщить("Укажите номер накладной поставщика");
		КонецЕсли;
		КоличествоПринято = Объект.Товары.Итог("КоличествоВведено");
		Если КоличествоПринято = 0 Тогда
			 Сообщить("Документ необходимо заполнить");
			Отказ = Истина;
		КонецЕсли;
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
			стрОшибки = "";
			Для Каждого СтрТ Из Объект.Товары Цикл 
				Если СтрТ.КоличествоПоставщика <> СтрТ.КоличествоВведено И НЕ ЗначениеЗаполнено(СтрТ.ПричинаРасхождения) Тогда
					стрОшибки = стрОшибки + "Не принята строка №"+ СтрТ.НомерСтроки  +", "+ СтрТ.ТоварыЗаписьПоСтроке+Символы.ПС;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(стрОшибки) Тогда
				Отказ = Истина;
				стрОшибки = стрОшибки+"Укажите причину расхождения.";
				Сообщить(стрОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") Тогда 

		Если ПустаяСтрока(СкладUUID) Тогда 
			Отказ = Истина;
			Сообщить("Не выбран склад");
		КонецЕсли;
		
		Если ПустаяСтрока(СкладОтправительUUID) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнен склад отправитель");
		КонецЕсли;		

		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") И СкладТНП И ПустаяСтрока(ПричинаПеремещенияUUID) Тогда
			Отказ = Истина;
			Сообщить("Укажите причину перемещения на склад ТНП");
		КонецЕсли;
		
		
		Если ПустаяСтрока(ХозОперация) Тогда 
			Отказ = Истина;
			Сообщить("Не заполнена Хоз операция перемещения!");
		КонецЕсли;
		Если ХозОперация = "ПеремещениеТоваровИзФилиала" Тогда
			 Если ПроверитьПревышениеПриходаВТЧТовары() Тогда
				Отказ = Истина;
				ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
			КонецЕсли;
			
		Иначе	
			Если ПроверитьПревышениеОстаткаВТЧТовары() Тогда
				Отказ = Истина;
				ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
			КонецЕсли;
		КонецЕсли;
		

		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда 
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда 
  	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда 
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") Тогда 
		
		
		Если МинимальнаяСумма>0 Тогда   
			СуммаДок = 0;
			Для Каждого стТов Из Объект.Товары Цикл 
				    СумСтрока =  стТов.Количество*стТов.Коэффициент * стТов.Цена;
					СуммаДок = СуммаДок + СумСтрока
			КонецЦикла;
			
			Если СуммаДок < МинимальнаяСумма Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				   НСтр("ru='Минимальная сумма заказа %1 сумма документа %2'"),МинимальнаяСумма,СуммаДок));
				Отказ = Истина;
			КонецЕсли;
			
			
		КонецЕсли;
		
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда 
		мДокументы = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Истина)); 
		Если мДокументы.Количество() = 0 Тогда
			Сообщить("Нема документів!");	
			Отказ = Истина;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда  
		Если ТочкаМаршрута = 3 Тогда 
			Возврат Отказ;
		КонецЕсли;
		
		Если ПроверитьПревышениеОстаткаВТЧТовары("КоличествоВведено") Тогда
			Отказ = Истина;
			ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаТовары;
		КонецЕсли;
	
		
	Иначе		
		
		Если ПустаяСтрока(СкладUUID) Тогда
			Сообщить("Не выбран склад");
			Отказ =  Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Отказ;

КонецФункции

&НаКлиенте
Функция ЕстьАктРасхождения()
	
	КоличествоРасхождение =  Объект.Товары.Итог("КоличествоРасхождение");
	
	Возврат КоличествоРасхождение <> 0;
	
КонецФункции


&НаКлиенте
Функция ПроверитьПревышениеОстаткаВТЧТовары(КоличествоПроверки = "Количество")
	КоличествоПревышаетОстаток = Ложь;
	
	КолвоТоваров = Объект.Товары.Количество();
	
	Если КолвоТоваров = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;		
	
	Для Ит = 0 По КолвоТоваров - 1 Цикл
		ТекСтрока = Объект.Товары[Ит];
		ТекСтрока.ПревышенОстаток = ТекСтрока[КоличествоПроверки] > ТекСтрока.Остаток - ТекСтрока.Продажи;
		
		Если ТекСтрока.ПревышенОстаток Тогда 
			КоличествоПревышаетОстаток = Истина;								
			
			текстМРЦ = "";
			Если ТекСтрока.ИспМРЦ Тогда
				текстМРЦ = " МРЦ - "+  ТекСтрока.МРЦ+" "; 
			КонецЕсли;
			
			ТекстОшибки = "[" + СокрЛП(ТекСтрока.Артикул) + "] " + СокрЛП(ТекСтрока.НаименованиеТовара)+ текстМРЦ + " нет достаточного количества, доступное количество - " + Строка(ТекСтрока.Остаток - ТекСтрока.Продажи);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Товары[" + Ит + "].ТоварыКоличество";
			Сообщение.Текст = ТекстОшибки;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоПревышаетОстаток Тогда 
		Сообщить("Отредактируйте количество!");
	КонецЕсли;
	
	Возврат КоличествоПревышаетОстаток;
КонецФункции

///Прием перемещения не больше отгрузки
&НаКлиенте
Функция ПроверитьПревышениеПриходаВТЧТовары()
	КоличествоПревышаетОстаток = Ложь;
	
	КолвоТоваров = Объект.Товары.Количество();
	
	Если КолвоТоваров = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;		
	
	Для Ит = 0 По КолвоТоваров - 1 Цикл
		ТекСтрока = Объект.Товары[Ит];
		ТекСтрока.ПревышенОстаток = ТекСтрока.Количество >ТекСтрока.КоличествоПоставщика;
		
		Если ТекСтрока.ПревышенОстаток Тогда 
			КоличествоПревышаетОстаток = Истина;								
			
			текстМРЦ = "";
			Если ТекСтрока.ИспМРЦ Тогда
				текстМРЦ = " МРЦ - "+  ТекСтрока.МРЦ+" "; 
			КонецЕсли;
			
			ТекстОшибки = "[" + СокрЛП(ТекСтрока.Артикул) + "] " + СокрЛП(ТекСтрока.НаименованиеТовара)+ текстМРЦ + " можно принять максимум - " + Строка(ТекСтрока.КоличествоПоставщика);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Товары[" + Ит + "].ТоварыКоличество";
			Сообщение.Текст = ТекстОшибки;
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоПревышаетОстаток Тогда 
		Сообщить("Отредактируйте количество!");
	КонецЕсли;
	
	Возврат КоличествоПревышаетОстаток;
КонецФункции




&НаСервере
Функция ПроверитьТоварыИН()
	Отказ = Ложь;
	мСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Ложь));	
	Если мСтрок.Количество() > 0 Тогда
		Отказ =  Истина;
	КонецЕсли;
	 УстановитьОформление(Отказ,0);
	Возврат Отказ;
	
КонецФункции
&НаСервере
Функция ПроверитьТоварыИНТБД()
	Отказ = Ложь;
	мСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Истина));	
	Если мСтрок.Количество() = 0 Тогда
		Отказ =  Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции
&НаСервере
Функция ПроверитьТоварыКонтроль()
	Отказ = Ложь;
	Если Объект.Товары.Итог("КоличествоВведено") = 0 Тогда
		Отказ =  Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции



&НаСервере
Процедура УстановитьОформление(ПометкаВидимость,Элемент)
		
	
	уоВидимость = ЭтаФорма.УсловноеОформление.Элементы.Получить(Элемент);
	уоВидимость.Использование = ПометкаВидимость;

КонецПроцедуры

&НаКлиенте
Процедура ОповещенияОтправки(Результат, Параметры)Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыгрузитьДокументНаКлиенте();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеАктПоПриему(Результат, Параметры)Экспорт
	
	Если Результат.СоздатьАКТ Тогда   
		Если ФормироватьТУ Тогда	
			ИдетПроцессСканированияПринтера = Истина;  
			Параметрыф = Новый Структура;
			ОповещениеПечатьКоробки = Новый ОписаниеОповещения("ОповещениеПринтерОтсканирован", ЭтотОбъект,Результат);
			ОткрытьФорму("ОбщаяФорма.ПечатьКоробки",Параметрыф,ЭтотОбъект,,,,ОповещениеПечатьКоробки,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
		Иначе
			ВыгрузитьДокументНаКлиенте(Результат.ТабицаПричин);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
 
 &НаСервереБезКонтекста
Функция ПроверитьПринтерПечати(ШК) Экспорт  
	
	текстЗапроса = "/Complect/"+ПараметрыСеанса.UUID+"/prnp?uuidcom="+ПараметрыСеанса.Сотрудник_ID+"&chk="+ШК;
	РезОтвет = КомплектовщикТК.ПодготовитьGETЗапрос(текстЗапроса);
	Если РезОтвет.Результат Тогда
		ПринтерРабочий = Истина;
	Иначе  
		ПринтерРабочий = Ложь;
	КонецЕсли;
	
	Возврат Новый Структура("ПринтерРабочий,ТекстОшибки",ПринтерРабочий,РезОтвет.ОписаниеОшибки);	
	
КонецФункции


  &НаКлиенте
Процедура ОповещениеПринтерОтсканирован(Результат,Параметры)Экспорт
	
	ИдетПроцессСканированияПринтера = Ложь;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	ИД_Принтер = Результат.ИД_Принтер;
	КоличествоСтикеров = Результат.КоличествоСтикеров;

	ВыгрузитьДокументНаКлиенте(Параметры.ТабицаПричин,Истина);

	
КонецПроцедуры 

  &НаКлиенте
Процедура ОповещениеПринтерОтсканированТочкаМаршрута4(Результат,Параметры)Экспорт
	
	ИдетПроцессСканированияПринтера = Ложь;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	ИД_Принтер = Результат.ИД_Принтер;
	КоличествоСтикеров = Результат.КоличествоСтикеров;

	ВыгрузитьДокументНаКлиенте();

	
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьВдокумент(Команда)

	Если ПустаяСтрока(Артикул) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСтроку();
	
КонецПроцедуры


&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВерунутьУИДПодразделения()
	Возврат ПараметрыСеанса.UUID;	
КонецФункции


&НаКлиенте
Функция ОбработатьШтрихКодПриходУход(ПолученныйШтрихкод,Параметры)
	Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод+"|zup|"+ВерунутьУИДПодразделения());
	
	Если Результат.Результат = ложь Тогда
		
		Если Не ПустаяСтрока(Результат.ОписаниеОшибки)Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);	
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;
	
	
	ТаблицаСотрудник.Очистить();
	ДекорацияСтатусСотрудник = "";
	
	Если Результат.Ответ.Свойство("zup") Тогда
		Для Каждого  тzup Из Результат.Ответ.zup Цикл 
			НоваяСтрока = ТаблицаСотрудник.Добавить();
			НоваяСтрока.Сотрудник =  тzup.EmployeeNeme;
			НоваяСтрока.СотрудникUUID =  тzup.EmployeeUUID;
			НоваяСтрока.Должность =  тzup.Position;
			НоваяСтрока.ДолжностьUUID =  тzup.PositionUUID;
			
			
			ДекорацияСтатусСотрудник = НоваяСтрока.Сотрудник;
			
		КонецЦикла;	
	КонецЕсли;
	
	Если Результат.Ответ.Свойство("zupPrihod") Тогда
		
		zupPrihod =  Результат.Ответ.zupPrihod;
		Если zupPrihod.Количество()= 1 Тогда
			Status = zupPrihod[0].Status; 
			Time   = zupPrihod[0].Time; 
			Если Не Status = Неопределено Тогда
				ДекорацияСтатусСотрудник = ДекорацияСтатусСотрудник+Символы.ПС +?( Status = Истина,"Приход","Уход");
			КонецЕсли; 
			
			Если Не Time = Неопределено Тогда
				ДекорацияСтатусСотрудник = ДекорацияСтатусСотрудник +" "+ Time;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат.Ответ.Свойство("КоличествоАнкет") Тогда
		Если Результат.Ответ.КоличествоАнкет > 0 Тогда
			Элементы.ДекорацияАнкетирование.Заголовок = "Информация по проверкам "+Формат(Результат.Ответ.КоличествоАнкет,"ЧЦ=2; ЧДЦ=0; ЧН=0");
			Элементы.ДекорацияАнкетирование.Видимость = Истина;
		Иначе 
			Элементы.ДекорацияАнкетирование.Видимость = Ложь;

		КонецЕсли;
	КонецЕсли;

	
	Элементы.ДекорацияСтатусСотрудник.Заголовок = ДекорацияСтатусСотрудник;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		
		Если НЕ ПользовательИнициализирован Тогда
			
			Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход")  Тогда
				Результат	= ОбработатьШтрихКодПриходУход(ПолученныйШтрихкод,Параметры);			
				
			Иначе	
				Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ПолученныйШтрихкод);
			
			КонецЕсли;
			Если Результат.Результат Тогда
				Оповестить("ИзмененСотрудник");
			Иначе
				Сообщить("Необхідна авторизація користувача");
			КонецЕсли;
			
			Возврат;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Рекламация") Тогда
			Возврат;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриходУход")  Тогда
				ОбработатьШтрихКодПриходУход(ПолученныйШтрихкод,Параметры);	
				Возврат;
		ИначеЕсли ПустаяСтрока(ДокументUUID) И ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
			
			ПолучитьДанныеПоРезерву(ПолученныйШтрихкод);
			Возврат;
		ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
			Если ПустаяСтрока(ДокументUUID)  Тогда
				ПолучитьДанныеМаршрутныйЛист(ПолученныйШтрихкод);	
				Возврат; 
			КонецЕсли;
			
			ОбработатьСтрокуМарштрутныйЛист(ПолученныйШтрихкод);
			Возврат;
		ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратПеремещение")Тогда
			Если Параметры.Свойство("ДокументыТочки") Тогда
				ПолучитьСписокПеремещенийВозвратТочки(ПолученныйШтрихкод);	
			Иначе
				ИзменитьСтатусДокументаПеремещение(ПолученныйШтрихкод);
			КонецЕсли;
			Возврат;
      	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.БезакцептныйПрием")Тогда
            ИзменитьСтатусДокументаПеремещение(ПолученныйШтрихкод);
            Возврат;
			
		КонецЕсли;
		
		
		
		ПараметрыТовара = "Остаток|ШтрихКод|ИспМРЦ";
		СкладЗапроса = "";
 		ЗапросНоменклатураВозрарт = ложь;
		//Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация") 
		//	ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		//	ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН")
		//	ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД")

		Если ТипыИнвентаризация() Тогда
			Если ПустаяСтрока(СкладUUID) Тогда
				Сообщить("Не выбран склад!");
				Возврат;
			КонецЕсли;
			
			ПараметрыТовара = ПараметрыТовара+"|Продажи|Коэффициент|АМ";
			СкладЗапроса = СкладUUID;
		ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров")  Тогда
			
			Если ПустаяСтрока(СкладОтправительUUID) Тогда
				Сообщить("Не выбран склад!");
				Возврат;
			КонецЕсли;
			
			ПараметрыТовара = ПараметрыТовара+"|Продажи|Коэффициент";
			СкладЗапроса = СкладОтправительUUID;
			
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Списание2")Тогда
			Если ПустаяСтрока(СкладUUID) Тогда
				Сообщить("Не выбран склад!");
				Возврат;
			КонецЕсли;
			
			ПараметрыТовара = ПараметрыТовара+"|Коэффициент";
			СкладЗапроса = СкладUUID;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратТоваров") Тогда
			Если ПустаяСтрока(СкладUUID) Тогда
				Сообщить("Не выбран склад!");
				Возврат;
			КонецЕсли;
			ПараметрыТовара = КонтрагентUUID;
			СкладЗапроса = СкладUUID;
			ЗапросНоменклатураВозрарт = Истина;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")  Тогда
			Если Элементы.СтраницаТовары.Видимость = Ложь Тогда
				Возврат;
			КонецЕсли;
			
			ОтсканированоТовар = ОтсканированоТовар + 1;
			ПараметрыТовара  = "ШтрихКод|Тара|ИспМРЦ";
		ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
			Если Элементы.СтраницаТовары.Видимость = Ложь Тогда
				Возврат;
			КонецЕсли;
			
			ОтсканированоТовар = ОтсканированоТовар + 1;

			ПараметрыТовара  = "ШтрихКод|Тара";
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
			ПараметрыТовара  = "ШтрихКод|Тара|ИспМРЦ";
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда	
			ПараметрыТовара   = "ШтрихКод|TBD|Цена|Остаток|ИспМРЦ|Продажи";
			Если ЗначениеЗаполнено(СкладUUID) Тогда
				СкладЗапроса = СкладUUID;
			КонецЕсли;
			
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда	
			ПараметрыТовара   = "ШтрихКод|Остаток|ИспМРЦ|ТНП";
			СкладЗапроса = СкладОтправительUUID;
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда	
			ПараметрыТовара   = "ШтрихКод|TBD|АМ|Цена|Остаток";  
		ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда	
			ПараметрыТовара = ПараметрыТовара+"|Продажи|Пересорт";

		КонецЕсли;
		
		ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьДанныеПоТоваруКлиент(ПолученныйШтрихкод,,Ложь,ПараметрыТовара,СкладЗапроса,ЗапросНоменклатураВозрарт);
	Иначе
		
		Если НЕ ПользовательИнициализирован Тогда
			
			ПолучитьДанныеПоАдресуДоставки(ПолученныйШтрихкод);	
				
			Возврат;
		КонецЕсли;

		ДанныеПоТовару = ИнтеграцияТК_Клиент.ПолучитьданныеПоТоваруОбщепит(ПолученныйШтрихкод);
		
	КонецЕсли;

	ОбработатьПолученныеДанные(ДанныеПоТовару,Параметры);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДиалогВводаМРЦ(СтруктураОтвета)
	
	
	Подсказка = НСтр("ru = '"+СтруктураОтвета.НаименованиеТовара+" МРЦ '");
	Подсказка = НСтр("ru = ' МРЦ '");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", Подсказка);
	ПараметрыФормы.Вставить("ФорматРедактирования", "ЧЦ=15; ЧДЦ=2");
	ПараметрыФормы.Вставить("ЗапросМРЦ");
	ПараметрыФормы.Вставить("Артикул",СтруктураОтвета.Артикул);
	ПараметрыФормы.Вставить("НаименованиеТовара",СтруктураОтвета.НаименованиеТовара);
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеВыбраноМРЦ", ЭтотОбъект,Новый Структура("Форма,СтруктураОтвета",ЭтаФорма,СтруктураОтвета));
	
	ОткрытьФорму("ОбщаяФорма.ВводЧисла", ПараметрыФормы,ЭтаФорма ,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыбраноМРЦ(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокаПоиска = "";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,"СтрокаПоиска","Вид",ВидПоляФормы.ПолеВвода);

	Если Результат = Неопределено ИЛИ Результат = 0 ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;  
	
	Если  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		СкладUUIDОстатка = СкладОтправительUUID;
	Иначе
		СкладUUIDОстатка = СкладUUID;
	КонецЕсли;

	РезОтвет = ИнтеграцияТК_ВызовСервера.ПолучитьОстатокТовара(ДополнительныеПараметры.СтруктураОтвета.Артикул,Результат,СкладUUIDОстатка);
	
	Если РезОтвет.Результат Тогда
		ДополнительныеПараметры.СтруктураОтвета.Вставить("Остаток",РезОтвет.Ответ.Остаток);
		Если РезОтвет.Ответ.Свойство("Продажа") Тогда
			ДополнительныеПараметры.СтруктураОтвета.Вставить("Продажи",РезОтвет.Ответ.Продажа);
		КонецЕсли;

	КонецЕсли;
	ДополнительныеПараметры.СтруктураОтвета.Вставить("МРЦ",Результат);
	
		
	ОбработатьПолученныеДанныеВыбор(ДополнительныеПараметры.СтруктураОтвета,ДополнительныеПараметры,Строка(Результат));	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыбранКонтрагент(Результат,ДанныеТовара)Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтрагентUUID =  Результат.UUID;
	Контрагент      =  Результат.Name;
	КонтрагентВыбран = Истина;
	Элементы.Контрагент.Заголовок = Контрагент;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);

	
	ОбработатьПолученныеДанныеВыбор(ДанныеТовара, ДополнительныеПараметры) 

	
КонецПроцедуры


&НаКлиенте
Процедура ЗвукОшибки(ВыполнитьОшибку = Ложь,ТекстОшибки ="")
	
	#Если МобильноеПриложениеКлиент Тогда
		
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение("errorscan",Истина);
		
	#КонецЕсли
	
	Если ВыполнитьОшибку Тогда
		
		 ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныеДанныеВыбор(ДанныеТовара, ДополнительныеПараметры,МРЦ="") 
	
		
	
	Если ВводкКоличества Тогда
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу")
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") 
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
			
			ИД_Строка = ОпределитьСтроку(ДанныеТовара.Артикул,МРЦ);
			Если ИД_Строка = Неопределено Тогда
				
				ЗвукОшибки(Истина,"Товара нет в накладной!");
				
			КонецЕсли;
			
			Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
				ОбработатьСрокуВыбор(ДанныеТовара);
			Иначе
				ОбработатьСтроку(ИД_Строка,ДанныеТовара);
				ПодсветитьСтроку(ИД_Строка);
			КонецЕсли;
			
		Иначе
			ОбработатьСрокуВыбор(ДанныеТовара);
			Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
				ИД_Строка = ОпределитьСтроку(ДанныеТовара.Артикул,МРЦ);
				Если ИД_Строка = Неопределено Тогда
					
					ЗвукОшибки(Истина,"Товара нет в накладной!");
				Иначе
					ЗаписатьДанныевРаботе(ИД_Строка);
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ИД_Строка = ОпределитьСтроку(ДанныеТовара.Артикул,МРЦ);
		
		Если ИД_Строка = Неопределено Тогда
			
			ЗвукОшибки(Истина,"Товара нет в накладной!");
			Возврат;
		КонецЕсли;

		
		ОбработатьСтроку(ИД_Строка,ДанныеТовара);
		
		//Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		//	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") 
		//	ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") 
		//	ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
			ПодсветитьСтроку(ИД_Строка);
		//КонецЕсли;
	КонецЕсли;
	
	СтрокаПоиска ="";
КонецПроцедуры



&НаКлиенте
Процедура ОбработатьПолученныеДанные(ДанныеПоТовару, ДополнительныеПараметры) Экспорт
	
	Если ДанныеПоТовару.Результат = ложь Тогда
		Сообщить(?(ЗначениеЗаполнено(ДанныеПоТовару.ОписаниеОшибки), ДанныеПоТовару.ОписаниеОшибки,"Данные по штрих коду не получены"));
		Возврат;
	КонецЕсли;
	
	ДанныеТовара = ДанныеПоТовару.Ответ;
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") 
		И ХозОперация = "ПеремещениеТоваровВФилиал" И СкладUUID = "b0855ae2-fd3e-11e3-8e10-0050568c0032" Тогда //РЦ Харьков
		МожемДобавлять = ДоступныеАртикулаНаВозвратРЦ(ДанныеТовара.Артикул);	
		Если Не МожемДобавлять Тогда
			Сообщить("Не можна додавати товар "+	ДанныеТовара.НаименованиеТовара);
			Возврат;
		КонецЕсли;  
	ИначеЕсли ТипыИнвентаризация() Тогда
		Если ДанныеТовара.АМ  = 0 И ДанныеТовара.Остаток = 0 Тогда
			Сообщить("Товар не в асортименті, перерахунок не можливий "+	Символы.ПС + ДанныеТовара.НаименованиеТовара); 
			Возврат;
	    КонецЕсли;
	КонецЕсли;
	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратТоваров") И НЕ КонтрагентВыбран Тогда
		Если ДанныеТовара.Контрагент.UUID.Количество()= 1 Тогда
			КонтрагентUUID =  ДанныеТовара.Контрагент.UUID[0];
			Контрагент      =  ДанныеТовара.Контрагент.Name[0];
			КонтрагентВыбран = Истина;
			Элементы.Контрагент.Заголовок = Контрагент;
			ОбработатьПолученныеДанныеВыбор(ДанныеТовара, ДополнительныеПараметры) 
		Иначе
			ОповещениеКонтрагент = Новый ОписаниеОповещения("ОповещениеВыбранКонтрагент", ЭтотОбъект,ДанныеТовара);
			ОткрытьФорму("ОбщаяФорма.ФормаВыбораКонтрагента",ДанныеТовара.Контрагент,ЭтаФорма,,,,ОповещениеКонтрагент,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;
		
	ИначеЕсли ДанныеТовара.Свойство("ИспМРЦ")  И Булево(ДанныеТовара.ИспМРЦ) Тогда
		
		
		///Костыль
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,"СтрокаПоиска","Вид",ВидПоляФормы.ПолеНадписи);
		
		ОткрытьДиалогВводаМРЦ(ДанныеТовара);
		
	Иначе
		ОбработатьПолученныеДанныеВыбор(ДанныеТовара, ДополнительныеПараметры) 
	КонецЕсли;
	
Конецпроцедуры


&НаСервере
Процедура ДобавитьСтроку()
	
	
	
	Если Количество > 0 ИЛИ  (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД")) Тогда
		
		ИдентификаторСтроки =	ОпределитьСтроку(Артикул,ТекМРЦ);
		
		ДанныеТовара = Новый Структура();
		ДанныеТовара.Вставить("Артикул",Артикул);
		ДанныеТовара.Вставить("НаименованиеТовара",НаименованиеТовара);
		ДанныеТовара.Вставить("НаименованиеЕдиницы",НаименованиеЕдиницы);
		ДанныеТовара.Вставить("ШтрихКод",ШтрихКод);
		ДанныеТовара.Вставить("Количество",Количество);
		ДанныеТовара.Вставить("Остаток",Остаток);
		ДанныеТовара.Вставить("Продажи",Продажи);
		ДанныеТовара.Вставить("Коэффициент",Коэффициент);
		ДанныеТовара.Вставить("ИспМРЦ",ТекИспМРЦ);
		ДанныеТовара.Вставить("МРЦ",ТекМРЦ);
		ДанныеТовара.Вставить("УсловиеВозврата",УсловиеВозврата);
		ДанныеТовара.Вставить("ДатаВозврата",ДатаВозврата);

	
		ОбработатьСтроку(ИдентификаторСтроки,ДанныеТовара);
		
	КонецЕсли;
	
	СтрокаНаименование = "";
	Артикул = "";
	НаименованиеТовара = "";
	НаименованиеЕдиницы = "";
	ШтрихКод = "";
	Количество = 0;
	Остаток =0;
	КоличествоВДокументе = 0;
	Продажи = 0;
	ТекМРЦ = "";
	ТекИспМРЦ=0;
	КоличествоПоставщика=0;
	ДатаВозврата = Неопределено;
	УсловиеВозврата = 0;

КонецПроцедуры


&НаСервере
Функция ОпределитьСтроку(Артикул,МРЦ="")
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") 
		ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") 
	   
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ")	Тогда
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Артикул", Артикул));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Возврат Неопределено;
			//ВызватьИсключение("Товара нет в накладной!");
		КонецЕсли;
		
	Иначе
		
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Артикул,МРЦ", Артикул,МРЦ));
		Если (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") ИЛИ ХозОперация = "ПеремещениеТоваровИзФилиала"
			ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") ) И НайденныеСтроки.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	

	КонецЕсли;                                                                     
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаТЧ = Объект.Товары.Добавить();
	Иначе
		СтрокаТЧ = НайденныеСтроки[0];
		
	КонецЕсли;
	
	Возврат СтрокаТЧ.ПолучитьИдентификатор();
	
КонецФункции


&НаСервере
Процедура ОбработатьСтроку(ИдентификаторСтроки,ДанныеТовара)

	
	ТекИдентификаторСтроки = ИдентификаторСтроки;
	
	СтрокаТовара = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);

	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		нКоличество =  СтрокаТовара.КоличествоВведено +Число(ДанныеТовара.Количество);
		Если нКоличество > СтрокаТовара.КоличествоПоставщика Тогда
			Сообщить("Отсканировано: "+Формат(нКоличество, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+Символы.ПС +" в Резерве: "+Формат(СтрокаТовара.КоличествоПоставщика, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ="),СтатусСообщения.ОченьВажное);
		Иначе
			СтрокаТовара.КоличествоВведено = нКоличество;
			СтрокаТовара.Пересчет = Истина;
			СтрокаТовара.ПричинаРасхожденияПорядок = ?(СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоПоставщика,"2","");
			СтрокаТовара.КоличествоРасхождение = СтрокаТовара.Количество -  нКоличество;
			ОбновитьЗаписьПоСтроке(,СтрокаТовара);
		КонецЕсли;
		Возврат;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		
		ЗаписьПоСтроке = СтрокаТовара.НаименованиеТовара;
		ЗаписьПоСтроке2 = СтрокаТовара.Получатель;
		Если ДанныеТовара.Свойство("Пересчет") Тогда
			СтрокаТовара.Пересчет = ДанныеТовара.Пересчет; 
		КонецЕсли;
		Возврат;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТовара,ДанныеТовара,"Артикул,ИспМРЦ,НаименованиеЕдиницы");
		СтрокаТовара.НаименованиеТовара = ДанныеТовара.НаименованиеТовара;
		СтрокаТовара.НаименованиеТовара2 = ДанныеТовара.Пересорт.НаименованиеТовара;
        СтрокаТовара.Весовой = ДанныеТовара.Весовой;
        СтрокаТовара.Артикул2 = ДанныеТовара.Пересорт.Артикул; 
		СтрокаТовара.Количество = СтрокаТовара.Количество+ДанныеТовара.Количество;	
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено+ДанныеТовара.Пересорт.Количество;
		СтрокаТовара.КоличествоПоставщика = ДанныеТовара.Пересорт.Количество;
		СтрокаТовара.ТоварыЗаписьПоСтроке =  СтрокаТовара.НаименованиеТовара +" х "+ Формат(СтрокаТовара.Количество, ?(СтрокаТовара.Весовой,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()));
		СтрокаТовара.ТоварыЗаписьПоСтроке2 =  СтрокаТовара.НаименованиеТовара2 +" х "+ Формат(СтрокаТовара.КоличествоВведено, ?(СтрокаТовара.Весовой,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()));
        //		Формат(СтрокаТовара.СканированиеТовар,?(СтрокаТовара.Весовой,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())),

		Возврат;
	КонецЕсли;
	
	
	
	ЗаписьПоСтроке = НСтр("ru = '%Артикул% %ШтрихКод% %НаименованиеТовара%'");

	ЗаполнитьЗначенияСвойств(СтрокаТовара,ДанныеТовара,"Артикул,НаименованиеТовара,НаименованиеЕдиницы");

	Если ДанныеТовара.Свойство("Цена") Тогда
		СтрокаТовара.Цена = Формат(ДанныеТовара.Цена,"ЧЦ=15; ЧДЦ=2; ЧН=");
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("Остаток") Тогда
		СтрокаТовара.Остаток =  ДанныеТовара.Остаток;
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("Коэффициент") Тогда
		СтрокаТовара.Коэффициент =  ДанныеТовара.Коэффициент;
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("Тара") Тогда
		СтрокаТовара.ЭтоТара =  ДанныеТовара.Тара;
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("ИспМРЦ") Тогда
		СтрокаТовара.ИспМРЦ =  Булево(ДанныеТовара.ИспМРЦ);
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("МРЦ") Тогда
		СтрокаТовара.МРЦ =  ДанныеТовара.МРЦ;
	КонецЕсли;

	
	Если ДанныеТовара.Свойство("Продажи") Тогда
		СтрокаТовара.Продажи = ДанныеТовара.Продажи;
		Продажи = ДанныеТовара.Продажи;
	КонецЕсли;
	Если ДанныеТовара.Свойство("Весовой") Тогда
		СтрокаТовара.Весовой = ДанныеТовара.Весовой;
	Иначе  
		СтрокаТовара.Весовой = ?(НРег(ДанныеТовара.НаименованиеЕдиницы)="кг",1,0);
	КонецЕсли;	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") Тогда
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено +Число(ДанныеТовара.Количество);
		СтрокаТовара.Пересчет = Истина;
		ОбновитьЗаписьПоСтроке(,СтрокаТовара);
		Возврат;
	КонецЕсли;
	

	СтрокаНаименование = "["+ДанныеТовара.Артикул+"]"+" "+"["+ДанныеТовара.ШтрихКод+"]"+Символы.ПС+ДанныеТовара.НаименованиеТовара;
	СтрокаНаименованиеТовара =  СтрокаТовара.НаименованиеТовара;
	Если СтрокаТовара.ИспМРЦ ИЛИ (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") и ЗначениеЗаполнено(СтрокаТовара.МРЦ)) Тогда
		  СтрокаНаименование = СтрокаНаименование + " МРЦ - "+СтрокаТовара.МРЦ;
		  СтрокаНаименованиеТовара = СтрокаНаименованиеТовара + " МРЦ - "+СтрокаТовара.МРЦ;
	КонецЕсли;

	
	
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")  
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") И СтрокаТовара.АМ = 0 Тогда
			
			СтрокаТовара.КоличествоВведено = 0;
			СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.КоличествоПоставщика;  
			СтрокаТовара.ПричинаРасхожденияПорядок ="5";
			ПричиныРасхождения = Перечисления.ПричиныРасхождения.НеАМ; 
			СтрокаТовара.ПричинаРасхождения = Перечисления.ПричиныРасхождения.НеАМ;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ДанныеПоТоваруГруппа,ГруппаПодвалКнопки", "Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,ПричиныРасхожденияГруппа", "Видимость",Истина);

		Иначе
			СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено + Число(ДанныеТовара.Количество);
			Если ДанныеТовара.Свойство("ШтрихКод") Тогда
				СтрокаТовара.ШтрихКод =  ДанныеТовара.ШтрихКод;
			КонецЕсли;
			
			
			Если СтрокаТовара.КоличествоВведено > СтрокаТовара.Количество Тогда
				Сообщить("Отсканировано: "+Формат(СтрокаТовара.КоличествоВведено, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+Символы.ПС +"Заказано: "+Формат(СтрокаТовара.Количество, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ="));
				
				СтрокаТовара.КоличествоВведено = СтрокаТовара.Количество;
				СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.КоличествоПоставщика - СтрокаТовара.КоличествоВведено;
				
				
				ТаблицаСтрока.Очистить();
				стТаблицаСтрока = ТаблицаСтрока.Добавить();
				ЗаполнитьЗначенияСвойств(стТаблицаСтрока,СтрокаТовара);
				стТаблицаСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
				стТаблицаСтрока.СтрокаЗакПод =  Формат(стТаблицаСтрока.Количество,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+" \ "+Формат(стТаблицаСтрока.КоличествоПодтверждено,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=");
				
				Элементы.ДекорацияАртикул.Заголовок = СтрокаТовара.Артикул+" ("+СтрокаТовара.НаименованиеЕдиницы+")";
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,ДанныеПоТоваруГруппа", "Видимость",Истина);
				
			Иначе
				СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.КоличествоПоставщика - СтрокаТовара.КоличествоВведено;
				
			КонецЕсли;  
		КонецЕсли;
		
		ЗаписьПоСтроке2 = НСтр("ru = 'Принято %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%'");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		
		
	ИначеЕсли  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда
		
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено + Число(ДанныеТовара.Количество);
		Если ДанныеТовара.Свойство("ШтрихКод") Тогда
			СтрокаТовара.ШтрихКод =  ДанныеТовара.ШтрихКод;
		КонецЕсли;
		
		Если СтрокаТовара.КоличествоВведено > СтрокаТовара.Количество Тогда
			Сообщить("Отсканировано: "+Формат(СтрокаТовара.КоличествоВведено, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+Символы.ПС +"Заказано: "+Формат(СтрокаТовара.Количество, "ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ="));
			
			СтрокаТовара.КоличествоВведено = СтрокаТовара.Количество;
			СтрокаТовара.КоличествоРасхождение =   СтрокаТовара.Количество - СтрокаТовара.КоличествоВведено;
			
			
			ТаблицаСтрока.Очистить();
			стТаблицаСтрока = ТаблицаСтрока.Добавить();
			ЗаполнитьЗначенияСвойств(стТаблицаСтрока,СтрокаТовара);
			стТаблицаСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			стТаблицаСтрока.СтрокаЗакПод =  Формат(стТаблицаСтрока.Количество,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+" \ "+Формат(стТаблицаСтрока.КоличествоПодтверждено,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=");
			
			Элементы.ДекорацияАртикул.Заголовок = СтрокаТовара.Артикул+" ("+СтрокаТовара.НаименованиеЕдиницы+")";
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,ДанныеПоТоваруГруппа", "Видимость",Истина);
			
		Иначе
			СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.Количество - СтрокаТовара.КоличествоВведено;
			
		КонецЕсли;

		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%'");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		
	ИначеЕсли   ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание")  Тогда
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено + Число(ДанныеТовара.Количество);
		СтрокаТовара.КоличествоПодтверждено = СтрокаТовара.КоличествоВведено;
		//КоличествоПостроке  =  СтрокаТовара.Количество + ?(ДанныеТовара.Количество = 0,1,ДанныеТовара.Количество);
		//СтрокаТовара.Остаток = ДанныеТовара.Остаток;
		КоличествоВДокументе =  СтрокаТовара.КоличествоВведено;
		СтрокаТовара.Пересчет = Истина;
		
		Если СтрокаТовара.Количество < СтрокаТовара.КоличествоВведено Тогда
			Сообщить("Нельзя отгружать больше чем в заявке!");
			СтрокаТовара.КоличествоВведено = СтрокаТовара.Количество;
			СтрокаТовара.КоличествоПодтверждено = СтрокаТовара.Количество;
            КоличествоВДокументе   = СтрокаТовара.Количество;

       	КонецЕсли;
		
		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%  ост. %Остаток%'");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));

		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Остаток%",           Формат(СтрокаТовара.Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	ИначеЕсли ТипыИнвентаризация() Тогда
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено + Число(ДанныеТовара.Количество);
		СтрокаТовара.Количество = СтрокаТовара.КоличествоВведено;
		СтрокаТовара.КоличествоПодтверждено = СтрокаТовара.КоличествоВведено;

		СтрокаТовара.Пересчет = Истина;
		КоличествоВДокументе =  СтрокаТовара.КоличествоВведено;

		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент% '");
		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент% прод. %Продажи%'");

		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Продажи%",          Строка(СтрокаТовара.Продажи));

		
	ИначеЕсли   ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") Тогда
	  КоличествоПостроке  =  СтрокаТовара.Количество + ?(ДанныеТовара.Количество = 0,1,ДанныеТовара.Количество);
		
	  
	  СтрокаТовара.Количество	= КоличествоПостроке;
	  КоличествоВДокументе =  СтрокаТовара.Количество;
	//  Количество           =  СтрокаТовара.Количество;
	  Остаток              =  СтрокаТовара.Остаток;
	  
	  
	  Если  ЦветоваяИндикация Тогда
		  СтрокаТовара.КоличествоВведено = СтрокаТовара.Количество;
		  СтрокаТовара.КоличествоРасхождение =  СтрокаТовара.Количество - СтрокаТовара.КоличествоПоставщика;
		  
		  ЗаписьПоСтроке2 = НСтр("ru = 'Принято %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%'");
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(?(СтрокаТовара.Коэффициент>1,СтрокаТовара.Количество/СтрокаТовара.Коэффициент,СтрокаТовара.Количество), ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(?(СтрокаТовара.Коэффициент>1,СтрокаТовара.КоличествоПоставщика/СтрокаТовара.Коэффициент,СтрокаТовара.КоличествоПоставщика), ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));

		  
		  
	  Иначе
		  
		  ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% %НаименованиеЕдиницы% Х %Коэффициент%  ост. %Остаток%'");
		  
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(?(СтрокаТовара.Коэффициент>1,СтрокаТовара.Количество/СтрокаТовара.Коэффициент,СтрокаТовара.Количество), ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Остаток%",           Формат(Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		  
	  КонецЕсли
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
			СтрокаТовара.СканированиеТовар = СтрокаТовара.СканированиеТовар + ДанныеТовара.БезЦенника; 
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
	        СтрокаТовара.СканированиеТовар = СтрокаТовара.СканированиеТовар + ?( ДанныеТовара.БезЦенника = 1,  ДанныеТовара.Количество,0);
		Иначе
			СтрокаТовара.СканированиеТовар = СтрокаТовара.СканированиеТовар + ДанныеТовара.Количество; 
		КонецЕсли;
		
	    СтрокаТовара.СканированиеЦенник = СтрокаТовара.СканированиеЦенник + ДанныеТовара.ЕстьСверка;
		СтрокаТовара.ЦенаПроверена = СтрокаТовара.ЦенаПроверена + ДанныеТовара.ЦенаПроверена;
		СтрокаТовара.СпецЦена =  ДанныеТовара.СпецЦена;

		Если ЗначениеЗаполнено(ДанныеТовара.ЦенаЦенник) И ДанныеТовара.ЦенаЦенник <> СтрокаТовара.ЦенаЦенник Тогда
			СтрокаТовара.ЦенаЦенник = ДанныеТовара.ЦенаЦенник;
		КонецЕсли;
		
		
		Если СтрокаТовара.СканированиеТовар > 0 И  СтрокаТовара.СканированиеЦенник > 0 Тогда
			СтрокаТовара.Пересчет  = Истина;
			СтрокаТовара.КоличествоРасхождение = 0
		Иначе
			СтрокаТовара.КоличествоРасхождение = 1
		КонецЕсли;
		
		СтрокаПодстановки = НСтр("ru = 'к.Тов. %1 / к.Цен. %2 тЦ. %3 / цЦ. %4 Ост. %5'; ua = 'к.Тов. %1 / к.Цін. %2  тЦ. %3 / цЦ. %4 Ост. %5'");

		ЗаписьПоСтроке2 = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодстановки,
		Формат(СтрокаТовара.СканированиеТовар,?(СтрокаТовара.Весовой,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())),
		Формат(СтрокаТовара.СканированиеЦенник,ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()),
		Формат(СтрокаТовара.Цена,ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()),
		Формат(СтрокаТовара.ЦенаЦенник,ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()),
		Формат(СтрокаТовара.Остаток,ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())
		);
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
			Если ДанныеТовара.Свойство("АМ") Тогда
				СтрокаТовара.АМ = ДанныеТовара.АМ;
			КонецЕсли;
			АМ = "н/а ";
			Если СтрокаТовара.АМ = 1 Тогда
			   АМ = "АМ ";
		   КонецЕсли;
		   
			ЗаписьПоСтроке2 = АМ + ЗаписьПоСтроке2;
		КонецЕсли;
		
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		СтрокаТовара.Пересчет  = Истина;
		СтрокаТовара.УсловиеВозврата   = ДанныеТовара.УсловиеВозврата;
		СтрокаТовара.КоличествоВведено = СтрокаТовара.КоличествоВведено + ДанныеТовара.Количество;
		СтрокаПодстановки = НСтр("ru = 'Дней %1 / %2 ост. %3'; ua = 'Днів %1 / %2 ост. %3'");
		Если ДанныеТовара.УсловиеВозврата = 0 Тогда
			тДатаВозврата = "ДО ПРОСРОКА";
		Иначе
			тДатаВозврата  = Формат(ТекущаяДата() + (60*60*24* ДанныеТовара.УсловиеВозврата),ЗначениеНастроекПовтИсп.ФорматДатыДата());
		КонецЕсли;
		
		ЗаписьПоСтроке2 = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодстановки,
			СтрокаТовара.УсловиеВозврата,
			тДатаВозврата,
			Формат(СтрокаТовара.Остаток,ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()));
		
		
	Иначе
		КоличествоПостроке  =  СтрокаТовара.Количество + ?(ДанныеТовара.Количество = 0,1,ДанныеТовара.Количество);
		Остаток = ДанныеТовара.Остаток;

		
		Если КонтрольОстатка тогда
			СтрокаТовара.Количество	= Мин(КоличествоПостроке,Остаток);
		Иначе
			СтрокаТовара.Количество	= КоличествоПостроке;
		КонецЕсли;
		КоличествоВДокументе =  СтрокаТовара.Количество;
		Количество           =  СтрокаТовара.Количество;
		
	  
	  ЗаписьПоСтроке2 = НСтр("ru = '%Количество% %НаименованиеЕдиницы% Х %Коэффициент%'");
	  
	  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
	  ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));

	КонецЕсли;
	
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Артикул%",            СтрокаТовара.Артикул);
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ШтрихКод%",           СтрокаТовара.ШтрихКод);
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НаименованиеТовара%", СтрокаНаименованиеТовара);
	
	СтрокаТовара.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;
	СтрокаТовара.ТоварыЗаписьПоСтроке2 = ЗаписьПоСтроке2;
	СтрокаТовара.ИтогСтрокаДокумента = ЗаписьПоСтроке + Символы.ПС + ЗаписьПоСтроке2;


		
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация") 
		ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") 
		ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД") 
		Тогда
		СтрокаТовара.Пересчет = Истина;
	ИначеЕсли (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу") ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу")) И ВводкКоличества Тогда
		
		ТаблицаСтрока.Очистить();
		стТаблицаСтрока = ТаблицаСтрока.Добавить();
		ЗаполнитьЗначенияСвойств(стТаблицаСтрока,СтрокаТовара);
		стТаблицаСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		стТаблицаСтрока.НаименованиеТовара  = СтрокаНаименованиеТовара;
		стТаблицаСтрока.СтрокаЗакПод =  Формат(стТаблицаСтрока.Количество,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+" \ "+Формат(стТаблицаСтрока.КоличествоПодтверждено,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=");
		
		Элементы.ДекорацияАртикул.Заголовок = СтрокаТовара.Артикул+" ("+СтрокаТовара.НаименованиеЕдиницы+")";
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") И  СтрокаТовара.АМ =0 Тогда
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,ДанныеПоТоваруГруппа", "Видимость",Истина);
		КонецЕсли;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") И ВводкКоличества Тогда
		
		ТаблицаСтрока.Очистить();
		стТаблицаСтрока = ТаблицаСтрока.Добавить();
		ЗаполнитьЗначенияСвойств(стТаблицаСтрока,СтрокаТовара);
		стТаблицаСтрока.ИдентификаторСтроки = ИдентификаторСтроки;

		стТаблицаСтрока.СтрокаЗакПод =  Формат(стТаблицаСтрока.Количество,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=")+" \ "+Формат(стТаблицаСтрока.КоличествоВведено,"ЧЦ=15; ЧДЦ=3; ЧН=; ЧГ=");
		
		Элементы.ДекорацияАртикул.Заголовок = СтрокаТовара.Артикул+" ("+СтрокаТовара.НаименованиеЕдиницы+")";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока,ДанныеПоТоваруГруппа", "Видимость",Истина);
	КонецЕсли;
	
	ДанныеВРаботеЗаписатьСтрокуТовара(СтрокаТовара);
	ОбновитьВремяРаботыСДокументом();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныевРаботе(ИдентификаторСтроки) 
	
	СтрокаТовара = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);

	ДанныеВРаботеЗаписатьСтрокуТовара(СтрокаТовара); 
	
КонецПроцедуры 

&НаСервере
Процедура ОбновитьВремяРаботыСДокументом()
	
	СтруктураРаботы = Новый Структура("ДокументUUID,ТипДокумента,НачалоРаботыСдокументом,ДокументОткрытСекунд,ОтсканированоТовар,ВводВручнуюТовар");
	Если ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда
		СтруктураРаботы.ДокументUUID =  ОснованиеUUID;  
	Иначе
		СтруктураРаботы.ДокументUUID =  ДокументUUID;  
	КонецЕсли;
	
	СтруктураРаботы.ТипДокумента = ТипДокумента;
	СтруктураРаботы.НачалоРаботыСдокументом = НачалоРаботыСдокументом;
	СтруктураРаботы.ДокументОткрытСекунд = ДокументОткрытСекунд +  (ТекущаяДата() -НачалоКонтроля) ;
	СтруктураРаботы.ОтсканированоТовар = ОтсканированоТовар;
	СтруктураРаботы.ВводВручнуюТовар = ВводВручнуюТовар;
	
	
	ЗаписатьВремяРаботыСДокументомНаСервере(СтруктураРаботы);
	
КонецПроцедуры


&НаСервере
Процедура ДанныеВРаботеЗаписатьСтрокуТовара(ТекДанные,УдалитьЗапись = Ложь)
	
	Если  ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТБД 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеИН 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТНП 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПеремещениеТоваров
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеВФ Тогда
		
		Набор = РегистрыСведений.ДанныеВРаботе.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТипДокумента);
		Набор.Отбор.Артикул.Установить(ТекДанные.Артикул);
		Набор.Отбор.МРЦ.Установить(ТекДанные.МРЦ);
		Если УдалитьЗапись Тогда
			Набор.Записать();
		Иначе
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись,ТекДанные);
			Запись.ДокументUUID = ДокументUUID;
			Запись.ТипДокумента = ТипДокумента;
			Набор.Записать();
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры




&НаСервере
Процедура ОбновитьЗаписьПоСтроке(ИдентификаторСтроки = Неопределено,Знач Строка = Неопределено)
	
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТовара = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТовара = Строка;
	КонецЕсли;
	
	
	Если СтрокаТовара.ИспМРЦ  Тогда
		тНаименованиеТовара = СтрокаТовара.НаименованиеТовара  + " МРЦ - " + СтрокаТовара.МРЦ;
	Иначе
		тНаименованиеТовара = СтрокаТовара.НаименованиеТовара;
	КонецЕсли;
	
	
	ЗаписьПоСтроке = НСтр("ru = '%Артикул% %ШтрихКод% %НаименованиеТовара%'");
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Артикул%",      СтрокаТовара.Артикул);
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ШтрихКод%", СтрокаТовара.ШтрихКод);
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НаименованиеТовара%",      тНаименованиеТовара);
	
	//СтрокаТовара.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;

	Если ТипыДопПринять() Тогда 		
		ЗаписьПоСтроке2 = НСтр("ru = '%сдп% Прий. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%'");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%сдп%",      ?(ЗначениеЗаполнено(СтрокаТовара.ПриемДо), "ддп "+Формат(СтрокаТовара.ПриемДо,"ДФ=dd.MM.yyyy"),""));
		
		ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") Тогда
		ЗаписьПоСтроке2 = НСтр("ru = '%сдп% Прий. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%'");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(?(СтрокаТовара.Коэффициент>1,СтрокаТовара.Количество/СтрокаТовара.Коэффициент,СтрокаТовара.Количество), ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(?(СтрокаТовара.Коэффициент>1,СтрокаТовара.КоличествоПоставщика/СтрокаТовара.Коэффициент,СтрокаТовара.КоличествоПоставщика), ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));   
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%сдп%",      ?(ЗначениеЗаполнено(СтрокаТовара.ПриемДо), "ддп "+Формат(СтрокаТовара.ПриемДо,"ДФ=dd.MM.yyyy"),""));

	ИначеЕсли ТипыДокПодтвердить() Тогда
		
		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент%'");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
	ИначеЕсли   ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент% - ост. %Остаток% '");
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Остаток%",          	Формат(СтрокаТовара.Остаток,ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	ИначеЕсли ТипыИнвентаризация() Тогда	
		ЗаписьПоСтроке2 = НСтр("ru = 'Подтв. %КоличествоВведено% из %Количество%%НаименованиеЕдиницы% Х %Коэффициент% прод. %Продажи%'");
	  	ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%КоличествоВведено%",    Формат(СтрокаТовара.КоличествоВведено, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Остаток, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Продажи%",          	 Строка(СтрокаТовара.Продажи));
		
	
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ")Тогда
		
		
		СтрокаПодстановки = НСтр("ru = 'к.Тов. %1 / к.Цен. %2 тЦ. %3 / цЦ. %4 Ост. %5'; ua = 'к.Тов. %1 / к.Цін. %2  тЦ. %3 / цЦ. %4 Ост. %5'");
		
		ЗаписьПоСтроке2 = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодстановки,
		Формат(СтрокаТовара.СканированиеТовар,?(СтрокаТовара.Весовой,"ЧЦ=15; ЧДЦ=3; ЧРД=.; ЧН=0",ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())),
		Формат(СтрокаТовара.СканированиеЦенник,ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()),
		Формат(СтрокаТовара.Цена,ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()),
		Формат(СтрокаТовара.ЦенаЦенник,ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()),
		Формат(СтрокаТовара.Остаток,ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())
		);
		
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
			
			АМ = "н/а ";
			Если СтрокаТовара.АМ = 1 Тогда
				АМ = "АМ ";
			КонецЕсли;
			
			ЗаписьПоСтроке2 = АМ + ЗаписьПоСтроке2;
		КонецЕсли;
		
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		
		СтрокаПодстановки = НСтр("ru = 'Дней %1 / Дата %2 Ост. %3'; ua = 'Днів %1 / Дата %2 Ост. %3'");
		Если СтрокаТовара.УсловиеВозврата = 0 Тогда
			тДатаВозврата = "Н/Д";
		Иначе
			тДатаВозврата  = Формат(ТекущаяДата() + (60*60*24* СтрокаТовара.УсловиеВозврата),ЗначениеНастроекПовтИсп.ФорматДатыДата());
		КонецЕсли;
		
		ЗаписьПоСтроке2 = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаПодстановки,
			СтрокаТовара.УсловиеВозврата,
			тДатаВозврата,
			Формат(СтрокаТовара.Остаток,ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло())); 
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		 ЗаписьПоСтроке = тНаименованиеТовара;
		 ЗаписьПоСтроке2 = СтрокаТовара.Получатель;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВозвратПеремещение") 
		 Или ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.БезакцептныйПрием") Тогда
		 ЗаписьПоСтроке = тНаименованиеТовара;
		 ЗаписьПоСтроке2 = СтрокаТовара.Получатель;
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
		ЗаписьПоСтроке =  СтрокаТовара.НаименованиеТовара +" х "+ Формат(СтрокаТовара.Количество, ?(СтрокаТовара.Весовой,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()));
		ЗаписьПоСтроке2 =  СтрокаТовара.НаименованиеТовара2 +" х "+ Формат(СтрокаТовара.КоличествоВведено, ?(СтрокаТовара.Весовой,ЗначениеНастроекПовтИсп.ФорматВес(),ЗначениеНастроекПовтИсп.ФорматЦелоеЧисло()));

	Иначе
		
		ЗаписьПоСтроке2 = НСтр("ru = '%Количество% %НаименованиеЕдиницы% Х %Коэффициент%'");
		
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Количество%",           Формат(СтрокаТовара.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%НаименованиеЕдиницы%",  Строка(СтрокаТовара.НаименованиеЕдиницы));
		ЗаписьПоСтроке2 = СтрЗаменить(ЗаписьПоСтроке2, "%Коэффициент%",          Строка(СтрокаТовара.Коэффициент));
		
	КонецЕсли;
	СтрокаТовара.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;
	СтрокаТовара.ТоварыЗаписьПоСтроке2 = ЗаписьПоСтроке2;
	СтрокаТовара.ИтогСтрокаДокумента = ЗаписьПоСтроке + Символы.ПС + ЗаписьПоСтроке2;
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьСтрокуПриемаТовара()
	ДанныеСтроки =  ТаблицаСтрока[0];
	СтрокаТовара = Объект.Товары.НайтиПоИдентификатору(ДанныеСтроки.ИдентификаторСтроки);
	ЗаполнитьЗначенияСвойств(СтрокаТовара,ДанныеСтроки,"КоличествоВведено,КоличествоПоставщика,КоличествоРасхождение,ПричинаРасхождения");
	СтрокаТовара.ПричинаРасхожденияСтрока = Строка(СтрокаТовара.ПричинаРасхождения);
	ПорядокРасхождения  = "0";
	Если  СтрокаТовара.ПричинаРасхождения = Перечисления.ПричиныРасхождения.Недовоз Тогда
		ПорядокРасхождения = "1";
	ИначеЕсли    СтрокаТовара.ПричинаРасхождения = Перечисления.ПричиныРасхождения.ОтсутствиеВЗаказе Тогда
		ПорядокРасхождения = "2";
	ИначеЕсли    СтрокаТовара.ПричинаРасхождения = Перечисления.ПричиныРасхождения.Пересортица Тогда
		ПорядокРасхождения = "3";
	ИначеЕсли    СтрокаТовара.ПричинаРасхождения = Перечисления.ПричиныРасхождения.Бой Тогда
		ПорядокРасхождения = "4";
	ИначеЕсли    СтрокаТовара.ПричинаРасхождения = Перечисления.ПричиныРасхождения.НеАМ Тогда
		ПорядокРасхождения = "5";
	
	КонецЕсли;
	
	СтрокаТовара.ПричинаРасхожденияПорядок = ПорядокРасхождения;	
	
	Если ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда	
		текСтрокаСтруктура = ОбщегоНазначенияКлиентСервер.СтруктураДанныеВРаботе();
		ЗаполнитьЗначенияСвойств(текСтрокаСтруктура,СтрокаТовара);
		текСтрокаСтруктура.ДокументUUID = ОснованиеUUID;
		текСтрокаСтруктура.ТипДокумента = ТипДокумента;
		
		
		ЗаписатьДанныеПотоваруНаСервере(текСтрокаСтруктура); 
	КонецЕсли;
	
    ВводВручнуюТовар = ВводВручнуюТовар +1; 
	
	СтруктураРаботы = Новый Структура("ДокументUUID,ТипДокумента,НачалоРаботыСдокументом,ДокументОткрытСекунд,ОтсканированоТовар,ВводВручнуюТовар");
	Если ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда
		СтруктураРаботы.ДокументUUID =  ОснованиеUUID;  
	Иначе
		СтруктураРаботы.ДокументUUID =  ДокументUUID;  
	КонецЕсли;
	
	СтруктураРаботы.ТипДокумента = ТипДокумента;
	СтруктураРаботы.НачалоРаботыСдокументом = НачалоРаботыСдокументом;
	СтруктураРаботы.ДокументОткрытСекунд = ДокументОткрытСекунд +  (ТекущаяДата() -НачалоКонтроля) ;
	СтруктураРаботы.ОтсканированоТовар = ОтсканированоТовар;
	СтруктураРаботы.ВводВручнуюТовар = ВводВручнуюТовар;
	
	ЗаписатьВремяРаботыСДокументомНаСервере(СтруктураРаботы);	
	ОбновитьЗаписьПоСтроке(,СтрокаТовара);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуМарштрутныйЛист(ИД)
	
	
	ИД_Строка = ОпределитьСтрокуМаршрутныйЛист(ИД);
	
	Если ИД_Строка = Неопределено Тогда
		
		ЗвукОшибки(Истина,"Накладної немає у маршрутному листі!");
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура("Пересчет",Истина);
	
	ОбработатьСтроку(ИД_Строка,ДанныеСтроки);
	

	
КонецПроцедуры

&НаСервере
Функция ОпределитьСтрокуМаршрутныйЛист(ИД)
  	 	
	мБуферИд =  БуферИД.НайтиСтроки(Новый Структура("ИД",ИД));
	
	Если мБуферИд.Количество() =1 Тогда	
		СтрокиТЧ = Объект.Товары.НайтиСтроки(Новый Структура("ДокументИД",мБуферИд[0].ИД_Док));
		Если СтрокиТЧ.Количество() = 1 Тогда
			Возврат СтрокиТЧ[0].ПолучитьИдентификатор();
		КонецЕсли;	
	
	КонецЕсли;
	
	Возврат Неопределено;	

КонецФункции


&НаСервере
Функция ТипыДопПринять()
	
	РезВозврат = (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")	
	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу"));
	
	Возврат РезВозврат;
	
КонецФункции

&НаСервере
Функция ТипыИнвентаризация()
	
	РезВозврат = (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД")	
	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН")  
	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация")
	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация") );
	
	Возврат РезВозврат;

КонецФункции


&НаСервере
Функция ТипыДокПодтвердить()
	
	РезВозврат = (ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация")
	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер"));
	
	Возврат РезВозврат;
	
КонецФункции



&НаСервере
Процедура ОбработатьСрокуВыбор(ДанныеТовара);
	
	Артикул      = ДанныеТовара.Артикул;
	НаименованиеТовара = ДанныеТовара.НаименованиеТовара;
	НаименованиеЕдиницы      = ДанныеТовара.НаименованиеЕдиницы;
	
	Если ДанныеТовара.Свойство("Остаток") Тогда
		Остаток      = ДанныеТовара.Остаток;
	Иначе
		Остаток = 0;
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("Количество") Тогда
		Количество   = ДанныеТовара.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("Коэффициент") Тогда
		Коэффициент   = ДанныеТовара.Коэффициент;
	Иначе
		Коэффициент = 0;
	КонецЕсли;
	
	
	Если ДанныеТовара.Свойство("ШтрихКод") Тогда
		ШтрихКод   = ДанныеТовара.ШтрихКод;
	Иначе
		ШтрихКод = "";
	КонецЕсли;

	Если ДанныеТовара.Свойство("Продажи") Тогда
		Продажи   = ДанныеТовара.Продажи;
	Иначе
		Продажи = 0;
	КонецЕсли;
	Если ДанныеТовара.Свойство("ИспМРЦ") Тогда
		ТекИспМРЦ = ДанныеТовара.ИспМРЦ;
	Иначе
		ТекИспМРЦ = 0;
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("МРЦ") Тогда
		ТекМРЦ = Формат(ДанныеТовара.МРЦ,"ЧГ=");
	Иначе
		ТекМРЦ ="";
	КонецЕсли;
	
	Если ДанныеТовара.Свойство("СрокВозврата") Тогда
		УсловиеВозврата = ДанныеТовара.СрокВозврата;
		ДатаВозврата = ?(УсловиеВозврата = 0, Неопределено,ТекущаяДата() + (60*60*24* УсловиеВозврата));
	Иначе  
		ДатаВозврата = Неопределено;
		УсловиеВозврата = 0;
	КонецЕсли;
	

	
	
	
	СтрокаНаименование = НСтр("ru = '%Артикул% %ШтрихКод% %НаименованиеТовара%'");
	
	СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "%Артикул%", "["+Артикул+"]");
	СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "%ШтрихКод%", "["+ШтрихКод+"]");
	СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "%НаименованиеТовара%", Символы.ПС+НаименованиеТовара)+?(ЗначениеЗаполнено(ТекМРЦ)," МРЦ-"+ТекМРЦ,"");
	
	
	//ШтрихКод     = ДанныеТовара.ШтрихКод;
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Артикул,МРЦ",Артикул,ТекМРЦ));
	тКоличествоВДокументе = 0;
	
	
	Если ТипДокумента  = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер")Тогда
		тКоличествоПоставщика = 0;
		
		для Каждого СтрНС Из НайденныеСтроки Цикл 
			тКоличествоПоставщика = тКоличествоПоставщика + СтрНС.КоличествоПоставщика;
			тКоличествоВДокументе = тКоличествоВДокументе + СтрНС.КоличествоВведено;
		КонецЦикла;
		
		КоличествоПоставщика = тКоличествоПоставщика;	
	ИначеЕсли  ТипДокумента  = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП")Тогда
		
		для Каждого СтрНС Из НайденныеСтроки Цикл 
			  СтрНС.Пересчет = Истина;
			  СтрНС.СканированиеТовар = СтрНС.СканированиеТовар +1;
			  тКоличествоВДокументе = тКоличествоВДокументе + СтрНС.КоличествоВведено;
		  КонецЦикла;
		  Если ЗначениеЗаполнено(ТекМРЦ) Тогда
			  НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Артикул,МРЦ",Артикул,""));		
			  для Каждого СтрНС Из НайденныеСтроки Цикл 
				  СтрНС.Пересчет = Истина;
				  СтрНС.СканированиеТовар = СтрНС.СканированиеТовар +1;
				  тКоличествоВДокументе = тКоличествоВДокументе + СтрНС.КоличествоВведено;
			  КонецЦикла; 
		  КонецЕсли;
 
         Количество = 0;
	Иначе
		стрСкан =  ?(ТипДокумента  = ПредопределенноеЗначение("Справочник.ТипыДокументов.ИнвентаризацияТБД"),"КоличествоВведено","Количество");
		для Каждого СтрНС Из НайденныеСтроки Цикл 
			тКоличествоВДокументе = тКоличествоВДокументе + СтрНС[стрСкан];
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоВДокументе = тКоличествоВДокументе;
	
	Если Элементы.СтраницыПролистывания.ТекущаяСтраница <> Элементы.СтраницаСканирование Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.СтраницаСканирование;
	КонецЕсли;
	

	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТоварыВыбор(Элемент,,,);
КонецПроцедуры




&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ТекущаяСтрока()
	
	Элементы.Товары.ТекущаяСтрока = ТекИдентификаторСтроки;
	
КонецПроцедуры


&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если НЕ СтрокаТоваров = Неопределено Тогда
		Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;

		НомерСтрокиДляПодсветки = СтрокаТоваров.НомерСтроки;
		
		//Элементы.Товары.ТекущаяСтрока = ТекИдентификаторСтроки;
		
			ПодключитьОбработчикОжидания("Подключаемый_ТекущаяСтрока", 1,Истина);

		
		Если НЕ ГоризонтальнаяОриентацияЭкрана Тогда
			
			Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;
			
		КонецЕсли;
		
		
		
		ИнтервалСек = 2;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПосчитаные(Команда)
	 НеПосчитанныеСервер();
КонецПроцедуры

&НаСервере
Процедура НеПосчитанныеСервер()
	
	ПометкаВидимость = НЕ Элементы.НеПосчитаные.Пометка;
	Элементы.НеПосчитаные.Пометка = ПометкаВидимость;
	
	Если ПометкаВидимость Тогда
		Элементы.НеПосчитаные.Заголовок = "Все строки";
	Иначе
		Элементы.НеПосчитаные.Заголовок = "Недосчитанные";
	КонецЕсли;
	
	УстановитьОформление(ПометкаВидимость,0);

	
КонецПроцедуры

&НаКлиенте
Процедура ВводКоличества(Команда)
	
	ПереключениеРежимаВвода();
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеРежимаВвода()
	
	Пометка = НЕ Элементы.ВводКоличества.Пометка;
	Элементы.ВводКоличества.Пометка =  Пометка;
	ВводкКоличества =  Пометка;

	фЗаголовок = ?(ВводкКоличества, "Ручной ввод", "Авто ввод");
	Элементы.ВводКоличества.Заголовок = фЗаголовок;
	
	Если НЕ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоЗаказу")
		ИЛИ  НЕ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "Доступность",ВводкКоличества);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДобавитьВдокумент", "Видимость",
		ВводкКоличества
		);
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыОК(Команда)
	
	ДанныеСтроки =  ТаблицаСтрока[0];
	ДанныеСтроки.КоличествоРасхождение =  ДанныеСтроки.КоличествоПоставщика - ДанныеСтроки.КоличествоВведено;
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда
		
		Если ДанныеСтроки.ЭтоТара = 0 Тогда
			Если ДанныеСтроки.Количество < ДанныеСтроки.КоличествоВведено Тогда
				
				Если ДанныеСтроки.Весовой = 1 Тогда
					
					чКол = ДанныеСтроки.Количество*1.3;
					Если чКол <  ДанныеСтроки.КоличествоВведено Тогда
						Сообщить("Весовой товар! макс. "+Формат(чКол,"ЧЦ=15; ЧДЦ=3"));
						Возврат;
					КонецЕсли;
					
				Иначе
					Сообщить("Нельзя отгружать больше чем заказано!");
					Возврат;
				КонецЕсли;
				
				
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		
		Если ДанныеСтроки.Количество < ДанныеСтроки.КоличествоВведено Тогда
			
			
			
			Сообщить("Нельзя отгружать больше чем в заявке!");
			Возврат;
			
		КонецЕсли;
  	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") И ДанныеСтроки.АМ = 0 Тогда
		
		Если ДанныеСтроки.КоличествоВведено <> 0 Тогда
			Сообщить("товар не матриці");
		КонецЕсли; 
		ПричиныРасхождения = ПредопределенноеЗначение("Перечисление.ПричиныРасхождения.НеАМ");
		ДанныеСтроки.КоличествоВведено =0;   
		ДанныеСтроки.ПричинаРасхождения = ПричиныРасхождения;
		ДанныеСтроки.КоличествоРасхождение = ДанныеСтроки.КоличествоПоставщика;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДанныеПоТоваруГруппа", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПричиныРасхожденияГруппа", "Видимость",Истина);
		Возврат;
	
		
	Иначе	
		Если ДанныеСтроки.КоличествоПоставщика = 0  И ДанныеСтроки.КоличествоВведено >0 Тогда
			Сообщить("Укажите количество поставщика");
			Возврат;
		КонецЕсли;
		
		Если ДанныеСтроки.ЭтоТара = 0 Тогда
			
			
			Если ДанныеСтроки.Количество < ДанныеСтроки.КоличествоВведено Тогда
				Весовой = (НРег(Лев(ДанныеСтроки.НаименованиеЕдиницы,2)) = "кг");
				Если Весовой Тогда
					чКол = ДанныеСтроки.Количество*1.3;
					Если чКол <  ДанныеСтроки.КоличествоВведено Тогда
						Сообщить("Весовой товар! макс. "+Формат(чКол,"ЧЦ=15; ЧДЦ=3"));
						Возврат;
					КонецЕсли;
				Иначе
					Сообщить("Нельзя принимать больше чем заказано!");
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеСтроки.КоличествоПоставщика < ДанныеСтроки.КоличествоВведено Тогда
			Сообщить("Нельзя принимать больше чем в накладной поставщика!");
			Возврат;
		КонецЕсли;
		
		
		Если ДанныеСтроки.КоличествоПоставщика <> ДанныеСтроки.КоличествоВведено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДанныеПоТоваруГруппа", "Видимость",Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПричиныРасхожденияГруппа", "Видимость",Истина);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	
	ОбработатьСтрокуПриемаТовара();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,СтрокаПоискаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока", "Видимость",Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтмена(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,СтрокаПоискаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока", "Видимость",Ложь);
	
КонецПроцедуры

// Задание ТБД ---(
&НаКлиенте
Функция КоличествоЦенниквДляПечати()

	
	ТаблицаТоварыДляПечати.Очистить();
	
	Для Каждого стТовары Из Объект.Товары Цикл 
		Если (стТовары.СканированиеТовар > 0 И стТовары.ЦенаПроверена = 0) ИЛИ (стТовары.СканированиеЦенник > 0 И стТовары.ЦенаПроверена = 0) Тогда
			нстрТовары = ТаблицаТоварыДляПечати.Добавить();
			ЗаполнитьЗначенияСвойств(нстрТовары,стТовары,"Артикул,МРЦ,СпецЦена");  
			Если ПустаяСтрока(нстрТовары.СпецЦена) Тогда
				нстрТовары.СпецЦена = "Розница";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаТоварыДляПечати.Количество();
	
КонецФункции

&НаКлиенте
Процедура ДекорацияПечатьЦенниковНажатие(Элемент)
	
	ВариантыПечати = ПечатьЦенникиКлиент.ПолучитьВариантыЦенников(ЭтаФорма);
	Если ВариантыПечати.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Немає цінників для друку");
		Возврат;
	КонецЕсли;
	
	ОповещениеПечати = Новый ОписаниеОповещения("ВыборВариантаПечатии",ЭтотОбъект,Новый Структура);
	
	ПоказатьВыборИзМеню(ОповещениеПечати,ВариантыПечати);

КонецПроцедуры

&НаКлиенте
Процедура ВыборВариантаПечатии(ВариантыПечати,ПараметрыПечати) Экспорт
	
	
	Если ВариантыПечати = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = ПечатьНаСервере(ВариантыПечати.Значение);
	Если Ответ.Результат = Ложь Тогда
		Сообщить(Ответ.ОписаниеОшибки);
	Иначе
		Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда	
			ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(Ответ.Ответ);
		Иначе
			Сообщить("Отправлено на печать");
		КонецЕсли;
		
	КонецЕсли;
		

КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере(ТипЦены)
	
	
	МассивТоваров = Новый Массив;
	нТовары = Новый Массив;

	Для Каждого СтрТовары Из ТаблицаТоварыДляПечати Цикл 
		Если СтрТовары.СпецЦена = ТипЦены  Тогда
			МассивТоваров.Добавить(Новый Структура("Артикул,МРЦ",СтрТовары.Артикул,""));
			нТовары.Добавить(СтрТовары);
		КонецЕсли;
	КонецЦикла;                       
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("Товары",МассивТоваров);
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер() Тогда
	
		СтруктураДокумента.Вставить("ТипДокумента","ПечатьЦенниковТСД");
		Ответ =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(СтруктураДокумента);

	Иначе
		
		СтруктураДокумента.Вставить("ТипДокумента","ПечатьЦенников");
		Ответ =  ИнтеграцияТК_ВызовСервера.ПередатьТоварыДляЦенников(СтруктураДокумента);
	КонецЕсли;
	
	Если Ответ.Результат Тогда
		Для Каждого СтрТовары Из нТовары Цикл 
			ТаблицаТоварыДляПечати.Удалить(СтрТовары);
		КонецЦикла;
		счЦен = ТаблицаТоварыДляПечати.Количество();
		Если счЦен = 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПечатьЦенников", "Видимость",Ложь);
		Иначе
			Элементы.ДекорацияПечатьЦенников.Заголовок = "Друк цінників ("+Формат(счЦен,"ЧЦ=10; ЧН=0")+")";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции



// )---Задание ТБД


&НаКлиенте
Процедура ПричинаРасхожденияОК(Команда)
	
	Если Не ЗначениеЗаполнено(ПричиныРасхождения) Тогда
		Сообщить("Укажите причину");
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки =  ТаблицаСтрока[0];
	ДанныеСтроки.ПричинаРасхождения = ПричиныРасхождения;
	
		
	ОбработатьСтрокуПриемаТовара();
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,СтрокаПоискаТовары,ПричиныРасхожденияГруппа,ГруппаПодвалКнопки", "Видимость",Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСтрока", "Видимость",Ложь);


	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаРасхожденияОтмена(Команда)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДанныеПоТоваруГруппа", "Видимость",Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПричиныРасхожденияГруппа", "Видимость",Ложь);
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСканирование", "Видимость",Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодвалОК(Команда)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ГруппаПодвалКнопки,СтрокаПоискаТовары", "Видимость",Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалСохранить", "Видимость",Истина);

	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСканирование", "Видимость",Ложь);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") Тогда
	   	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
		
		ЕстьРасхождение  = Объект.Товары.Итог("КоличествоРасхождение");
		Если ЕстьРасхождение>0 Тогда
			УстановитьОформление(Истина,10);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары", "Видимость",Истина);
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,СтраницаСканирование,ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);
		Если  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
			ценПечать = КоличествоЦенниквДляПечати();
			Если ценПечать > 0 Тогда
				Элементы.ДекорацияПечатьЦенников.Заголовок = "Друк цінників ("+Формат(ценПечать,"ЧЦ=10; ЧН=0")+")";
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПечатьЦенников", "Видимость",Истина);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПечатьЦенников", "Видимость",Ложь);
			КонецЕсли;
			
		КонецЕсли;
	//ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);

	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП")
	ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,СтраницаСканирование,ГруппаПодвалДанныеПоставщика,НеПосчитаные", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);

		
		Если  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда	
			МассивПроверки = Объект.Товары.НайтиСтроки(Новый Структура("СканированиеТовар",0));
			Если МассивПроверки.Количество() > 0 Тогда
				УстановитьОформление(Истина,0);
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ДекорацияНадписьПроверка", "Видимость",Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияНадписьПроверка", "Заголовок", Формат(МассивПроверки.Количество(),"ЧЦ=5; ЧГ=") +" товарів, будуть списані");
				
			КонецЕсли;
			
			ценПечать = КоличествоЦенниквДляПечати();
			Если ценПечать > 0 Тогда
				Элементы.ДекорацияПечатьЦенников.Заголовок = "Печать ценников ("+Формат(ценПечать,"ЧЦ=10; ЧН=0")+")";
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПечатьЦенников", "Видимость",Истина);
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияПечатьЦенников", "Видимость",Ложь);
			КонецЕсли;
			
		КонецЕсли;

	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист")Тогда
		ЕстьРасхождение  = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Ложь));
		Если ЕстьРасхождение.Количество()>0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ДекорацияНадписьПроверка", "Видимость",Истина);
			Элементы.ДекорацияНадписьПроверка.Заголовок = Формат(ЕстьРасхождение.Количество(),"ЧЦ=10")+" документи не відскановано";	
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияНадписьПроверка", "Видимость",Ложь);	
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары,ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка")Тогда   
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалДанныеПоставщика,ФотоЗаявки,УслугаЗаявки,ОписаниеЗаявки", "Видимость",Ложь);
		УсловиеВозврата = 1;
		опДекПроверка = "";
		Если ПустаяСтрока(НаименованиеТовара) Тогда 
			УсловиеВозврата = 0;				
			опДекПроверка = "Опишіть заявку";
		КонецЕсли;	
		Если ПустаяСтрока(КонтрагентUUID) Тогда 	
			УсловиеВозврата = 0;
			Если ПустаяСтрока(опДекПроверка) Тогда
				опДекПроверка ="Виберіть послугу";
			Иначе
				опДекПроверка = опДекПроверка + Символы.ПС + "Виберіть послугу";
			КонецЕсли; 
			
		КонецЕсли;
		Если УсловиеВозврата = 0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияНадписьПроверка", "Заголовок",опДекПроверка);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияНадписьПроверка", "Видимость",Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияНадписьПроверка", "Видимость",Ложь);
			
		КонецЕсли;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица")Тогда   
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалДанныеПоставщика", "Видимость",Ложь);

		
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалСохранитьРеквизитыДокумента", "Видимость",СкладВидимость);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодвалОтмена(Команда)
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура ПодвалСохранитьОК(Команда)

	
 	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Комплектация") Тогда
		ТекстВопроса = "Подтв.: "+ Символы.ПС+Формат(Объект.Товары.Итог("КоличествоВведено"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг"+Символы.ПС+"Закрыть окно с сохранением реализации?";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Задание") Тогда
		КолВведено = Объект.Товары.Итог("КоличествоВведено");  
		Если КолВведено = 0 Тогда
			Сообщить("Таблица товаров пустая!");
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = "Подтв.: "+ Символы.ПС+Формат(КолВведено,"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг"+Символы.ПС+"Закрыть окно с сохранением?";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Zak") Тогда	
		ТекстВопроса = "Подтв.: "+ Символы.ПС+Формат(Объект.Товары.Итог("Количество"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг"+Символы.ПС+"Отправить заказ поставщику?";
    ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		ТекстВопроса = "Подтв.: "+ Символы.ПС+Формат(Объект.Товары.Итог("КоличествоВведено"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг"+" из "+Формат(Объект.Товары.Итог("КоличествоПоставщика"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг "+Символы.ПС+"Закрыть окно с сохранением реализации?";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД")  ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
		тСтрок = Объект.Товары.Количество();
		тСтрокПересчет = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Истина)).Количество();
		тСтрокБезТовара = Объект.Товары.НайтиСтроки(Новый Структура("СканированиеТовар",0)).Количество();
		стрЗав = ?(тСтрокБезТовара>0,"Сформивать инвентаризацию и завершить задание?" ,"Завершить задание?");
		
		ТекстВопроса = "Всего строк: "+Формат(тСтрок,"ЧЦ=15; ЧДЦ=0; ЧН=0")
		+Символы.ПС+ "Отсканировано: "+Формат(тСтрокПересчет,"ЧЦ=15; ЧДЦ=0; ЧН=0")
		+Символы.ПС+стрЗав;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		тСтрок = Объект.Товары.Количество();
		тСтрокПересчет = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Истина)).Количество();
		тСтрокИнвентаризация = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Ложь)).Количество();
		стрЗав = ?(тСтрокИнвентаризация>0,"Не все товары отсканированы, завершить задание?" ,"Завершить задание?");

		ТекстВопроса = "Всего строк: "+Формат(тСтрок,"ЧЦ=15; ЧДЦ=0; ЧН=0")
		+Символы.ПС+ "Отсканировано: "+Формат(тСтрокПересчет,"ЧЦ=15; ЧДЦ=0; ЧН=0")
		+Символы.ПС+стрЗав;
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уведомление") 
		ИЛИ  ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВыдачаДС") Тогда

		ТекстВопроса  = "Виконати завдання?";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		тСтрок = Объект.Товары.Количество();
		тСтрокПересчет = Объект.Товары.НайтиСтроки(Новый Структура("Пересчет",Истина)).Количество();
		ТекстВопроса = "Документів: "+Формат(тСтрок,"ЧЦ=15; ЧДЦ=0; ЧН=0")
		+Символы.ПС+ "Відскановано: "+Формат(тСтрокПересчет,"ЧЦ=15; ЧДЦ=0; ЧН=0")
		+Символы.ПС+"Зберегти документи?";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка") Тогда
		Если УсловиеВозврата = 0 Тогда
			Сообщить("Вкажіть параметри заявки");  
			Возврат;
		КонецЕсли;
		ТекстВопроса = "Послуга: "+Контрагент+Символы.ПС+"Опис: "+НаименованиеТовара +Символы.ПС+"Створити зявку?";
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
	  	ТекстВопроса = "Сформувати документ?"+Символы.ПС+ "Списати : "+Формат(Объект.Товары.Итог("Количество"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг";

	Иначе
		ТекстВопроса = "Всего арт.: "+Формат(Объект.Товары.Количество(),"ЧЦ=15; ЧН=0; ЧГ=")+" принято арт.: " +Формат(ПринятоСтрок(),"ЧЦ=15; ЧН=0; ЧГ=")+Символы.ПС;
		Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПриемПоПриходу") Тогда
			ТекстВопроса = ТекстВопроса + "Принято: "+ Символы.ПС+Формат(Объект.Товары.Итог("КоличествоВведено"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" из "+Формат(Объект.Товары.Итог("КоличествоПоставщика"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг "+Символы.ПС+"Закрыть окно с сохранением прихода?";
		Иначе
			ТекстВопроса = ТекстВопроса + "Принято: "+ Символы.ПС+Формат(Объект.Товары.Итог("КоличествоВведено"),"ЧЦ=15; ЧДЦ=3; ЧН=0")+" шт/кг"+Символы.ПС+"Закрыть окно с сохранением прихода?";
		КонецЕсли;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Функция ПринятоСтрок()
	кСтрок = 0;
	Для Каждого Стр Из Объект.Товары Цикл 
		Если Стр.КоличествоВведено<>0 Тогда
			кСтрок = кСтрок + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат кСтрок;
	
КонецФункции


&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат,Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	Если ТочкаМаршрута = 4 Тогда    
		
		Параметрыф = Новый Структура;
		ОповещениеПечатьКоробкиТочкаМаршрута4 = Новый ОписаниеОповещения("ОповещениеПринтерОтсканированТочкаМаршрута4", ЭтотОбъект,Результат);
		ОткрытьФорму("ОбщаяФорма.ПечатьКоробки",Параметрыф,ЭтотОбъект,,,,ОповещениеПечатьКоробкиТочкаМаршрута4);

	Иначе
		ВыгрузитьДокументНаКлиенте(); 
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ПодвалСохранитьОтмена(Команда)
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Уведомление") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ВыдачаДС") Тогда
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,ГруппаПодвалКнопки,СтрокаПоискаТовары", "Видимость",Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаПодвалСохранить", "Видимость",Ложь);
	Если ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер")
		ИЛИ ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТБД") 
		ИЛИ ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеВФ") Тогда
		УстановитьОформление(Ложь,10);
	ИначеЕсли  ТипДокумента=ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеТНП") Тогда
		УстановитьОформление(Ложь,0);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСканирование,НеПосчитаные", "Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ДекорацияНадписьПроверка", "Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПролистывания", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.МаршрутныйЛист") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары", "Видимость",Ложь);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Заявка") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаСервисДеск,ФотоЗаявки,ОписаниеЗаявки,УслугаЗаявки", "Видимость",Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаТовары,СтрокаПоискаТовары", "Видимость",Ложь);
	ИначеЕсли ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Пересортица") Тогда
	   ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтрокаПоискаТовары", "Видимость",Ложь);
	КонецЕсли;
	
	
КонецПроцедуры




#Область ПеремещениеТоваров


&НаСервере
Процедура ЗаполнитьДокументПеремещение(Отказ)
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	ГУИДПеремещения = Неопределено;
	Если Не Параметры.Свойство("ОснованиеUUID", ГУИДПеремещения) Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("ВидДокумента", "ПеремещениеТоваров");
	ПараметрыДокумента.Вставить("ДокументUUID", ГУИДПеремещения);
	
	ДанныеДокумента = ИнтеграцияТК_ВызовСервера.ПолучитьДанныеДокумента(ПараметрыДокумента);
	
	//Vov41k 27.12.2019 Begin...
	Если ДанныеДокумента.Результат Тогда
		
			ОснованиеUUID 			= ГУИДПеремещения;
			Документ = ДанныеДокумента.Ответ;
			
			Если Документ.Свойство("ОснованиеUUID") Тогда
				ОснованиеUUID =  Документ.ОснованиеUUID;
			КонецЕсли;
			
			Склад 					= Документ.Sklad;
			СкладUUID 				= Документ.SkladUUID;
			СкладОтправитель 		= Документ.SkladSender;
			СкладОтправительUUID 	= Документ.SkladSenderUUID;
			
			СписокХозОпераций = Элементы.ХозОперация.СписокВыбора;
			
			
			Если СписокХозОпераций.НайтиПоЗначению("ПеремещениеТоваровИзФилиала") = Неопределено Тогда 
				СписокХозОпераций.Добавить("ПеремещениеТоваровИзФилиала", "Перемещение товаров из филиала");
			КонецЕсли;		
			
			ХозОперация				= "ПеремещениеТоваровИзФилиала";		
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ХозОперация, СкладОтправитель", "ТолькоПросмотр", Истина);
			
			Если Документ.Свойство("DocUUID") Тогда 
				ДокументUUID 		= Документ.DocUUID;
			КонецЕсли; 
			ЭтоРЦ = 0;
			Если Документ.Свойство("tpRC") Тогда 
				ЭтоРЦ = Документ.tpRC;	
			КонецЕсли;
			Если Документ.Свойство("UP") Тогда 
				ФормироватьТУ = Документ.UP;
			КонецЕсли;
			
			Для Каждого СтрТовары Из Документ.Tovary Цикл 
				нСтрокаТовары = Объект.Товары.Добавить();
				нСтрокаТовары.Артикул 			  = СтрТовары.Art;
				нСтрокаТовары.НаименованиеТовара  = СтрТовары.Tovar;
				нСтрокаТовары.НаименованиеЕдиницы = СтрТовары.EdIzm;
				нСтрокаТовары.Коэффициент		  = СтрТовары.Kof;
				нСтрокаТовары.Количество 		  = 0;
				нСтрокаТовары.КоличествоПоставщика = СтрТовары.KolvoOsn;
				
				Если СтрТовары.Свойство("МРЦ") Тогда
					Если ЗначениеЗаполнено(СтрТовары.МРЦ) Тогда
						нСтрокаТовары.ИспМРЦ = Истина;
					КонецЕсли;
					нСтрокаТовары.МРЦ = СтрТовары.МРЦ;
				КонецЕсли;
				Если СтрТовары.Свойство("Весовой") Тогда
					нСтрокаТовары.Весовой = СтрТовары.Весовой;
				КонецЕсли;
				//Если СтрТовары.Свойство("sht") И ЭтоРЦ = 1 Тогда  
				//	нСтрокаТовары.ПриемДо = ТекущаяДата()+(СтрТовары.sht/3*2)*86400;
				Если СтрТовары.Свойство("sht") Тогда
					Если СтрТовары.Свойство("sht2")	И СтрТовары.sht2 <> 0 Тогда  
						нСтрокаТовары.ПриемДо = ТекущаяДата()+(СтрТовары.sht/100)*СтрТовары.sht2*86400-864000;
					Иначе
						нСтрокаТовары.ПриемДо = ТекущаяДата()+(СтрТовары.sht/3*2)*86400-864000;
					КонецЕсли
				КонецЕсли;

				
				ОбновитьЗаписьПоСтроке(,нСтрокаТовары);
			КонецЦикла; 
			Если ЗначениеЗаполнено(ДокументUUID) Тогда
				ОбработатьДанныеВРаботе();   
			КонецЕсли;
			КэшТоваровПеремещения = Объект.Товары.Выгрузить();		
			Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;
	Иначе
		Отказ = Истина;
		Сообщить("Ошибка получение данных с сервера" + Символы.ПС+ДанныеДокумента.ОписаниеОшибки);
	КонецЕсли;
	//Vov41k 27.12.2019 End...

КонецПроцедуры


&НаСервере
Функция ВыгрузитьДокументПеремещениеНаСервере(ТаблицаАкт,ФормироватьТУ)
	
	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("UUID_Склад",СкладUUID);
	СтруктураДокумента.Вставить("UUID_СкладОтправитель", СкладОтправительUUID);
	СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
	СтруктураДокумента.Вставить("UUID_Причина", ПричинаПеремещенияUUID);

	СтруктураДокумента.Вставить("ДоументСервер",Ложь);
	СтруктураДокумента.Вставить("ХозОперация", ХозОперация);
	СтруктураДокумента.Вставить("ПечатьТСД",?(ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер(),1,0));

	Если ТаблицаАкт <> Неопределено Тогда
		тзПричины = ТаблицаАкт.Выгрузить();
		тзПричины.Свернуть("Артикул,Причина");
		МассивПричины = Новый Массив;
		Для Каждого стПричина Из ТаблицаАкт Цикл 
			  МассивПричины.Добавить(Новый Структура("Артикул,КодПричины",стПричина.Артикул,стПричина.Причина.Код));
		КонецЦикла;
		СтруктураДокумента.Вставить("ПричиныВозврата",МассивПричины); 
		
		Если ФормироватьТУ Тогда     
		СтруктураДокумента.Вставить("ФормироватьТУ",Число(ФормироватьТУ));	
		СтруктураДокумента.Вставить("UUID_Принтер",ИД_Принтер);
		СтруктураДокумента.Вставить("КоличествоСтикеров",КоличествоСтикеров);
		КонецЕсли;
		

	КонецЕсли;
	
	
	
	ЕстьРасхождения = Неопределено;
	Если Не ПустаяСтрока(ДокументUUID) Тогда
		СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID);
	КонецЕсли;
	Если Не ПустаяСтрока(ОснованиеUUID) Тогда 
		СтруктураДокумента.Вставить("UUID_Основание", ОснованиеUUID);	
	КонецЕсли;
	
	МассивТоваров = Новый Массив;	
		
	ПеремСтуктура = "Артикул, Количество,КоличествоПоставщика, Коэффициент,МРЦ";
	
	Для Каждого СтрТовар Из Объект.Товары Цикл 
		Если СтрТовар.Количество = 0 И СтрТовар.КоличествоПоставщика = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		СтруктураСтрока = Новый Структура(ПеремСтуктура);
		ЗаполнитьЗначенияСвойств(СтруктураСтрока,СтрТовар,ПеремСтуктура);
		СтруктураСтрока.Коэффициент = 1;
		МассивТоваров.Добавить(СтруктураСтрока);
		
	КонецЦикла;                                                  
	
	Если МассивТоваров.Количество() = 0 Тогда
		ВызватьИсключение ("Немає товарів для переміщення")
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Товары",МассивТоваров);

	Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
		
	Возврат Рез;

КонецФункции


&НаКлиенте
Процедура ХозОперацияПриИзменении(Элемент)
	
	Если ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ПеремещениеТоваров") И ХозОперация = "ПеремещениеТоваровВФилиал" Тогда 
		Элементы.Склад.Заголовок = НСтр("ru = 'Торговая площадка'");
	Иначе
		Элементы.Склад.Заголовок = "";
	КонецЕсли;
	
	Склад = "";
	СкладUUID = "";
	ПричинаПеремещения ="";
	ПричинаПеремещенияUUID="";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПричинаПеремещения", "Видимость", Ложь);

	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура Фото(Команда)

	файл = ОбщегоНазначенияКлиент.СделатьФото();
	
	Если файл <> Неопределено Тогда
		//ТекущееФото = ДанныеФото.ПолучитьДвоичныеДанные();
		ФотоХаранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(файл),Новый УникальныйИдентификатор);
		кФото =  ФотоДокумента.Количество()+1;
		нСтр = ФотоДокумента.Добавить();
		нСтр.ФотоИмя =  "Фото "+кФото;
		нСтр.ФотоСсылка = ФотоХаранилище;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПереоценкиВкл(Команда)
	
	Для Каждого Стр Из ТоварыПереоценки Цикл 
		Стр.Вкл = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПереоценкиВыкл(Команда)
	
	Для Каждого Стр Из ТоварыПереоценки Цикл 
		Стр.Вкл = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников(Команда)
	
	Если ТоварыПереоценки.НайтиСтроки(Новый Структура("Вкл",Истина)).Количество() = 0 Тогда
		
		Сообщить("Не выбран товар для печати!");
		Возврат;
	КонецЕсли;
	
	
	ТекстВопроса = "Выполнить печать?";
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПечать", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПечать(Результат,Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляПечати = ПечатьПереоценки();
	Если ДанныеДляПечати.Результат Тогда
		Если ТипЗнч(ДанныеДляПечати.Ответ) = Тип("Строка") Тогда
			Сообщить(ДанныеДляПечати.Ответ);
		ИначеЕсли ТипЗнч(ДанныеДляПечати.Ответ) = Тип("ДвоичныеДанные") Тогда
			
			ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(ДанныеДляПечати.Ответ);
		КонецЕсли;
		Если НЕ ПустаяСтрока(ДанныеДляПечати.ОписаниеОшибки) Тогда
			Сообщить(ДанныеДляПечати.ОписаниеОшибки);
		КонецЕсли;
		
		ВыполняетсяЗакрытие = Истина;
		
		Закрыть(Новый Структура("ОбработатьСтрокиПоПереоценки,ДанныеПоПечати",Истина,ДанныеДляПечати.ДанныеПоПечати));
		
	Иначе
		Сообщить(ДанныеДляПечати.ОписаниеОшибки);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЗакрытиеПечати(Результат,Параметры) Экспорт 
	Если Результат = "ОК" Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть(Новый Структура("ОбработатьСтрокиПоПереоценки,ДанныеПоПечати",Истина,Параметры.ДанныеПоПечати));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	Если ТипДокумента	= ПредопределенноеЗначение("Справочник.ТипыДокументов.Инвентаризация") 
		ИЛИ   ТипДокумента	= ПредопределенноеЗначение("Справочник.ТипыДокументов.ЛокальнаяИнвентаризация")
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.ЗаданиеИН") 
		ИЛИ ТипДокумента = ПредопределенноеЗначение("Справочник.ТипыДокументов.Контролер") Тогда
		Отказ = Истина;
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриход(Команда)


	сДаныеСотрудника =  Элементы.ТаблицаСотрудник.ТекущиеДанные;
	Если сДаныеСотрудника = Неопределено Тогда
		Сообщить("Сотрудник не выбран");
		Возврат;
	КонецЕсли;
	
	
	
	ДаныеСотрудника = Новый Структура("ДолжностьUUID,СотрудникUUID", сДаныеСотрудника.ДолжностьUUID ,сДаныеСотрудника.СотрудникUUID);
	Рез = ЗафиксироватьПриходНаСервере(ДаныеСотрудника,ТекущаяДата(),1);
	
	Если Рез.Результат Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		Сообщить("Не удалось записать время прихода!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникУход(Команда)
	сДаныеСотрудника =  Элементы.ТаблицаСотрудник.ТекущиеДанные;

	Если сДаныеСотрудника = Неопределено Тогда
		Сообщить("Сотрудник не выбран");
		Возврат;
	КонецЕсли;

	
	ДаныеСотрудника = Новый Структура("ДолжностьUUID,СотрудникUUID", сДаныеСотрудника.ДолжностьUUID ,сДаныеСотрудника.СотрудникUUID);
	Рез = ЗафиксироватьПриходНаСервере(ДаныеСотрудника,ТекущаяДата(),2);
	
	Если Рез.Результат Тогда
		ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		Сообщить("Не удалось записать время ухода!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗафиксироватьПриходНаСервере(ДаныеСотрудника,Дата,ТипЗаписи)
	

	СтруктураДокумента = Новый Структура();
	СтруктураДокумента.Вставить("ДолжностьUUID",ДаныеСотрудника.ДолжностьUUID);
	СтруктураДокумента.Вставить("СотрудникUUID",ДаныеСотрудника.СотрудникUUID);
	СтруктураДокумента.Вставить("ДоументСервер",Ложь);
	СтруктураДокумента.Вставить("Дата",Дата);
	СтруктураДокумента.Вставить("ТипЗаписи",ТипЗаписи);
	Рез = ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
	
	Возврат Рез;
	
	
КонецФункции

&НаКлиенте
Процедура Начисления(Команда)
	ОчиститьСообщения();
	сДаныеСотрудника =  Элементы.ТаблицаСотрудник.ТекущиеДанные;
	Если сДаныеСотрудника = Неопределено Тогда
		Сообщить("Співробітника не обрано");
		Возврат;
	КонецЕсли;

	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьОтчетНачисления",Новый Структура("СотрудникUUID",сДаныеСотрудника.СотрудникUUID));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура Выплата(Команда)
	
	ОчиститьСообщения();
	сДаныеСотрудника =  Элементы.ТаблицаСотрудник.ТекущиеДанные;
	Если сДаныеСотрудника = Неопределено Тогда
		Сообщить("Сотрудник не выбран");
		Возврат;
	КонецЕсли;
	
	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьОтчетВыплата",Новый Структура("СотрудникUUID",сДаныеСотрудника.СотрудникUUID));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ТоварыИнвентаризацияНаСервере(Знач ТоварыДок)
	
	ТоварыДок.Сортировать("НаименованиеТовара");
	мТовары = Новый Массив;
	Для Каждого стТовары из ТоварыДок Цикл 
		Если НЕ стТовары.Остаток = стТовары.КоличествоВведено + стТовары.Продажи Тогда
			
			СтруктураТовары=Новый Структура("ТоварыЗаписьПоСтроке,ТоварыЗаписьПоСтроке2",стТовары.ТоварыЗаписьПоСтроке,стТовары.ТоварыЗаписьПоСтроке2);
			мТовары.Добавить(СтруктураТовары);
		КонецЕсли;
	КонецЦикла;
	
	
	Возврат мТовары;
КонецФункции

&НаКлиенте
Процедура Печать1(Команда)
	
	
	мТовары = ТоварыИнвентаризацияНаСервере(Объект.Товары);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьОтчетИнвентаризацияРасхождение",Новый Структура("Товары,Документ",мТовары,НаименованиеДокумента));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАнкетированиеНажатие(Элемент)
	ОчиститьСообщения();
	сДаныеСотрудника =  Элементы.ТаблицаСотрудник.ТекущиеДанные;
	Если сДаныеСотрудника = Неопределено Тогда
		Сообщить("Сотрудник не выбран");
		Возврат;
	КонецЕсли;
	
	
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьОтчетАнкетирование",Новый Структура("СотрудникUUID",сДаныеСотрудника.СотрудникUUID));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПечати",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура СообщениеВведитеНомерТТНажатие(Элемент)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДокументыТочки", "ДокументыТочки");

	
	ЗаголовокСканирования = "Торговий майданчик";
	вЧисло = 0;//"";
	ОписаниеОповещения = Новый ОписаниеОповещения("опВводНомерТочки", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЧисла(ОписаниеОповещения, вЧисло, ЗаголовокСканирования);
КонецПроцедуры

 &НаКлиенте
 Процедура опВводНомерТочки(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Попытка 
			Рез = Число(Результат);
		Исключение
			Сообщить("Номер точки некоректний! "+ Строка(Результат));
		КонецПопытки;
		
		
		ОбработатьПолученныйШтрихкод(Рез, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаЗаявкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура();	
	ОповещениеУслуга = Новый ОписаниеОповещения("ОповещениеВыбранаУслуга", ЭтотОбъект,ДопПараметры);

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораУслуги",Новый Структура("АдресУслуги",ПоместитьУслугиВремХран()),ЭтаФорма,,,,ОповещениеУслуга,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры
&НаСервере
Функция ПоместитьУслугиВремХран()

  	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Услуга"), УникальныйИдентификатор);
  	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеВыбранаУслуга(Рез,Парам)Экспорт
	
	Если Рез = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Контрагент = Рез.Наименование; 
	КонтрагентUUID = Рез.Код;	 
	
КонецПроцедуры


&НаКлиенте
Процедура РекламацияОК(Команда)
	ЗаписатьРекламациюКлиент(Истина);
КонецПроцедуры


&НаКлиенте
Процедура РекламацияНеОК(Команда)
	ЗаписатьРекламациюКлиент(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьРекламациюКлиент(Статус)    
	ТекстВопроса = ?(Статус,"Подтвердить рекламацию?","Отказать рекламацию?");
	СтруктураСтатуса = Новый Структура("Статус",Статус);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаРекламация", ЭтотОбъект,СтруктураСтатуса);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры                                


  
&НаКлиенте
Процедура ПослеЗакрытияВопросаРекламация(Результат,Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат; 
	КонецЕсли;
	
	Рез = ЗаписатьРекламацию(Параметры.Статус);
	Если Рез.Результат Тогда  
		Сообщить("Документ вивантажено успішно");
		ВыполняетсяЗакрытие = Истина;
		Если ДокументСервер Тогда
			Закрыть(Новый Структура("УдалитьСтроку"));
		Иначе
			Закрыть();
		КонецЕсли;
		
	Иначе
		Если ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
			Сообщить("Помилка вивантаження документу!");
		Иначе
			Сообщить(Рез.ОписаниеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры



&НаСервере
Функция ЗаписатьРекламацию(Статус)
	
	
	
	СтруктураДокумента = Новый Структура();                     
	СтруктураДокумента.Вставить("UUID_Документ",ДокументUUID);
	СтруктураДокумента.Вставить("UUID_Сотрудник", ПараметрыСеанса.Сотрудник_ID);
	СтруктураДокумента.Вставить("Статус",Статус);
	Возврат ИнтеграцияТК_ВызовСервера.ПередатьДокументНаСервер(СтруктураДокумента,ТипДокумента);
			
КонецФункции


&НаКлиенте
Процедура АнкетаОК(Команда)
	
   рез = ЗавершитьПросмотрАнкеты(ДокументUUID);
   Если Рез.Результат Тогда 
	  	Оповестить("ОбновитьЗадания");
	    ВыполняетсяЗакрытие = Истина;
		Закрыть();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(?(Не ПустаяСтрока(Рез.ОписаниеОшибки),Рез.ОписаниеОшибки,"Помилка"))
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ЗавершитьПросмотрАнкеты(ИД_Задача)
  	
	СтруктураОтвет = РозницаТК.ЗавершитьЗаданиеПросмотрАнкеты(ИД_Задача);   
	Возврат СтруктураОтвет;

КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПечатиВыдачиДС(ДокументUUID)
    Возврат РозницаТК.ПолучитьДанныеПечатиВыдачиДС(ДокументUUID);
КонецФункции

&НаКлиенте
Процедура ПечатьВыдачаДС(Команда)  
	Рез =  ДанныеПечатиВыдачиДС(ДокументUUID);	
	Если Не Рез.Результат Тогда 
		Если не ПустаяСтрока(Рез.ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю( Рез.ОписаниеОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Рез.Ответ.Свойство("print") Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Да", "Так");
		Кнопки.Добавить("Нет", "Ні");
		ПараметрыНапоминания = Новый Структура;
		ПараметрыНапоминания.Вставить("Заголовок", "Увага");
		ПараметрыНапоминания.Вставить("ПредлагатьБольшеНеЗадаватьЭтотВопрос", Ложь);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ПоказатьВопросПечатьЗавершение",ЭтотОбъект,Рез.Ответ.print), "Друкувати документ?", Кнопки, ПараметрыНапоминания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПечатьЗавершение(РезультатВопроса,ДопоплнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Если РезультатВопроса.Значение = "Да" Тогда
		ПечатьЛокальныйПринтер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяПечатьНаПринтер();
		Если НЕ ПечатьЛокальныйПринтер Тогда
			 ДопоплнительныеПараметры.Вставить("Printss");
		 КонецЕсли;
		 
		РезПечать =  ИнтеграцияТК_ВызовСервера.ЗапросПечатнаяФорма(ДопоплнительныеПараметры);
		
		Если РезПечать.Результат Тогда
			Если ПечатьЛокальныйПринтер Тогда
				ОбщегоНазначенияКлиент.ВывестиПДФ_НаПечать(РезПечать.Ответ);
			Иначе 
				ОчиститьСообщения();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Відправлено на друк");
			КонецЕсли;
		Иначе
			Сообщить(РезПечать.ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   


