

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("СотрудникЗУП") Тогда
		СканированиеЗУП = Истина;
	КонецЕсли;
	
	
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
	//УстановитьЗаголовокПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АсинхронныйСканерИнициализирован = ПодключаемоеОборудованиеВызовСервера.СканерШтрихкодовИнициализирован();

	Если ИспользуетсяАсинхронныйСканер И АсинхронныйСканерИнициализирован = Ложь Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодключитьАссинхронныйСканерШтрихкодов()
	
	ИнициализироватьАсинхронныйСканер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьАсинхронныйСканер()
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокПодразделение(Результат)
	Если НЕ ПустаяСтрока(Результат.Ответ) Тогда
		Элементы.ТекущийСотрудник.Заголовок = Результат.Ответ;
		Элементы.Страницы.ТекущаяСтраница  = Элементы.СтраницаСотр;
		
	Иначе
		Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
	КонецЕсли;

		
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
		
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		Сотрудник = ПараметрыСеанса.Сотрудник;
		
		Если НЕ ПустаяСтрока(Сотрудник) Тогда
			Элементы.ТекущийСотрудник.Заголовок = Сотрудник;
			Элементы.Страницы.ТекущаяСтраница  = Элементы.СтраницаСотр;
		Иначе
			Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
			
		КонецЕсли;
		
		
		ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
		ОбщегоНазначения.УстановитьЖирныйШрифтПолей(ЭтаФорма, "ТекущийСотрудник,ТекущийСотрудникПусто");
		ОбщегоНазначения.УстановитьЦветПредупреждающихПолей(ЭтаФорма,"ТекущийСотрудникПусто");
		ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма,"ТекущийСотрудник");
		
		
		ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаСканированиеНевозможно", "Видимость",
		НЕ ЕстьОборудованиеСканирования);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
		ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер
		);
	Иначе
		Элементы.ТекущийСотрудник.Заголовок = "Відскануйте ШК комірки";
		
	КонецЕсли;
	
	НастроитьЭлементыАсинхронногоСканера();

	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры



#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сканировать(Команда)
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();

КонецПроцедуры


&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры


#КонецОбласти



#Область ПрограммныйИнтерфейс

&НаСервереБезКонтекста
Функция ВерунутьУИДПодразделения()
	Возврат ПараметрыСеанса.UUID;	
КонецФункции



&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ЭтоРежимПодключениеТК() Тогда
		
		ШтрихКодЗапрос = ?(СканированиеЗУП,ПолученныйШтрихкод+"|zup|"+ВерунутьУИДПодразделения(), ПолученныйШтрихкод);
		Если ПустаяСтрока(ШтрихКодЗапрос) Тогда   
			Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
			Элементы.Описание.Заголовок = "Пустая строка"; 
			Возврат;
		КонецЕсли;	
		Результат	= ИнтеграцияТК_Клиент.ПолучитьСотрудника(ШтрихКодЗапрос);	
		Если Результат.Результат Тогда
			
			
			Если СканированиеЗУП Тогда
				
				тзФормыСотрудник = Параметры.Форма.ВладелецФормы.ТаблицаСотрудник;	
				тзФормыСотрудник.Очистить();
				ДекорацияСтатусСотрудник = "";
				Если Результат.Ответ.Свойство("zup") Тогда
					Для Каждого  тzup Из Результат.Ответ.zup Цикл 
						НоваяСтрока = тзФормыСотрудник.Добавить();
						НоваяСтрока.Сотрудник =  тzup.EmployeeNeme;
						НоваяСтрока.СотрудникUUID =  тzup.EmployeeUUID;
						НоваяСтрока.Должность =  тzup.Position;
						НоваяСтрока.ДолжностьUUID =  тzup.PositionUUID;
						//
						//Если СтрНайти(тzup.info,"Новый вход")>0 Тогда
						//   СтатусСотрудника ="";
						//ИначеЕсли тzup.Status Тогда
						//	СтатусСотрудника = "Приход";
						//Иначе
						//	СтатусСотрудника = "Уход";
						//КонецЕсли;
						
						ДекорацияСтатусСотрудник = НоваяСтрока.Сотрудник;//+ "" +	НоваяСтрока.Должность +" "+СтатусСотрудника +" "+тzup.info+Символы.ПС;
					КонецЦикла;
					
				КонецЕсли;
				Если Результат.Ответ.Свойство("zupPrihod") Тогда
					
					zupPrihod =  Результат.Ответ.zupPrihod;
					Если zupPrihod.Количество()= 1 Тогда
						 Status = zupPrihod[0].Status; 
						 Time   = zupPrihod[0].Time; 
						Если Не Status = Неопределено Тогда
							 ДекорацияСтатусСотрудник = ДекорацияСтатусСотрудник+Символы.ПС +?( Status = Истина,"Приход","Уход");
						КонецЕсли; 
						
						Если Не Time = Неопределено Тогда
							  ДекорацияСтатусСотрудник = ДекорацияСтатусСотрудник +" "+ Time;
						КонецЕсли;
						
					КонецЕсли;
					
					
				КонецЕсли;
				
				
				Если Результат.Ответ.Свойство("КоличествоАнкет") Тогда
					Если Результат.Ответ.КоличествоАнкет > 0 Тогда
						Параметры.Форма.ВладелецФормы.Элементы.ДекорацияАнкетирование.Заголовок = "Информация по проверкам "+Формат(Результат.Ответ.КоличествоАнкет,"ЧЦ=2; ЧДЦ=0; ЧН=0");
						Параметры.Форма.ВладелецФормы.Элементы.ДекорацияАнкетирование.Видимость = Истина;
					КонецЕсли;
				 КонецЕсли;
			КонецЕсли;
			
			Параметры.Форма.ВладелецФормы.Элементы.ДекорацияСтатусСотрудник.Заголовок = ДекорацияСтатусСотрудник;
			Элементы.ТекущийСотрудник.Заголовок = Результат.Ответ.Name;
			Элементы.Страницы.ТекущаяСтраница  = Элементы.СтраницаСотр;
			Оповестить("ИзмененСотрудник");
			ПодключитьОбработчикОжидания("ЗакрытьФорму",1,Истина);
			
		Иначе
			Элементы.Страницы.ТекущаяСтраница  = Элементы.ГруппаПусто;
			Элементы.Описание.Заголовок = Результат.ОписаниеОшибки;
		КонецЕсли;
		
	Иначе
		Закрыть(ПолученныйШтрихкод);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму() Экспорт
	Закрыть();
КонецПроцедуры



&НаКлиенте
Процедура Сканер(Результат, ДополнительныеПараметры) Экспорт

КонецПроцедуры




&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура НадписьНеУстановленСканерНажатие(Элемент)
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПодключаемоеОборудованиеСканерШтрихкодов",,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


#КонецОбласти

