
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	АдресEmail               = Параметры.АдресEmail;
	НомерТелефона            = Параметры.НомерТелефона;
	АдресEmailЧекаПродажи    = Параметры.АдресEmailЧекаПродажи;
	
	Если ЗначениеЗаполнено(Параметры.НомерТелефонаЧекаПродажи) Тогда
		
		ШаблонНомера = "+7 (%1%%2%%3%) %4%%5%%6% - %7%%8% - %9%%10%";
		
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%1%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  1, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%2%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  2, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%3%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  3, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%4%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  4, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%5%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  5, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%6%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  6, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%7%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  7, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%8%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  8, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%9%",  Сред(Параметры.НомерТелефонаЧекаПродажи,  9, 1));
		ШаблонНомера = СтрЗаменить(ШаблонНомера, "%10%", Сред(Параметры.НомерТелефонаЧекаПродажи, 10, 1));
		
		НомерТелефонаЧекаПродажи = ШаблонНомера;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	НастроитьОформлениеПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура НомерТелефонаЧекаПродажиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НомерТелефона = НомерТелефонаЧекаПродажи;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресEmailЧекаПродажиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресEmail = АдресEmailЧекаПродажи;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	
	ЕстьОшибки = Ложь;
	
	НомерТелефонаФормат = СтрЗаменить(НомерТелефона, "+", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, "(", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, ")", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, "-", "");
	НомерТелефонаФормат = СтрЗаменить(НомерТелефонаФормат, " ", "");
	
	Если СтрДлина(НомерТелефонаФормат) = 11 И Лев(НомерТелефонаФормат, 1) = "7" Тогда
		НомерТелефонаФормат = Сред(НомерТелефонаФормат, 2);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерТелефонаФормат) Тогда
		
		Если НЕ ОбщегоНазначенияКлиентСервер.ДанныеНомераТелефонаКорректны(НомерТелефонаФормат) Тогда
			
			Сообщение = НСтр("ru = 'Номер телефона заполнен неверно'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			
			ЕстьОшибки = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресEmail) Тогда
		
		СоответствуетТребованиям = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресEmail, Истина);
		
		Если НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(АдресEmail, Истина) Тогда
			
			Сообщение = НСтр("ru = 'Адрес e-mail заполнен неверно'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			
			ЕстьОшибки = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("АдресEmail", АдресEmail);
	ПараметрыЗакрытия.Вставить("НомерТелефона", НомерТелефонаФормат);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура MailRu(Команда)
	
	ДобавитьКАдресуEMAIL("@mail.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура RamblerRu(Команда)
	
	ДобавитьКАдресуEMAIL("@rambler.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура YahooCom(Команда)
	
	ДобавитьКАдресуEMAIL("@yahoo.com");
	
КонецПроцедуры

&НаКлиенте
Процедура YandexRu(Команда)
	
	ДобавитьКАдресуEMAIL("@yandex.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура YaRu(Команда)
	
	ДобавитьКАдресуEMAIL("@ya.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура GmailCom(Команда)
	
	ДобавитьКАдресуEMAIL("@gmail.com");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьКАдресуEMAIL(ПостфиксАдреса)
	
	// удалить текущий постфикс
	ПозицияСимвола = СтрНайти(АдресEmail, "@");
	
	Если ПозицияСимвола > 0 Тогда
		АдресEmail = Лев(АдресEmail, ПозицияСимвола - 1);
	КонецЕсли;
	
	АдресEmail = АдресEmail + ПостфиксАдреса;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОформлениеПолей()
	
	СписокКнопок = "MailRu, RamblerRu, YaRu, YandexRu, GmailCom, YahooCom";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
	Элементы.НомерТелефонаЧекаПродажи.Видимость = ЗначениеЗаполнено(НомерТелефонаЧекаПродажи);
	Элементы.АдресEmailЧекаПродажи.Видимость = ЗначениеЗаполнено(АдресEmailЧекаПродажи);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

