
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант = Константы.СоздатьНабор(СписокКонстант());
	НаборКонстант.Прочитать();
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НаборКонстант, СписокКонстант());
	
	НастроитьФормуПоЗначениямНастроек();
	
	// АдминистративныйРежим
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		ДрайверУстройстваПечати = ОборудованиеПечати.ДрайверОборудования;
		ТипОборудования = ОборудованиеПечати.ТипОборудования;
	КонецЕсли;
	
	НастроитьВидимостьУстройстваПечати();
	
	ОпределитьПараметрыДрайвера();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ОпределитьВерсиюДрайверов();
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененАдминистративныйРежим" Тогда
		// АдминистративныйРежим
		НастроитьФормуПоАдминистративномуРежиму();
		НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
		ОпределитьДоступностьКоманд();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ТипОборудования) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементИзМассива(ПроверяемыеРеквизиты, "ДрайверУстройстваПечати");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	ОбщегоНазначенияКлиент.ПередЗакрытиемФормыНастроек(ЭтаФорма, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОборудованиеПечати(Команда)
	
	ОчиститьСообщения();
	
	#Если МобильноеПриложениеКлиент Тогда
		
		МенеджерОборудованияКлиент.ОтключитьВсеОборудование();
		
		МенеджерОборудованияКлиент.ВыполнитьНастройкуОборудования(ОборудованиеПечати);
		
	#Иначе
		ТекстОшибки = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ТестоваяПечать(Команда)
	
	ОчиститьСообщения();
	
	Отказ = Ложь;
	СохранитьНаКлиенте(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	
	#Если МобильноеПриложениеКлиент Тогда
		
		СтрокиТекста = НСтр("ru = 'Тестовая печать'");
		
		ОчиститьСообщения();
		ВыходныеПараметры = Неопределено;
		ВходныеПараметры = Новый Структура("СтрокиТекста", СтрокиТекста);
		Если Не МенеджерОборудованияКлиент.ВыполнитьПечатьТекста(УникальныйИдентификатор, ОборудованиеПечати, ВходныеПараметры, ВыходныеПараметры) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВыходныеПараметры.ТекстОшибки);
		КонецЕсли
		
	#Иначе
		ТекстОшибки = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДрайверУстройстваПечати(Команда)
	
	ОчиститьСообщения();
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если НЕ ЗначениеЗаполнено(ДрайверУстройстваПечати) Тогда
			Возврат;
		КонецЕсли;
		
		МенеджерОборудованияКлиент.УстановитьДрайверИзМакета(ДрайверУстройстваПечати);
		ОпределитьВерсиюДрайверов();
		ОпределитьДоступностьКоманд();
		
	#Иначе
		ТекстОшибки = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПечати(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОборудования", ТипОборудования);
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.ПараметрыПечати", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыККТ(Команда)
	
	Отказ = Ложь;
	СохранитьНаКлиенте(Отказ, Ложь);
	
	Если НЕ Отказ Тогда
		КассовыеОперацииКлиент.ПоказатьПараметрыККТ(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТипОборудованияПриИзменении(Элемент)
	
	ТипОборудованияПриИзмененииНаСервере();
	
	ОпределитьВерсиюДрайверов();
	
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ДрайверУстройстваПечатиПриИзменении(Элемент)
	
	ДрайверУстройстваПечатиПриИзмененииНаСервере();
	ОпределитьВерсиюДрайверов();
	ОпределитьДоступностьКоманд();
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагАдминистративныйРежимПриИзменении(Элемент)
	// АдминистративныйРежим
	НастроитьДоступностьЭлементовПоАдминистративномуРежиму();
	
	ПодключитьОбработчикОжидания("НастроитьФормуПоАдминистративномуРежимуКлиент", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАдминистративныйРежимНажатие(Элемент)
	// АдминистративныйРежим
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.АдминистративныйРежим",,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыАдминистративныйРежим

&НаКлиенте
Процедура НастроитьДоступностьЭлементовПоАдминистративномуРежиму()
	
	СписокТолькоПросмотр = "ДрайверУстройстваПечати, ТипОборудования, ЗаводскойНомерККМ";
	
	СписокДоступность = "Готово";
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокТолькоПросмотр, "ТолькоПросмотр", НЕ АдминистративныйРежим);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокДоступность, "Доступность", АдминистративныйРежим);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПоАдминистративномуРежимуКлиент()
	
	НастроитьФормуПоАдминистративномуРежиму(Истина);
	Оповестить("ИзмененАдминистративныйРежим");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму(УстановитьРежим = Ложь)
	
	ОбщегоНазначения.НастроитьФормуПоАдминистративномуРежиму(ЭтаФорма, УстановитьРежим);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьНаКлиенте(Отказ = Ложь, ЗакрытьФорму = Истина) Экспорт
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СохранитьНаСервере(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если ОповеститьОбИзмененииЗначенийНастроек Тогда
			Оповестить("ИзмененыЗначенияНастроек");
		КонецЕсли;
		
		Если ЗакрытьФорму Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТипОборудованияПриИзмененииНаСервере()
	
	НастроитьВидимостьУстройстваПечати();
	
	#Если МобильноеПриложениеСервер Тогда
		
	Если ЗначениеЗаполнено(ТипОборудования)
		И ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ПринтерЧеков") Тогда
		
		ДрайверУстройстваПечати = ПредопределенноеЗначение("Справочник.ДрайверыОборудования.Драйвер1СПринтерЧеков");
		
	//ИначеЕсли ЗначениеЗаполнено(ТипОборудования)
	//	И ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор") Тогда
	//	
	//	ДрайверУстройстваПечати = ПредопределенноеЗначение("Справочник.ДрайверыОборудования.Драйвер1СДрайверFPrint11");
	//	
	//ИначеЕсли ЗначениеЗаполнено(ТипОборудования)
	//	И ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ") Тогда
	//	
	//	
	//	ДрайверУстройстваПечати = ПредопределенноеЗначение("Справочник.ДрайверыОборудования.ДрайверАТОЛККТ54ФЗ");
	//	
	Иначе
		ДрайверУстройстваПечати = ПредопределенноеЗначение("Справочник.ДрайверыОборудования.ПустаяСсылка");
	КонецЕсли;
	
	#Иначе
		
		ДрайверУстройстваПечати = ПредопределенноеЗначение("Справочник.ДрайверыОборудования.ПустаяСсылка");
		
	#КонецЕсли
	
	ДрайверУстройстваПечатиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ)
	
	ОбщегоНазначения.СохранитьКонстантыФормы(ЭтаФорма, СписокКонстант(), Отказ);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ДрайверУстройстваПечатиПриИзмененииНаСервере()
	
	ПодключаемоеОборудование.ОпределитьПодключаемоеОборудование(ДрайверУстройстваПечати, ОборудованиеПечати);
	
	ОпределитьПараметрыДрайвера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВерсиюДрайверов()
	
	ВерсияДрайвераУстройстваПечатиВМакете = "";
	
	ПодключаемоеОборудованиеКлиент.ПолучитьВерсиюДрайвераОборудования(ЭтаФорма,
		ОборудованиеПечати,
		ВерсияДрайвераУстройстваПечати,
		ВерсияДрайвераУстройстваПечатиВМакете,
		ДрайверУстройстваПечатиУстановлен);
	
	Если НЕ ДрайверУстройстваПечатиУстановлен Тогда
		Элементы.ВерсияДрайвераУстройстваПечати.ЦветТекста = WebЦвета.Кирпичный;
	Иначе
		Элементы.ВерсияДрайвераУстройстваПечати.ЦветТекста = Новый Цвет;
	КонецЕсли;
	
	ЗаголовокКнопки = НСтр("ru = 'Установить драйвер'");
	
	Если ЗначениеЗаполнено(ВерсияДрайвераУстройстваПечатиВМакете) Тогда
		ЗаголовокКнопки = ЗаголовокКнопки + " (" + ВерсияДрайвераУстройстваПечатиВМакете + ")";
	КонецЕсли;
	
	Элементы.УстановитьДрайверУстройстваПечати.Заголовок = ЗаголовокКнопки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьДоступностьКоманд()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПараметрыККТ", "Видимость",
		ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККТ")
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "КомандыДрайвера", "Видимость",
										ЗначениеЗаполнено(ДрайверУстройстваПечати)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "НастроитьОборудованиеПечати", "Доступность", 
										АдминистративныйРежим И ЗначениеЗаполнено(ОборудованиеПечати) И ДрайверУстройстваПечатиУстановлен
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УстановитьДрайверУстройстваПечати", "Доступность", 
										АдминистративныйРежим И ЗначениеЗаполнено(ОборудованиеПечати)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ТестоваяПечать", "Доступность",
		ЗначениеЗаполнено(ОборудованиеПечати) И ДрайверУстройстваПечатиУстановлен
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ПараметрыККТ", "Доступность", 
		ЗначениеЗаполнено(ОборудованиеПечати) И ДрайверУстройстваПечатиУстановлен
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УстановитьДрайверУстройстваПечати", "Видимость",
		НЕ (ЗначениеЗаполнено(ОборудованиеПечати) И ЭтоДрайверВнешняяКомпонента)
	);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьУстройстваПечати()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаУстройствоПечати", "Видимость", 
		ЗначениеЗаполнено(ТипОборудования));
	
КонецПроцедуры

&НаСервере
Функция СписокКонстант()
	
	Возврат "ОборудованиеПечати, ЗаводскойНомерККМ";
	
КонецФункции

&НаСервере
Процедура ОпределитьПараметрыДрайвера()
	
	Если ЗначениеЗаполнено(ДрайверУстройстваПечати) Тогда
		
		ЭтоДрайверВнешняяКомпонента = НЕ ДрайверУстройстваПечати.ИнтеграционноеПриложение;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

