
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	Если Параметры.Свойство("ЗапросМРЦ") Тогда
		
		ЗапросМРЦ = Истина;
		АртикулТовара = Параметры.Артикул;
		НаименованиеТовара = Параметры.НаименованиеТовара;
		Элементы.НаименованиеТовара.Видимость = Истина;
	КонецЕсли;
	
	
	
	ФорматРедактирования = "ЧЦ=15; ЧДЦ=2";
	
	Если Параметры.Свойство("ФорматРедактирования") Тогда
		ФорматРедактирования = Параметры.ФорматРедактирования;
	КонецЕсли;
	
	Элементы.ВводимоеЧисло.Формат               = ФорматРедактирования;
	Элементы.ВводимоеЧисло.ФорматРедактирования = ФорматРедактирования;
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Попытка
		ВводимоеЧисло = Формат(Число(ВводимоеЧисло),ФорматРедактирования+"; ЧГ=");
		ПодключитьОбработчикОжидания("ПровертьЗакрытиеФормы", 0.01, Истина);
		
	Исключение
		ВводимоеЧисло = 0;
	КонецПопытки;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана 

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры


#КонецОбласти


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если  ИмяСобытия = "KeyPress"  И ВводДоступен() Тогда
		нПарам = НРег(Параметр);
		Если нПарам = "enter" Тогда
			Готово(Неопределено);
		Иначе
			
			Если нПарам = "scan:11" Тогда
				нПарам = "0";
			КонецЕсли;
			
			тЧислоСтрокой = Формат(ВводимоеЧисло,"ЧЦ=15; ЧГ=");
			
			Если нПарам = "bksp"Тогда
				н = СтрДлина(тЧислоСтрокой);
				Если н = 0 ИЛИ н = 1 Тогда
					ВводимоеЧисло = 0;
				Иначе
					нч =   Лев(тЧислоСтрокой,н-1);
					ВводимоеЧисло = Число(нч);
				КонецЕсли;
			Иначе
				Попытка
					//Сообщить(тЧислоСтрокой+Строка(нПарам));
					ВводимоеЧисло = Формат(Число(тЧислоСтрокой+Строка(нПарам)),"ЧГ=");
				Исключение
				КонецПопытки;
			КонецЕсли;
			//Сообщить(Параметр);
		КонецЕсли;		
	КонецЕсли;

	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводимоеЧислоПриИзменении(Элемент)
	
	Попытка
		ВводимоеЧисло = Формат(Число(ВводимоеЧисло),ФорматРедактирования+"; ЧГ=");
		
		
		Если ЗапросМРЦ Тогда
			РезОтвет =  ИнтеграцияТК_Клиент.ПроверитьМРЦТовара(АртикулТовара,ВводимоеЧисло);
			
			
			Если РезОтвет.Результат Тогда
				Если РезОтвет.Ответ = Ложь Тогда
					ОбщегоНазначенияКлиент.СообщитьОбОшибке("Введено не корректное МРЦ!",Истина,"Проверка мрц",5);
					ВызватьИсключение "Введено не корректное МРЦ!";
				КонецЕсли;
				
			Иначе
				ОбщегоНазначенияКлиент.СообщитьОбОшибке("Ошибка запроса мрц "+ Символы.ПС +РезОтвет.ОписаниеОшибки,Истина,"Проверка мрц",5);

				ВызватьИсключение("Ошибка запроса мрц");
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		
		ПодключитьОбработчикОжидания("ПровертьЗакрытиеФормы", 0.01, Истина);
	Исключение
		ВводимоеЧисло = 0;
	КонецПопытки;
	
КонецПроцедуры
&НаКлиенте
Процедура ПровертьЗакрытиеФормы()
		
	Закрыть(ВводимоеЧисло);

КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьФорму()
	
	
	ЭтаФорма.Активизировать();

	ЭтаФорма.ТекущийЭлемент = Элементы.ВводимоеЧисло;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	#Если МобильноеПриложениеКлиент  Тогда
		
		ПодключитьОбработчикОжидания("АктивизироватьФорму", 0.01, Истина);
	#иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.ВводимоеЧисло;

	#КонецЕсли	
	
КонецПроцедуры
