
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	НастроитьПоляФормы();
	
	ВидОперации = Параметры.ВидОперации;
	ВидОплаты   = Параметры.ВидОплаты;
	ЧекПродажи  = Параметры.ЧекПродажи;
	
	НастроитьОтображенияШапки(Параметры);
	
	Если Параметры.ФормаОплаты = "ПлатежнаяКарта" ИЛИ Параметры.ФормаОплаты = "СмешаннаяОплата" Тогда
		
		ДанныеОплатыПоПлатежнойКарте = Параметры.ДанныеОплатыПоПлатежнойКарте;
		
		РезультатОперацииПоПлатежнойСистеме = ДанныеОплатыПоПлатежнойКарте;
		
		Если НЕ ДанныеОплатыПоПлатежнойКарте = Неопределено Тогда
			ПолученоПлатежнаяКарта = ДанныеОплатыПоПлатежнойКарте.Сумма;
			ВидОплаты = ДанныеОплатыПоПлатежнойКарте.ВидОплаты;
		КонецЕсли;
		
		Если ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
			
			ДанныеОплатыПоПлатежнойКартеЧекаПродажи = Параметры.ДанныеОплатыПоПлатежнойКартеЧекаПродажи;
			
			Если НЕ ДанныеОплатыПоПлатежнойКартеЧекаПродажи = Неопределено Тогда
				ВидОплаты = ДанныеОплатыПоПлатежнойКартеЧекаПродажи.ВидОплаты;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидОплаты) Тогда
			Если ПродажиВызовСервераПовтИсп.КоличествоВидовОплаты() = 1 Тогда
				ВидОплаты = ПродажиВызовСервераПовтИсп.ПолучитьВидОплаты();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураПараметровДляПечати = Новый Структура;
	СтруктураПараметровДляПечати.Вставить("ОбщиеПараметры", Параметры.ОбщиеПараметры);
	СтруктураПараметровДляПечати.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	КассоваяСмена = ПродажиВызовСервераПовтИсп.ПолучитьСмену(Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ОтменитьОплату", "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ВидОплаты, ВидОплатыСмешаная", "Видимость", ЗначениеЗаполнено(ВидОплаты));
	
	СформироватьЗаголовок();
	НастроитьВидимостьКартинокSMSиEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазблокироватьФорму();
	
	УстановитьДоступностьПробитьЧек();
	
	СкрытьСтраницыПлатежнойСистемы();
	ОтобразитьПустуюСтраницуПечатиЧека();
	
	НастроитьВидПоДаннымОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	#Если МобильноеПриложениеКлиент Тогда
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	#КонецЕсли
	
	Если НЕ ДоступноЗакрытиеФормы Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПодключаемоеОборудованиеКлиент.ОтключитьОборудование(ОборудованиеПечати, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ПолученоНаличныеПриИзменении(Элемент)
	
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученоПлатежнаяКартаПриИзменении(Элемент)
	
	ПриИзмененииПолучено("ПлатежнаяКарта");
	
КонецПроцедуры

&НаКлиенте
Процедура КОплатеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СуммуКОплатеВПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученоПриИзменении(Элемент)
	
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура ВнизПустышкаНажатие(Элемент)
	
	СуммуКОплатеВПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧекПокупателюНажатие(Элемент)
	
	ОткрытьФормуВводаНомераТелефонаИEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияSMSНажатие(Элемент)
	
	ОткрытьФормуВводаНомераТелефонаИEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияEmailНажатие(Элемент)
	
	ОткрытьФормуВводаНомераТелефонаИEmail();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	Если ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяККТ() Тогда
		
		Если ЗначениеЗаполнено(КассоваяСмена) Тогда
			
			ПробитьЧекПродолжение();
			
		Иначе
			
			ОписаниеПослеОткрытиеСмены = Новый ОписаниеОповещения("ПослеОткрытиеСмены", ЭтотОбъект);
			ПродажиКлиент.ОткрытьСмену(ЭтаФорма, ОписаниеПослеОткрытиеСмены);
			
		КонецЕсли;
		
	Иначе
		
		ПробитьЧекПродолжение();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОплату(Команда)
	
	ЗаблокироватьФорму();
	
	ОтобразитьПустуюСтраницуПечатиЧека();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтменитьОплатуПродолжение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Отменить оплату в платежной системе?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Подтверждение'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить50(Команда)
	
	ПолученоНаличные = ПолученоНаличные + 50;
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить100(Команда)
	
	ПолученоНаличные = ПолученоНаличные + 100;
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить500(Команда)
	
	ПолученоНаличные = ПолученоНаличные + 500;
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить1000(Команда)
	
	ПолученоНаличные = ПолученоНаличные + 1000;
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура КОплатеВПолучено(Команда)
	СуммуКОплатеВПолучено();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОткрытиеСмены(Результат, ДополнительныеПараметры) Экспорт
	
	КассоваяСмена = ПродажиВызовСервераПовтИсп.ПолучитьСмену(Ложь);
	
	Если ЗначениеЗаполнено(КассоваяСмена) Тогда
		ПробитьЧекПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекПродолжение()
	
	ЗаблокироватьФорму();
	ОтобразитьПустуюСтраницуПечатиЧека();
	
	Если БезналичнаяОплата И НЕ ПолученоПлатежнаяКарта = 0 Тогда
		
		Если ЗначениеЗаполнено(ОборудованиеПлатежнойСистемы) Тогда
			
			Если ОплатаПоПлатежнойСистемеПроведена Тогда
				
				ПоказатьРаспечататьСлипЧек();
				
			Иначе
				
				ОтобразитьСтраницуПроцесса();
				
				Если ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
					ПодключитьОбработчикОжидания("Подключаемый_ОплатитьПоПлатежнойСистеме", 0.1, Истина);
				Иначе
					ПодключитьОбработчикОжидания("Подключаемый_ВозвратитьОплатуПоПлатежнойСистеме", 0.1, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПробитьЧекВопрос", ЭтотОбъект);
			ТекстВопроса = НСтр("ru = 'Операция оплаты на эквайринговом терминале прошла успешно?'");
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,, НСтр("ru = 'Подтверждение'"));
			
		КонецЕсли;
		
	Иначе
		
		ОтобразитьПечатьЧека();
		ПодключитьОбработчикОжидания("Подключаемый_ПробитьЧек", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображенияШапки(Параметры)
	
	Если Параметры.ФормаОплаты = "Наличные" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаПлатежнаяКарта, СтраницаСмешаннаяОплата",
			"Видимость", Ложь);
		
		Элементы.СтраницыШапка.ТекущаяСтраница = Элементы.СтраницаНаличные;
		
		КОплате = Параметры.СуммаДокумента;
		
		БезналичнаяОплата = Ложь;
		
		Заголовок = НСтр("ru = 'Наличные'");
		
	ИначеЕсли Параметры.ФормаОплаты = "ПлатежнаяКарта" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаНаличные, СтраницаСмешаннаяОплата",
			"Видимость", Ложь);
		
		Элементы.СтраницыШапка.ТекущаяСтраница = Элементы.СтраницаПлатежнаяКарта;
		ПолученоПлатежнаяКарта = Параметры.СуммаДокумента;
		
		БезналичнаяОплата = Истина;
		Заголовок = НСтр("ru = 'Платежная карта'");
		
	ИначеЕсли Параметры.ФормаОплаты = "СмешаннаяОплата" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницаНаличные, СтраницаПлатежнаяКарта",
			"Видимость", Ложь);
		
		Элементы.СтраницыШапка.ТекущаяСтраница = Элементы.СтраницаСмешаннаяОплата;
		КОплате = Параметры.СуммаДокумента;
		
		БезналичнаяОплата = Истина;
		Заголовок = НСтр("ru = 'Смешанная оплата'");
		
		Элементы.ПодсказкаБезналичные.Видимость = Ложь;
		Если Параметры.Свойство("АльтернативнаяОплата", АльтернативнаяОплата) Тогда
			
			Параметры.Свойство("Безналичные", ПлатежнаяКартаАльтернативнаяОплата);
			
			Если ПлатежнаяКартаАльтернативнаяОплата = 0 Тогда
				Подсказка = НСтр("ru = 'Возврат по карте = 0'");
			Иначе
				Подсказка = НСтр("ru = 'Возврат по карте = 0 или %Безналичные%'");
				Подсказка = СтрЗаменить(Подсказка, "%Безналичные%", ПлатежнаяКартаАльтернативнаяОплата);
			КонецЕсли;
			
			Элементы.ПодсказкаБезналичные.Видимость = Истина;
			Элементы.ПодсказкаБезналичные.Заголовок = Подсказка;
		Иначе
			
			Если Параметры.Свойство("Безналичные", ПолученоПлатежнаяКарта) Тогда
				Элементы.ПолученоПлатежнаяКарта.ТолькоПросмотр = Истина;
				ПолученоПлатежнаяКартаЗаблокировано = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОплатыПоПлатежнойКарте()
	
	ДанныеОплатыПоПлатежнойКарте = ВладелецФормы.ДанныеОплатыПоПлатежнойКарте();
	
	Если НЕ ДанныеОплатыПоПлатежнойКарте = Неопределено И ЗначениеЗаполнено(ДанныеОплатыПоПлатежнойКарте.НомерСсылкиОперации) Тогда
		
		ОплатаПоПлатежнойСистемеПроведена = Истина;
		
	Иначе
		ОплатаПоПлатежнойСистемеПроведена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПробитьЧек()
	
	ОборудованиеПечати = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПечати();
	
	РезультатПечатиЧека = ПродажиКлиент.РезультатПечатиЧека();
	
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		
		СтруктураПараметровДляПечати.ОбщиеПараметры.ТаблицаОплат.Очистить();
		
		Если ЗначениеЗаполнено(ПолученоНаличные) Тогда
			ТипНаличные = 0;
			СтрокаОплаты = Новый Структура("ТипОплаты, Сумма", ТипНаличные, ПолученоНаличные);
			СтруктураПараметровДляПечати.ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПолученоПлатежнаяКарта) Тогда
			ТипПлатежнаяКарта = 1;
			СтрокаОплаты = Новый Структура("ТипОплаты, Сумма", ТипПлатежнаяКарта, ПолученоПлатежнаяКарта);
			СтруктураПараметровДляПечати.ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
		КонецЕсли;
		
		СтруктураПараметровДляПечати.ОбщиеПараметры.Вставить("ПокупательEmail", АдресEmail);
		СтруктураПараметровДляПечати.ОбщиеПараметры.Вставить("ПокупательНомер", НомерТелефона);
		
		СтруктураПараметровДляПечати.Вставить("ОборудованиеПечати", ОборудованиеПечати);
		ПродажиКлиент.ПечатьЧекаПродажи(СтруктураПараметровДляПечати, РезультатПечатиЧека);
		
	Иначе
		
		РезультатПечатиЧека.Успешно = Истина;
		
	КонецЕсли;
	
	Если РезультатПечатиЧека.Успешно Тогда
		
		ПараметрыЗакрытия = Новый Структура;
		
		ПараметрыЗакрытия.Вставить("Успешно",          Истина);
		ПараметрыЗакрытия.Вставить("ФискальныйНомер",  РезультатПечатиЧека.НомерЧека);
		ПараметрыЗакрытия.Вставить("АдресЧекаЕГАИС",   РезультатПечатиЧека.АдресЧекаЕГАИС);
		ПараметрыЗакрытия.Вставить("ПодписьЧекаЕГАИС", РезультатПечатиЧека.ПодписьЧекаЕГАИС);
		ПараметрыЗакрытия.Вставить("АдресEmailПокупателя",    АдресEmail);
		ПараметрыЗакрытия.Вставить("НомерТелефонаПокупателя", НомерТелефона);
		
		Оплата = Новый Массив;

		Если ЗначениеЗаполнено(ПолученоНаличные) Тогда
			СтруктураОплаты = Новый Структура();
			СтруктураОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплаты.Наличные"));
			СтруктураОплаты.Вставить("Сумма", ПолученоНаличные - Сдача);
			Оплата.Добавить(СтруктураОплаты);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПолученоПлатежнаяКарта) Тогда
			СтруктураОплаты = Новый Структура();
			СтруктураОплаты.Вставить("ТипОплаты", ПредопределенноеЗначение("Перечисление.ТипыОплаты.ПлатежнаяКарта"));
			СтруктураОплаты.Вставить("Сумма", ПолученоПлатежнаяКарта);
			СтруктураОплаты.Вставить("ВидОплаты", ВидОплаты);
			СтруктураОплаты.Вставить("РезультатОперацииПоПлатежнойСистеме", РезультатОперацииПоПлатежнойСистеме);
			
			Оплата.Добавить(СтруктураОплаты);
		КонецЕсли;
		
		ПараметрыЗакрытия.Вставить("Оплата", Оплата);
		
		Если НЕ ЗначениеЗаполнено(КассоваяСмена) Тогда
			КассоваяСмена = ПродажиВызовСервераПовтИсп.ПолучитьСмену(Истина);
			Оповестить("ИзмененаКассоваяСмена");
		КонецЕсли;
		
		ПараметрыЗакрытия.Вставить("КассоваяСмена", КассоваяСмена);
		РазблокироватьФорму();
		Закрыть(ПараметрыЗакрытия);
	Иначе
		
		ОтобразитьОшибкуПечатиЧека(РезультатПечатиЧека.ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПоказатьРаспечататьСлипЧек()
	
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		
		// функция разреза [cut] будет перенесена в мБПО, временное решение.
		
		МассивРазрезанныхСлипЧеков = ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивПодстрок(РезультатОперацииПоПлатежнойСистеме.СлипЧек, "[cut]", Ложь, Ложь);
		
		Для Каждого РазрезанныйСлипЧек Из МассивРазрезанныхСлипЧеков Цикл
			
			ОчиститьСообщения();
			ВыходныеПараметры = Неопределено;
			ВходныеПараметры = Новый Структура("СтрокиТекста", РазрезанныйСлипЧек);
			
			Если МенеджерОборудованияКлиент.ВыполнитьПечатьТекста(
				УникальныйИдентификатор,
				ОборудованиеПечати,
				ВходныеПараметры,
				ВыходныеПараметры) Тогда
				
				ОтобразитьПустуюСтраницуПечатиЧека();
			Иначе
				
				ОтобразитьОшибкуПечатиСлипЧека(ВыходныеПараметры.ТекстОшибки);
				Возврат;
				
			КонецЕсли;
			
		КонецЦикла;
		
		
		ПоказатьРаспечататьСлипЧекЗавершение(Неопределено, Неопределено);
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекстСлипЧека", РезультатОперацииПоПлатежнойСистеме.СлипЧек);
		ПараметрыФормы.Вставить("ДатаОперации", РезультатОперацииПоПлатежнойСистеме.ДатаОперации);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьРаспечататьСлипЧекЗавершение", ЭтотОбъект);
		ОткрытьФорму("ОбщаяФорма.СлипЧекПлатежнойСистемы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОплатитьПоПлатежнойСистеме()
	
	ВыполняемаяОперацияПлатежнойСистемы = "Оплата";
	
	ПараметрыОплаты = ПродажиКлиент.ПараметрыОплатыПоПлатежнойСистеме();
	ПараметрыОплаты.Сумма = ПолученоПлатежнаяКарта;
	ПараметрыОплаты.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыОплаты.Оборудование = ОборудованиеПлатежнойСистемы;
	
	РезультатОперацииПоПлатежнойСистеме = ПродажиКлиент.ОплатитьПоПлатежнойСистеме(ПараметрыОплаты);
	
	ВладелецФормы.ПослеПолучениеРезультатаПоПлатежнойСистеме(ПолученоПлатежнаяКарта, ВидОплаты, РезультатОперацииПоПлатежнойСистеме);
	
	ОбновитьДанныеОплатыПоПлатежнойКарте();
	
	Если РезультатОперацииПоПлатежнойСистеме.Успешно Тогда
		
		ПоказатьРаспечататьСлипЧек();
		ОтобразитьОплатаЗавершенаУспешно();
	Иначе
		
		ОшибкаОплаты = РезультатОперацииПоПлатежнойСистеме.ТекстОшибки;
		
		ОтобразитьОшибкаОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВозвратитьОплатуПоПлатежнойСистеме()
	
	ВыполняемаяОперацияПлатежнойСистемы = "ВозвратОплаты";
	
	ПараметрыВозвратаОплаты                     = ПродажиКлиент.ПараметрыВозвратаОплатыПоПлатежнойСистеме();
	ПараметрыВозвратаОплаты.Сумма               = ПолученоПлатежнаяКарта;
	ПараметрыВозвратаОплаты.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыВозвратаОплаты.Оборудование        = ОборудованиеПлатежнойСистемы;
	ПараметрыВозвратаОплаты.НомерКарты          = ДанныеОплатыПоПлатежнойКартеЧекаПродажи.НомерКарты;
	ПараметрыВозвратаОплаты.НомерСсылкиОперации = ДанныеОплатыПоПлатежнойКартеЧекаПродажи.НомерСсылкиОперации;
	ПараметрыВозвратаОплаты.КодАвторизации      = ДанныеОплатыПоПлатежнойКартеЧекаПродажи.КодАвторизации;
	ПараметрыВозвратаОплаты.НомерЧека           = СтруктураПараметровДляПечати.ОбщиеПараметры.НомерЧека;
	
	РезультатОперацииПоПлатежнойСистеме = ПродажиКлиент.ВозвратитьОплатуПоПлатежнойСистеме(ПараметрыВозвратаОплаты);
	
	ВладелецФормы.ПослеПолучениеРезультатаПоПлатежнойСистеме(ПолученоПлатежнаяКарта, ВидОплаты, РезультатОперацииПоПлатежнойСистеме);
	ОбновитьДанныеОплатыПоПлатежнойКарте();
	
	Если РезультатОперацииПоПлатежнойСистеме.Успешно Тогда
		
		ПоказатьРаспечататьСлипЧек();
		ОтобразитьВозвратОплатыУспешно();
	Иначе
		
		ОшибкаОплаты = РезультатОперацииПоПлатежнойСистеме.ТекстОшибки;
		
		ОтобразитьОшибкаОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьОплатуПоПлатежнойСистеме()
	
	ВыполняемаяОперацияПлатежнойСистемы = "ОтменаОплаты";
	
	ПараметрыОтменыОплаты = ПродажиКлиент.ПараметрыОтменыОплатыПоПлатежнойСистеме();
	
	ПараметрыОтменыОплаты.Сумма                   = ПолученоПлатежнаяКарта;
	ПараметрыОтменыОплаты.УникальныйИдентификатор = УникальныйИдентификатор;
	ПараметрыОтменыОплаты.Оборудование            = ОборудованиеПлатежнойСистемы;
	ПараметрыОтменыОплаты.НомерКарты              = ДанныеОплатыПоПлатежнойКарте.НомерКарты;
	ПараметрыОтменыОплаты.НомерСсылкиОперации     = ДанныеОплатыПоПлатежнойКарте.НомерСсылкиОперации;
	ПараметрыОтменыОплаты.КодАвторизации          = ДанныеОплатыПоПлатежнойКарте.КодАвторизации;
	ПараметрыОтменыОплаты.НомерЧека               = СтруктураПараметровДляПечати.ОбщиеПараметры.НомерЧека;
	
	РезультатОперацииПоПлатежнойСистеме = ПродажиКлиент.ОтменитьОплатуПоПлатежнойСистеме(ПараметрыОтменыОплаты);
	
	ВладелецФормы.ПослеПолучениеРезультатаПоПлатежнойСистеме(ПолученоПлатежнаяКарта, ВидОплаты, РезультатОперацииПоПлатежнойСистеме);
	ОбновитьДанныеОплатыПоПлатежнойКарте();
	
	Если РезультатОперацииПоПлатежнойСистеме.Успешно Тогда
		
		ОтобразитьОтменаОплатыЗавершенаУспешно();
		ПоказатьРаспечататьСлипЧек();
		
	Иначе
		
		ОшибкаОплаты = РезультатОперацииПоПлатежнойСистеме.ТекстОшибки;
		ОтобразитьОшибкаОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидПоДаннымОплаты()
	
	Если НЕ ДанныеОплатыПоПлатежнойКарте = Неопределено И ЗначениеЗаполнено(ДанныеОплатыПоПлатежнойКарте.НомерСсылкиОперации) Тогда
		
		ОплатаПоПлатежнойСистемеПроведена = Истина;
		
		Если ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
			ОтобразитьОплатаЗавершенаУспешно();
			Элементы.ОтменитьОплату.Видимость = Истина;
		Иначе
			ОтобразитьВозвратОплатыУспешно();
		КонецЕсли;
		
		
		
		Элементы.СтраницыПечатьЧека.ТекущаяСтраница = Элементы.СтраницаПечатьЧекаПродолжениеПечати;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОплатуПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		РазблокироватьФорму();
		Возврат;
	КонецЕсли;
	
	ОтобразитьСтраницуПроцесса();
	ПодключитьОбработчикОжидания("Подключаемый_ОтменитьОплатуПоПлатежнойСистеме", 0.1, Истина);
	
КонецПроцедуры

#Область ОтображениеСтраниц

&НаКлиенте
Процедура ОтобразитьСтраницуПроцесса()
	
	СкрытьСтраницыПлатежнойСистемы();
	
	Элементы.СтраницаОплатаПроцесс.Видимость = Истина;
	Элементы.СтраницыПлатежнаяСистема.ТекущаяСтраница = Элементы.СтраницаОплатаПроцесс;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОплатаЗавершенаУспешно()
	
	СкрытьСтраницыПлатежнойСистемы();
	
	Элементы.СтраницаОплатаУспешно.Видимость = Истина;
	Элементы.СтраницыПлатежнаяСистема.ТекущаяСтраница = Элементы.СтраницаОплатаУспешно;
	Элементы.ПолученоПлатежнаяКарта.ТолькоПросмотр = Истина;
	ПолученоПлатежнаяКартаЗаблокировано = Истина;
	
	Элементы.ОтменитьОплату.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОтменаОплатыЗавершенаУспешно()
	
	СкрытьСтраницыПлатежнойСистемы();
	
	Элементы.СтраницаОтменаОплатыУспешно.Видимость = Истина;
	Элементы.СтраницыПлатежнаяСистема.ТекущаяСтраница = Элементы.СтраницаОтменаОплатыУспешно;
	Элементы.ПолученоПлатежнаяКарта.ТолькоПросмотр = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОшибкаОперации()
	
	СкрытьСтраницыПлатежнойСистемы();
	
	Элементы.СтраницаОперацияОшибка.Видимость = Истина;
	Элементы.СтраницыПлатежнаяСистема.ТекущаяСтраница = Элементы.СтраницаОперацияОшибка;
	
	РазблокироватьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьВозвратОплатыУспешно()
	
	СкрытьСтраницыПлатежнойСистемы();
	
	Элементы.СтраницаВозвратОплатыУспешно.Видимость = Истина;
	Элементы.СтраницыПлатежнаяСистема.ТекущаяСтраница = Элементы.СтраницаВозвратОплатыУспешно;
	Элементы.ПолученоПлатежнаяКарта.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСтраницыПлатежнойСистемы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, 
		"СтраницаОплатаПроцесс, СтраницаОплатаУспешно, СтраницаОперацияОшибка, СтраницаОтменаОплатыУспешно, СтраницаВозвратОплатыУспешно",
		"Видимость",
		Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПечатьЧека()
	
	Элементы.СтраницыПечатьЧека.ТекущаяСтраница = Элементы.СтраницаПечатьЧекаПечать;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПечатьСлипЧека()
	
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		
		Элементы.СтраницыПечатьЧека.ТекущаяСтраница = Элементы.СтраницаПечатьЧекаПечатьСлип;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОшибкуПечатиЧека(ОписаниеОшибки)
	
	ОшибкаПечати = ОписаниеОшибки;
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		Элементы.СтраницаПечатьЧекаОшибка.Видимость = Истина;
		Элементы.СтраницыПечатьЧека.ТекущаяСтраница = Элементы.СтраницаПечатьЧекаОшибка;
	КонецЕсли;
	
	РазблокироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОшибкуПечатиСлипЧека(ОписаниеОшибки)
	
	ОшибкаПечати = ОписаниеОшибки;
	Если ЗначениеЗаполнено(ОборудованиеПечати) Тогда
		Элементы.СтраницаПечатьЧекаОшибкаСлип.Видимость = Истина;
		Элементы.СтраницыПечатьЧека.ТекущаяСтраница = Элементы.СтраницаПечатьЧекаОшибкаСлип;
	КонецЕсли;
	
	Элементы.ОтменитьОплату.Видимость = Истина;
	РазблокироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПустуюСтраницуПечатиЧека()
	
	Элементы.СтраницаПечатьЧекаОшибка.Видимость = Ложь;
	Элементы.СтраницыПечатьЧека.ТекущаяСтраница = Элементы.СтраницаПечатьЧекаПустая;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОповещениеПробитьЧекВопрос(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		РазблокироватьФорму();
		Возврат;
	КонецЕсли;
	
	ОтобразитьПечатьЧека();
	ПодключитьОбработчикОжидания("Подключаемый_ПробитьЧек", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРаспечататьСлипЧек()
	
	ОтобразитьПечатьСлипЧека();
	
	ПодключитьОбработчикОжидания("Подключаемый_ПоказатьРаспечататьСлипЧек", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРаспечататьСлипЧекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыполняемаяОперацияПлатежнойСистемы = "ОтменаОплаты" Тогда
		ОтобразитьПечатьЧека();
		ПодключитьОбработчикОжидания("Подключаемый_ПробитьЧек", 0.1, Истина);
	Иначе
		РазблокироватьФорму();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	Элементы.ДекорацияОтступТонкий.Шрифт = Новый Шрифт(,1);
	
	ОборудованиеПечати = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПечати();
	ОборудованиеПлатежнойСистемы = ЗначениеНастроекВызовСервераПовтИсп.ОборудованиеПлатежнойСистемы();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СтраницыПлатежнаяСистема", "Видимость",
		ЗначениеЗаполнено(ОборудованиеПлатежнойСистемы)
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаОтправка", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяККТ()
	);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовок()
	
	Если ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Продажа() Тогда
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Продажа: '") + ЭтаФорма.Заголовок;
		
	ИначеЕсли ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ЭтаФорма.Заголовок = НСтр("ru = 'Возврат: '") + ЭтаФорма.Заголовок;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПолучено(ТипОплаты = "Наличные")
	
	Если ТипОплаты = "ПлатежнаяКарта" Тогда
			
			Если АльтернативнаяОплата Тогда
				
				ПолученоПлатежнаяКарта = ?(ЗначениеЗаполнено(ПолученоПлатежнаяКарта), ПлатежнаяКартаАльтернативнаяОплата, 0);
				
			КонецЕсли;
			
		Если ЗначениеЗаполнено(ПолученоПлатежнаяКарта) И НЕ ЗначениеЗаполнено(ПолученоНаличные) Тогда
			ПолученоНаличные = КОплате - ПолученоПлатежнаяКарта;
		КонецЕсли;
		
		Если ПолученоПлатежнаяКарта >= КОплате Тогда
			ПолученоПлатежнаяКарта = КОплате;
			ПолученоНаличные = 0;
		КонецЕсли;
	Иначе
		
		Если БезналичнаяОплата И НЕ ПолученоПлатежнаяКартаЗаблокировано Тогда
			
			Если ЗначениеЗаполнено(ПолученоНаличные)Тогда
				ПолученоПлатежнаяКарта = КОплате - ПолученоНаличные;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Сдача = ПолученоНаличные - (КОплате - ПолученоПлатежнаяКарта);
	
	УстановитьДоступностьПробитьЧек();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммуКОплатеВПолучено()
	
	ПолученоНаличные = КОплате;
	ПриИзмененииПолучено();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПробитьЧек()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(
		ЭтаФорма,
		"ПробитьЧек",
		"Доступность",
		(ПолученоНаличные + ПолученоПлатежнаяКарта) >= КОплате);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоляФормы()
	
	ОбщегоНазначения.ОформитьСуммовыеПоля(ЭтаФорма,
		"СуммаПлатежа, КОплатеНаличные, Получено, СдачаНаличные, КОплате, ПолученоПлатежнаяКарта, ПолученоНаличные, Сдача"
	);
	
	ОбщегоНазначения.УстановитьЦветИтоговыхПолей(ЭтаФорма,
		"СуммаПлатежа, КОплатеНаличные, СдачаНаличные, КОплате, Сдача"
	);
	
	ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма,
		"ВидОплаты, ВидОплатыСмешаная"
	);
	
	ОбщегоНазначения.УстановитьЦветПолейУспешныхОпераций(ЭтаФорма,
		"НадписьУспешно, НадписьОтменаУспешно, НадписьВозвратУспешно"
	);
	
	ОбщегоНазначения.УстановитьЦветПолейОшибок(ЭтаФорма,
		"НадписьОшибка, НадписьОшибкаПечати, НадписьОшибкаПечатиСлип"
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьФорму()
	
	ДоступноЗакрытиеФормы = Ложь;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ПробитьЧек, Отмена", "Доступность",
		Ложь
	);

КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьФорму()
	
	ДоступноЗакрытиеФормы = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ПробитьЧек, Отмена", "Доступность",
		Истина
	);
	
КонецПроцедуры

#Область НомерТелефонаИEmail

&НаКлиенте
Процедура ПослеВводаНомераТелефонаEmail(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	АдресEmail = Результат.АдресEmail;
	НомерТелефона = Результат.НомерТелефона;
	
	НастроитьВидимостьКартинокSMSиEmail();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКартинокSMSиEmail()
	
	Элементы.ДекорацияSMS.Видимость = ЗначениеЗаполнено(НомерТелефона);
	Элементы.ДекорацияEmail.Видимость = ЗначениеЗаполнено(АдресEmail);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаНомераТелефонаИEmail()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресEmail",    АдресEmail);
	ПараметрыФормы.Вставить("НомерТелефона", НомерТелефона);
	
	ПараметрыФормы.Вставить("АдресEmailЧекаПродажи", "");
	ПараметрыФормы.Вставить("НомерТелефонаЧекаПродажи", "");
	
	Если ВидОперации = ПродажиКлиентСерверПовтИсп.ВидОперацииЧека_Возврат() Тогда
		
		ЗаполнитьДанныеПокупателяИзЧекаПродажи(ПараметрыФормы);
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаНомераТелефонаEmail", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Чек.Форма.ВводНомераТелефонаИEmail", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,
		ОписаниеОповещения
	);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПокупателяИзЧекаПродажи(ПараметрыФормы)
	
	ПараметрыФормы.АдресEmailЧекаПродажи = ЧекПродажи.АдресEmailПокупателя;
	ПараметрыФормы.НомерТелефонаЧекаПродажи = ЧекПродажи.НомерТелефонаПокупателя;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти



