


//#Область ПрограммныйИнтерфейс

//&НаКлиенте
//Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
//	
//КонецПроцедуры

//// Возникает при сканировании внутренней камерой устройства
////
//&НаКлиенте
//Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
//	
//	Возврат;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийФормы

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	Если Параметры.Свойство("АвтоТест") Тогда
//		Возврат;
//	КонецЕсли;

//	Если Параметры.Свойство("ДоументСервер") Тогда
//		ЕстьНомерСтрокиДок =  Параметры.ДоументСервер ИЛИ Параметры.ВидДокумента ="ПриемТовара";

//		Если ЕстьНомерСтрокиДок Тогда
//			ПозицияВвода = 1;
//		Иначе
//			ПозицияВвода = 2;
//		КонецЕсли;
//	Иначе
//		ЕстьНомерСтрокиДок =  Параметры.ВидДокумента ="ПриемТовара";
//		ПозицияВвода = 1;
//	КонецЕсли;
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "МаксимальноеКоличествоИнфо", "Видимость", Ложь);
//	//ОбщегоНазначения.УстановитьЦветИнформационныхНадписей(ЭтаФорма, "МаксимальноеКоличествоИнфо");
//	//
//	//ИсключенныеСвойства = "ЗакрыватьПриВыборе, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр";
//	//ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, ,ИсключенныеСвойства);
//	//
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "КоличествоОжидаемое", "Видимость", ДоументСервер);
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "НомерСтрокиДокумента", "Видимость", ЕстьНомерСтрокиДок);
//	//
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "УдалитьСтроку", "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
//	//
//	//НастроитьФормуПоЗначениямНастроек();
//	//
//	//ОформитьСтатичныеЗаголовкиИПоля();
//	//
//	//// ОриентацияЭкрана
//	//НастроитьФормуПоОриентацииЭкрана();
//	
//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопки", "Видимость", Ложь);
//	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	Если ПозицияВвода = 1 Тогда
//		ЭтаФорма.ТекущийЭлемент = Элементы.НомерСтрокиДокумента;
//	ИначеЕсли  ПозицияВвода = 2 Тогда
//		ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
//	КонецЕсли;
//	
//	
//	#Если МобильноеПриложениеКлиент  Тогда
//		НачатьРедактированиеЭлемента();
//	#КонецЕсли	
//	
//	//Если ПозицияВвода = 1 ИЛИ ПозицияВвода = 2 Тогда
//	//	Оповестить("ПоказатьКлавиатуру");
//	// КонецЕсли;
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура ПриИзмененииПараметровЭкрана()
//	ПриИзмененииПараметровЭкранаСервер();
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	
//	//Сообщить(ИмяСобытия);
//	
//	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
//		
//		НастроитьФормуПоЗначениямНастроек();
//		
////	ИначеЕсли ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
//		
//	ИначеЕсли  ИмяСобытия = "KeyPress"  И ВводДоступен() Тогда
//		нПарам =  НРег(Параметр);
//		
//		Если нПарам = "enter" и ПозицияВвода = 1  Тогда
//			Если НЕ ЕстьНомерСтрокиДок Тогда
//				Готово(Неопределено);
//			Иначе
//				ПозицияВвода = 2;
//			КонецЕсли;
//			Возврат; 
//			
//		КонецЕсли;
//		
//		Если нПарам = "enter" и ПозицияВвода = 2 Тогда
//			
//			Готово(Неопределено);
//			Возврат;
//		КонецЕсли;
//		
//	

//		Если нПарам = "scan:11" Тогда
//			нПарам = "0";
//		КонецЕсли;
//		
//		//Сообщить("Позиция "+ПозицияВвода);
//	
//		
//		Если  ПозицияВвода = 2 Тогда

//			тЧислоСтрокой = Формат(Количество,"ЧЦ=10; ЧГ=");		
//			Если  нПарам = "bksp" Тогда
//				н = СтрДлина(тЧислоСтрокой);
//				Если н = 0 ИЛИ н = 1 Тогда
//					Количество = 0;
//				Иначе
//					нч =   Лев(тЧислоСтрокой,н-1);
//					Количество = Число(нч);
//				КонецЕсли;
//			Иначе
//				Попытка
//					Количество = Число(тЧислоСтрокой+Строка(нПарам));
//				Исключение
//				КонецПопытки;
//			КонецЕсли;
//			//Сообщить("Позиция 2 ,парам "+нПарам);
//		ИначеЕсли	ПозицияВвода = 1 Тогда
//			тЧислоСтрокой = Формат(НомерСтрокиДокумента,"ЧЦ=10; ЧГ=");			
//			Если  нПарам = "bksp" Тогда
//				н = СтрДлина(тЧислоСтрокой);
//				Если н = 0 ИЛИ н = 1 Тогда
//					НомерСтрокиДокумента = 0;
//				Иначе
//					нч =   Лев(тЧислоСтрокой,н-1);
//					НомерСтрокиДокумента = Число(нч);
//				КонецЕсли;
//			Иначе
//				Попытка
//					НомерСтрокиДокумента = Число(тЧислоСтрокой+Строка(нПарам));
//				Исключение
//				КонецПопытки;
//			КонецЕсли;
//			//Сообщить("Позиция 1 ,парам "+нПарам);

//		КонецЕсли;
//	ИначеЕсли ИмяСобытия = "ПоказатьКлавиатуру" Тогда
//		
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопки", "Видимость", Истина);
//	ИначеЕсли ИмяСобытия = "СкрытьКлавиатуру" Тогда
//		
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаКнопки", "Видимость", Ложь);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементов

//#КонецОбласти

//#Область ОбработчикиКомандФормы

//&НаКлиенте
//Процедура УдалитьСтроку(Команда)
//	
//	ПараметрыЗакрытия = Новый Структура;
//	ПараметрыЗакрытия.Вставить("УдалитьСтроку");
//	
//	Закрыть(ПараметрыЗакрытия);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Готово(Команда)
//	
//	ПараметрыЗакрытия = Новый Структура;
//	ПараметрыЗакрытия.Вставить("Сохранить");
//	ПараметрыЗакрытия.Вставить("Количество", Количество);
//	ПараметрыЗакрытия.Вставить("НомерСтрокиДокумента", НомерСтрокиДокумента);
//	
//	Закрыть(ПараметрыЗакрытия);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СканироватьШтрихкод(Команда)
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
//	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
//	
//	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
//	
//КонецПроцедуры


//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции


//&НаСервере
//Процедура ОформитьСтатичныеЗаголовкиИПоля()
//	
//	// заголовок формы
//	ЗаголовокФормы = НСтр("ru = 'Строка №%НомерСтроки%'");
//	ЗаголовокФормы = СтрЗаменить(ЗаголовокФормы, "%НомерСтроки%", НомерСтроки);
//	Заголовок      = ЗаголовокФормы;
//	
//	// количество
//	ЗаголовокКоличества =  НСтр("ru = 'Количество, %ЕдИзм%'");
//	ЗаголовокКоличества = СтрЗаменить(ЗаголовокКоличества, "%ЕдИзм%", НаименованиеЕденицы);
//	Элементы.Количество.Заголовок = ЗаголовокКоличества;
//		

//	
//	Если ТолькоПросмотрФормы Тогда
//		Элементы.Отмена.Заголовок = НСтр("ru = 'Закрыть'");
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Готово, УдалитьСтроку", "Видимость", Ложь);
//		
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "КнопкаРегулирования", Ложь);
//		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество", "ТолькоПросмотр", Истина);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура НастроитьФормуПоЗначениямНастроек()
//	
//	Если ЕстьНомерСтрокиДок И НомерСтрокиДокумента <> "0" Тогда
//		ПозицияВвода = 2;
//	КонецЕсли;
//	Если ПозицияВвода = 1 Тогда
//		ЭтаФорма.ТекущийЭлемент = Элементы.НомерСтрокиДокумента;
//		//Элементы.НомерСтрокиДокумента.УстановитьГраницыВыделения(СтрДлина(Элементы.НомерСтрокиДокумента),СтрДлина(Элементы.НомерСтрокиДокумента)+1);
//		//Элементы.НомерСтрокиДокумента.АктивизироватьПоУмолчанию = Истина;	
//	Иначе
//		ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
//		Элементы.Количество.УстановитьГраницыВыделения(СтрДлина(Элементы.Количество),СтрДлина(Элементы.Количество)+1);
//		Элементы.Количество.АктивизироватьПоУмолчанию = Истина;	
//	КонецЕсли;
//	
//	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
//	//ОбщегоНазначения.ОформитьКоличественныеПоля(ЭтаФорма, "Количество");
//	ОбщегоНазначения.ОформитьКоличественныеПоля(ЭтаФорма, "КоличествоОжидаемое");
//	Количество = Формат(Число(Количество), "ЧРД=.");
//	
//	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, ,"Номенклатура");
//		
//	
//КонецПроцедуры


//#КонецОбласти

//#Область ОриентацияЭкрана

//&НаСервере
//Процедура ПриИзмененииПараметровЭкранаСервер()
//	
//	ОбщегоНазначения.УстановитьОриентациюЭкрана();
//	НастроитьФормуПоОриентацииЭкрана();
//	
//КонецПроцедуры

//&НаСервере
//Процедура НастроитьФормуПоОриентацииЭкрана()
//	
//	//Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
//	//	
//	//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество, Штрихкод", "ПоложениеЗаголовка", 
//	//	//	ПоложениеЗаголовкаЭлементаФормы.Лево);
//	//		
//	////	Элементы.ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
//	//	
//	//	//Элементы.СканироватьШтрихкод.Высота = 1;
//	//Иначе
//	//	//
//	//	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Количество, Штрихкод", "ПоложениеЗаголовка", 
//	//	//	ПоложениеЗаголовкаЭлементаФормы.Верх);
//	//	//	
//	//	//Элементы.ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
//	//	//Элементы.СканироватьШтрихкод.Высота = 2;
//	//КонецЕсли;
//	//
//КонецПроцедуры


//#КонецОбласти



//&НаКлиенте
//Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
//КонецПроцедуры

//&НаКлиенте
//Процедура НомерСтрокиДокументаПриИзменении(Элемент)
//	Попытка
//		НомерСтрокиДокумента = Формат(Число(НомерСтрокиДокумента),  "ЧЦ=10");
//	Исключение
//		Количество = 0;
//	КонецПопытки;
//	ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
//	#Если МобильноеПриложениеКлиент  Тогда
//		НачатьРедактированиеЭлемента();
//	#КонецЕсли	

//	ПозицияВвода = 2;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПровертьЗакрытиеФормы()
//		
//	Если ПозицияВвода =  3  Тогда
//		ПараметрыЗакрытия = Новый Структура;
//		ПараметрыЗакрытия.Вставить("Сохранить");
//		ПараметрыЗакрытия.Вставить("Количество", Количество);
//		ПараметрыЗакрытия.Вставить("НомерСтрокиДокумента", НомерСтрокиДокумента);
//		
//		Закрыть(ПараметрыЗакрытия);
//	КонецЕсли;

//КонецПроцедуры


//&НаКлиенте
//Процедура КоличествоПриИзменении(Элемент)
//	Попытка
//		Количество = Формат(Число(Количество),  "ЧЦ=15; ЧДЦ=3");
//		ЭтаФорма.ТекущийЭлемент  = Элементы.Готово;
//		ПозицияВвода = 3;
//		
//	Исключение
//		Количество = 0;
//	КонецПопытки;

//	
//	ПодключитьОбработчикОжидания("ПровертьЗакрытиеФормы", 0.01, Истина);
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура КоличествоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

//	ПозицияВвода = 2;
//	ЭтаФорма.ТекущийЭлемент = Элементы.Количество; 

//КонецПроцедуры

//&НаКлиенте
//Процедура НомерСтрокиДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ПозицияВвода = 1;
//	ЭтаФорма.ТекущийЭлемент = Элементы.НомерСтрокиДокумента; 
//	
//КонецПроцедуры


//////Кнопки

//&НаКлиенте
//Процедура ДобавитьЧислоСтрокой(Знач Число)
//	Если ПозицияВвода = 1 Тогда
//		
//		Если Число = "-" Тогда
//			
//			н = СтрДлина(НомерСтрокиДокумента);
//			Если н = 0 ИЛИ н = 1 Тогда
//				НомерСтрокиДокумента = 0;
//			Иначе
//				нч =   Лев(НомерСтрокиДокумента,н-1);
//				НомерСтрокиДокумента =  Формат(Число(нч),"ЧЦ=10; ЧГ=");
//			КонецЕсли;
//			
//		Иначе
//			
//			
//			Попытка
//				НомерСтрокиДокумента = Формат(Число(НомерСтрокиДокумента + Число),"ЧЦ=10; ЧГ="); 
//			Исключение
//			КонецПопытки;
//		КонецЕсли;
//		
//	ИначеЕсли ПозицияВвода = 2 Тогда
//		
//		
//		Если Число = "-" Тогда
//			
//			н = СтрДлина(Количество);
//			Если н = 0 ИЛИ н = 1 Тогда
//				Количество = 0;
//			Иначе
//				нч =   Лев(Количество,н-1);
//				Количество =  Формат(Число(нч),"ЧРД=.; ЧГ=");
//			КонецЕсли;

//			
//		ИначеЕсли Число = "0" Тогда
//			Количество = Количество +"0";
//		Иначе
//			
//			Количество = Формат(Число(Количество + Число),"ЧРД=.; ЧГ=");
//		КонецЕсли;
//		
//		ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
//		//#Если МобильноеПриложениеКлиент  Тогда
//		//	НачатьРедактированиеЭлемента();
//		//#КонецЕсли	

//	КонецЕсли;
//КонецПроцедуры


//&НаКлиенте
//Процедура КнопкаОК(Команда)
//	
//	Если ПозицияВвода = 1 Тогда
//		Попытка
//			НомерСтрокиДокумента = Формат(Число(НомерСтрокиДокумента),  "ЧЦ=10");
//		Исключение
//			Количество = 0;
//		КонецПопытки;
//		
//		ЭтаФорма.ТекущийЭлемент = Элементы.Количество;
//		
//		ПозицияВвода = 2;
//	ИначеЕсли ПозицияВвода = 2 Тогда
//		Попытка
//			Количество = Формат(Число(Количество),  "ЧЦ=15; ЧДЦ=3");
//			ЭтаФорма.ТекущийЭлемент  = Элементы.Готово;
//			ПозицияВвода = 3;
//			
//		Исключение
//			Количество = 0;
//		КонецПопытки;
//		
//	КонецЕсли;
//	ПодключитьОбработчикОжидания("ПровертьЗакрытиеФормы", 0.01, Истина);

//КонецПроцедуры


//&НаКлиенте
//Процедура КнопкаТочка(Команда)
//	
//	Если ПозицияВвода = 2 Тогда
//		Если СтрНайти(Количество,".")=0 Тогда
//			Количество = Количество +".";
//		КонецЕсли;		
//	КонецЕсли;
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура Кнопка1(Команда)
//	ДобавитьЧислоСтрокой("1");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка2(Команда)
//	ДобавитьЧислоСтрокой("2");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка3(Команда)
//	ДобавитьЧислоСтрокой("3");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка4(Команда)
//	ДобавитьЧислоСтрокой("4");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка5(Команда)
//	ДобавитьЧислоСтрокой("5");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка6(Команда)
//	ДобавитьЧислоСтрокой("6");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка7(Команда)
//	ДобавитьЧислоСтрокой("7");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка8(Команда)
//	ДобавитьЧислоСтрокой("8");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка9(Команда)
//	ДобавитьЧислоСтрокой("9");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопка0(Команда)
//	ДобавитьЧислоСтрокой("0");
//КонецПроцедуры

//&НаКлиенте
//Процедура Кнопкback(Команда)
//	ДобавитьЧислоСтрокой("-");
//КонецПроцедуры



