
#Область ПрограммныйИнтерфейс

Функция ПолучитьФабрикуXDTO(ВерсияФормата) Экспорт
	
	Фабрика = Новый ФабрикаXDTO(ПолучитьНаборСхемXML(ВерсияФормата));
	
	Возврат Фабрика;
	
КонецФункции

Функция ПолучитьURIПространстваИмен(ВерсияФормата) Экспорт
	
	Если ВерсияФормата = 1005 Тогда
		
		Возврат "http://www.digma.ua/Mobile/Exchange";
		
	КонецЕсли;
	
КонецФункции

Функция ВерсииПоддерживаемыхФорматовОбмена() Экспорт
	
	Версии = Новый Массив;
	
	Версии.Добавить(1005);
	
	Возврат Версии;
	
КонецФункции

Функция ПолучитьНаборСхемXML(ВерсияФормата) Экспорт
	
	ИмяМакета = Синхронизация.ПолучитьИмяМакетаСхемы(ВерсияФормата);
	
	Макет = ПолучитьОбщийМакет(ИмяМакета);
	ТекстСхемыXML = Макет.ТекущаяОбласть.Текст;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСхемыXML);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	ПостроительСхемы = Новый ПостроительСхемXML;
	СхемаДанныхСервиса = ПостроительСхемы.СоздатьСхемуXML(ДокументDOM);
	НаборСхем = Новый НаборСхемXML;
	НаборСхем.Добавить(СхемаДанныхСервиса);
	
	Возврат НаборСхем;
	
КонецФункции

Функция СтруктураПараметровWS() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("WSURLВебСервиса",                   ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("АдресWS"));
	СтруктураПараметров.Вставить("WSИмяПользователя",                 ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ПользовательWS"));
	СтруктураПараметров.Вставить("WSПароль",                          ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ПарольWS"));
	СтруктураПараметров.Вставить("ИдентификаторМобильногоУстройства", ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ИдентификаторУстройства"));
	СтруктураПараметров.Вставить("ВерсияПриложения",                  ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ТекущаяВерсияПриложения"));
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ИнициализацияСообщенийОшибок() Экспорт
	
	СообщенияОшибок = Новый Соответствие;
	СообщенияОшибок.Вставить(1, НСтр("ru = 'Ошибка подключения: Не указан каталог обмена информацией.'"));
	СообщенияОшибок.Вставить(2, НСтр("ru = 'Ошибка подключения: Каталог обмена информацией не существует.'"));
	
	СообщенияОшибок.Вставить(3, НСтр("ru = 'В каталоге обмена информацией не был обнаружен файл сообщения с данными.'"));
	СообщенияОшибок.Вставить(4, НСтр("ru = 'Ошибка при распаковке сжатого файла сообщения.'"));
	СообщенияОшибок.Вставить(5, НСтр("ru = 'Ошибка при сжатии файла сообщения обмена.'"));
	СообщенияОшибок.Вставить(6, НСтр("ru = 'Ошибка при создании временного каталога'"));
	СообщенияОшибок.Вставить(7, НСтр("ru = 'Архив не содержит файл сообщения обмена'"));
	
	СообщенияОшибок.Вставить(8, НСтр("ru = 'Ошибка записи файла в каталог обмена информацией. Проверьте права пользователя на доступ к каталогу.'"));
	СообщенияОшибок.Вставить(9, НСтр("ru = 'Ошибка удаления файла из каталога обмена информацией. Проверьте права пользователя на доступ к каталогу.'"));
	
	СообщенияОшибок.Вставить(21, НСтр("ru = 'Не указан или указан неверно идентификатор мобильного устройства. Проверьте параметры синхронизации.'"));
	
	СообщенияОшибок.Вставить(22, НСтр("ru = 'Доступ запрещен, данные очищены.'"));
	СообщенияОшибок.Вставить(23, НСтр("ru = 'Ошибка подключения. Проверьте параметры синхронизации.'"));
	СообщенияОшибок.Вставить(24, НСтр("ru = 'Ошибка авторизации. Проверьте логин/пароль.'"));
	СообщенияОшибок.Вставить(25, НСтр("ru = 'Ошибка подключения. Проверьте подключение к сервису'"));
	СообщенияОшибок.Вставить(26, НСтр("ru = 'Ошибка подключения. Запрашиваемый ресурс не найден'"));
	Возврат СообщенияОшибок;
	
КонецФункции

Функция ИмяВременногоФайлаФлага() Экспорт
	
	Возврат "flag.tmp";
	
КонецФункции

Функция НедопустимыеСимволыВИмениПользователяWSПрокси() Экспорт
	
	Возврат ":";
	
КонецФункции


Функция УзелЦентральной()Экспорт
	Возврат ПланыОбмена.МобильноеПриложение.НайтиПоКоду("001");
КонецФункции

Функция ТекущийУзел()Экспорт
	Возврат ПланыОбмена.МобильноеПриложение.ЭтотУзел();
КонецФункции



#КонецОбласти



