// ПодключаемоеОборудование
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
// Конец ПодключаемоеОборудование

//Перем глВКRSDriver Экспорт;

#Область ОбработчикиСобытий

Процедура ПриНачалеРаботыСистемы()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование   
	
	ОбщегоНазначенияКлиент.УстановитьРасширенныйЗаголовокПриложения();   
	#Если МобильноеПриложениеКлиент Тогда
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений("ПриПолученииПуша"); 
		ПодключитьОбработчикОжидания("Подключаемый_ПолучитьДанныеДоставкиПослеПаузы", 5, Истина);
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	// Передать на обработку данные.
	МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия);
	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	ОбщегоНазначенияКлиент.ПередНачаломРаботыСистемы(Отказ);
	
КонецПроцедуры

Процедура Подключаемый_НастроитьРежимСинхронизации() Экспорт
	
	ПараметрыФормы = Новый Структура("ПервыйЗапуск", Истина);
	ОткрытьФорму("Обработка.НастройкиПриложения.Форма.РежимСинхронизации", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


Процедура Подключаемый_ПолучитьДанныеДоставкиПослеПаузы() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		  ИнтеграцияТК_Клиент.ВыполнитьРегистрациюТокена();			
	#КонецЕсли

КонецПроцедуры   

Процедура ПриПолученииПуша(Уведомление, Локальное, Показать) Экспорт
	// Сюда приложение зайдет, когда придет уведомление
КонецПроцедуры





#КонецОбласти