
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.ОформитьСуммовыеПоля(ЭтаФорма, "СуммаДокумента, ОплатыСумма");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "НачалоКассовойСмены, ОкончаниеКассовойСмены", "ФорматРедактирования",
		ЗначениеНастроекПовтИсп.ФорматДатыВремяИДата());
	
	НастроитьВидимостьКнопкиПометитьКВыгрузке();
	ОбновитьЗаписиПоСтрокамТЧ();
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	ИначеЕсли ИмяСобытия = "ИзмененОтчетОПродажах" Тогда
		
		ЭтаФорма.Прочитать();
		НастроитьВидимостьКнопкиПометитьКВыгрузке();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьКВыгрузке(Команда)
	
	ПродажиКлиент.ПометитьКВыгрузкеОтчетОПродажах(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьВидимостьКнопкиПометитьКВыгрузке()
	
	Элементы.ПометитьКВыгрузке.Видимость = Объект.СтатусОбмена = Перечисления.СтатусыОбмена.Синхронизирован;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписиПоСтрокамТЧ()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ОбновитьЗаписьПоСтроке(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьПоСтроке(Знач СтрокаТЧ)
	
	ЗаписьПоСтроке = НСтр("ru = '%Количество%%ЕдИзм% Х %Цена% = %Сумма%'");
	
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%", Формат(СтрокаТЧ.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ЕдИзм%",      Строка(СтрокаТЧ.Номенклатура.ЕдиницаИзмерения));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Цена%",       Формат(СтрокаТЧ.Цена, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Сумма%",      Формат(СтрокаТЧ.Сумма, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	
	НДС = НСтр("ru = '%СтавкаНДС%%СуммаНДС%'");
	
	Если СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		НДС = СтрЗаменить(НДС, "%СтавкаНДС%", СтрокаТЧ.СтавкаНДС);
		НДС = СтрЗаменить(НДС, "%СуммаНДС%", "");
	Иначе
		НДС = СтрЗаменить(НДС, "%СтавкаНДС%", НСтр("ru = 'НДС'") + " " + СтрокаТЧ.СтавкаНДС);
		НДС = СтрЗаменить(НДС, "%СуммаНДС%",  " = " + Формат(СтрокаТЧ.СуммаНДС, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	КонецЕсли;
	
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%НДС%", НДС);
	
	СтрокаТЧ.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;
	СтрокаТЧ.ТоварыЗаписьПоСтрокеНДС = НДС;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры


#КонецОбласти
