
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, ДополнительныеПараметры) Экспорт
	
	ВводитьАкцизныеМарки = Ложь;
	ПродажиКлиент.ПолучитьНоменклатуруПоШтрихкоду(ПолученныйШтрихкод, ДополнительныеПараметры, ВводитьАкцизныеМарки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученнуюПоШтрихкодуНоменклатуру(ДанныеНоменклатуры, ДополнительныеПараметры) Экспорт
	
	ИдентификаторСтроки = ОпределитьСтрокуЧека(ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.Цена);
	
	ЗаполнитьСтрокуЧека(ИдентификаторСтроки, ДанныеНоменклатуры);
	
	ПодсветитьСтроку(ИдентификаторСтроки);
	
	ОткрытьДиалогВводаШтрихкода();
	
КонецПроцедуры

// Возникает при сканировании внутренней камерой устройства
//
&НаКлиенте
Процедура ОбработкаЗакрытияСканирования(ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверку()
	  Возврат ПроверитьЗаполнение();
КонецФункции


#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьСкидкиНаценки = ЗначениеНастроекПовтИсп.ИспользуютсяСкидкиНаценки();
	
	НастроитьФормуПоЗначениямНастроек();
	ОбщегоНазначения.ОформитьСуммовыеПоля(ЭтаФорма, "Сумма, СуммаНДС");
	
	ОбщегоНазначения.УстановитьЦветИтоговыхПолей(ЭтаФорма, "Сумма, СуммаНДС");
	
	СписокКнопок = "ПодборТоваров, СканированиеШтрихкода";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "ЦветРамки", ЦветаСтиля.ЦветФонаФормы);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОпределитьЧекПоЗаказу();
		
	Иначе
		
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Заказ: Новый'");
		
		УстановитьНовыйНомер();
		Объект.НомерЗаказа = Объект.Номер;
		
		ОдинДень = 86400;
		Объект.ЖелаемаяДатаПокупки = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату() + ОдинДень;
		
	КонецЕсли;
	
	Если Параметры.Свойство("СозданиеПослеСканирования") И Параметры.СозданиеПослеСканирования Тогда
		
		УстановитьСтраницуТовары();
		
		Для Каждого ДанныеНоменклатуры Из Параметры.МассивНоменклатуры Цикл
			
			ИдентификаторСтроки = ОпределитьСтрокуЧека(ДанныеНоменклатуры.Номенклатура);
			
			ЗаполнитьСтрокуЧека(ИдентификаторСтроки, ДанныеНоменклатуры);
		КонецЦикла;
		
		ИдетПроцессСканирования = Истина;
		
	ИначеЕсли Параметры.Свойство("СозданиеИзПодбора") И Параметры.СозданиеИзПодбора Тогда
		
		УстановитьСтраницуТовары();
		ПодборТоваровСервер(Параметры.АдресВоВременномХранилище);
		
	КонецЕсли;
	
	НастроитьВидимостьПоСтатусу();
	ОбновитьЗаписиПоСтрокамТЧ();
	
	УстановитьДоступностьЭлементовСинхронизация();
	
	// скидка на заказ
	РассчитатьСкидкуНаценкуПоДокументу();
	ОбновитьОтображениеСкидкиНаДокумент();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОткрытьДиалогВводаШтрихкода();
	
	//ОбновитьПредставлениеАдреса();
	
	// телефония
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(
		ЭтаФорма,
		"Позвонить",
		"Видимость",
		ДоступенНаборНомера()
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		
		НастроитьФормуПоЗначениямНастроек();
		
	ИначеЕсли ИмяСобытия = "ЗаписанЧек" Тогда
		
		ОпределитьЧекПоЗаказу();
		
		Если Параметр = ЧекПоЗаказу Тогда
			
			ЭтаФорма.Прочитать();
			ОбновитьЗаписиПоСтрокамТЧ();
			
		КонецЕсли;
		
		НастроитьВидимостьПоСтатусу();
		
	КонецЕсли;
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		Если НЕ ТоварыТолькоПросмотр Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
			ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСтроки = ПолучитьПараметрыСтроки();
	
	Если НЕ ПараметрыСтроки = Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ПараметрыСтроки.ИдентификаторСтроки);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеИзменитьСтроку", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.РедактированиеСтроки", ПараметрыСтроки, ЭтаФорма,,,,ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТоварыВыбор(Элемент,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаСкидкиНаценкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если СуммаБезСкидки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СкидкаНаценкаПроцент",  СкидкаНаценкаНаЗаказПроцент);
	ПараметрыФормы.Вставить("СкидкаНаценкаСумма",    СкидкаНаценкаНаЗаказСумма);
	ПараметрыФормы.Вставить("СуммаБезСкидкиНаценки", СуммаБезСкидки);
	ПараметрыФормы.Вставить("ЗаголовокДокумента",    НСтр("ru = 'заказ'"));
	ПараметрыФормы.Вставить("ТолькоПросмотрФормы",   ТоварыТолькоПросмотр);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриИзмененииСкидкиНаЗаказЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеСкидки", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор,,,ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЧек(Команда)
	
	Если Объект.Товары.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Товары не заполнены'"));
		Возврат;
	КонецЕсли;
	
	Если Модифицированность ИЛИ Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаписатьДокумент(Ложь);
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Основание", Объект.Ссылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыЧека", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Чек.ФормаОбъекта", ДанныеЗаполнения, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
		
	ЗаписатьДокумент(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВРаботе(Команда)
	ЗаписатьДокумент(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СканированиеШтрихкода(Команда)
	
	ИдетПроцессСканирования = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТоваров(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Укажите Контрагента и договор'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

		Возврат;
	КонецЕсли;
	
	
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеПодборТоваров", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", "ПодборВЗаказКлиента");
	
	ОткрытьФорму("Обработка.ПодборТоваров.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьАдресНаКарте(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Данные = Новый Структура;
		Данные.Вставить("Город", Объект.АдресДоставкиГород);
		Данные.Вставить("Улица", Объект.АдресДоставкиУлица);
		Данные.Вставить("Дом ",  Объект.АдресДоставкиДом);
		
		МестоположениеПоАдресу = ПолучитьМестоположениеПоАдресу(Новый ДанныеАдреса(Данные));
		
		Если НЕ МестоположениеПоАдресу = Неопределено Тогда
			ПоказатьНаКарте(МестоположениеПоАдресу);
		КонецЕсли;
		
	#Иначе
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Позвонить(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Телефон) Тогда
			Возврат;
		КонецЕсли;
		
		ВызватьСразу = Ложь;
		СредстваТелефонии.НабратьНомер(Объект.Телефон, ВызватьСразу);
		
	#Иначе
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдрес(Команда)
	//
	//СтандартнаяОбработка = Ложь;
	//
	//ОписаниеОповещения = Новый ОписаниеОповещения("АдресДоставкиЗавершениеРедактирования", ЭтотОбъект);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Заголовок",  НСтр("ru = 'Адрес доставки'"));
	//ПараметрыФормы.Вставить("Город",    Объект.АдресДоставкиГород);
	//ПараметрыФормы.Вставить("Дом",      Объект.АдресДоставкиДом);
	//ПараметрыФормы.Вставить("Квартира", Объект.АдресДоставкиКвартира);
	//ПараметрыФормы.Вставить("Подъезд",  Объект.АдресДоставкиПодъезд);
	//ПараметрыФормы.Вставить("Улица",    Объект.АдресДоставкиУлица);
	//ПараметрыФормы.Вставить("Этаж",     Объект.АдресДоставкиЭтаж);
	//ПараметрыФормы.Вставить("Этаж",     Объект.АдресДоставкиЭтаж);
	//ПараметрыФормы.Вставить("ТолькоПросмотрФормы", Объект.ЗагруженПриОбмене);
	//
	//ОткрытьФорму("ОбщаяФорма.РедактированиеАдреса", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
	//
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылкуНаЧек(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ЧекПоЗаказу);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыЧека", ЭтотОбъект);
	
	ОткрытьФорму("Документ.Чек.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьEmail(Команда)
	
	Если ПустаяСтрока(Объект.АдресЭлектроннойПочты) Тогда
		Возврат;
	КонецЕсли;
	
	СоответствуетТребованиям = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Объект.АдресЭлектроннойПочты, Истина);
	
	Если НЕ СоответствуетТребованиям Тогда
		
		ОчиститьСообщения();
		Сообщение = НСтр("ru = 'Почтовый адрес заполнен неверно.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		
		Возврат;
	КонецЕсли;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		СтруктураПисьма = ПолучитьСтруктуруПисьма();
		
		Получатели = Новый Массив;
		Получатели.Добавить(Объект.АдресЭлектроннойПочты);
		
		РаботаСПочтойКлиент.ОтправитьЭлектронноеПисьмо(СтруктураПисьма, Получатели);
		
	#Иначе
		
		ОчиститьСообщения();
		ТекстСообщения = НСтр("ru = 'Операция доступна только из мобильного приложения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьСканер(Команда)
	
	ПодключаемоеОборудованиеКлиент.ИнициализироватьАсинхронныйСканер(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СкидкаНаДокумент

&НаКлиенте
Процедура ПриИзмененииСкидкиНаЗаказЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	СкидкаНаценкаНаЗаказСумма   = Результат.СкидкаНаценкаСумма;
	СкидкаНаценкаНаЗаказПроцент = Результат.СкидкаНаценкаПроцент;
	
	НазначитьСкидкуНаЗаказ();
	
КонецПроцедуры

&НаСервере
Процедура НазначитьСкидкуНаЗаказ()
	
	ОбновитьОтображениеСкидкиНаДокумент();
	
	Продажи.НазначитьСкидкуНаДокумент(Объект, "Товары", СкидкаНаценкаНаЗаказСумма);
	//
	//Для Каждого СтрокаЧека Из Объект.Товары Цикл
	//	РассчитатьНДССтрокиЧека(СтрокаЧека);
	//КонецЦикла;
	
	ОбновитьЗаписиПоСтрокамТЧ();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеСкидкиНаДокумент()
	
	Если НЕ ИспользоватьСкидкиНаценки Тогда
		Возврат;
	КонецЕсли;
	
	Если СкидкаНаценкаНаЗаказСумма <= 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"СуммаСкидкиНаценки", "Заголовок",
			НСтр("ru = 'Скидка'")
		);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			"СуммаСкидкиНаценки", "Заголовок",
			НСтр("ru = 'Наценка'")
		);
		
	КонецЕсли;
	
	ШаблонЗначенияСкидки = НСтр("ru = '%1 (%2%)'");
	
	СуммаСкидкиНаценки = ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗначенияСкидки,
		Формат(?(СкидкаНаценкаНаЗаказСумма < 0,   - СкидкаНаценкаНаЗаказСумма,   СкидкаНаценкаНаЗаказСумма),   ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()),
		Формат(?(СкидкаНаценкаНаЗаказПроцент < 0, - СкидкаНаценкаНаЗаказПроцент, СкидкаНаценкаНаЗаказПроцент), ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей())
	);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСкидкуНаценкуПоДокументу()
	
	Если НЕ ИспользоватьСкидкиНаценки Тогда
		Возврат;
	КонецЕсли;
	
	СкидкаНаценкаНаЗаказСумма = Объект.Товары.Итог("СкидкаНаценкаСумма");
	
	СуммаБезСкидки = Объект.Товары.Итог("СуммаБезСкидки");
	
	Если НЕ СуммаБезСкидки = 0 Тогда
		СкидкаНаценкаНаЗаказПроцент = СкидкаНаценкаНаЗаказСумма * 100 / СуммаБезСкидки;
	Иначе
		СкидкаНаценкаНаЗаказПроцент = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОчиститьНомерСтрокиДляПодсветки()
	
	НомерСтрокиДляПодсветки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсветитьСтроку(ИдентификаторСтроки)
	
	СтрокаТоваров = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если НЕ СтрокаТоваров = Неопределено Тогда
		НомерСтрокиДляПодсветки = СтрокаТоваров.НомерСтроки;
		Элементы.Товары.ТекущаяСтрока = ИдентификаторСтроки;
		
		ИнтервалСек = 1;
		ПодключитьОбработчикОжидания("Подключаемый_ОчиститьНомерСтрокиДляПодсветки", ИнтервалСек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруПисьма()
	
	СтруктураПисьма = РаботаСПочтойКлиент.СтруктураПисьмаОтчета();
	
	СтруктураПисьма.ТемаПисьма  = ПолучитьТемуПисьма();
	СтруктураПисьма.ТекстПисьма = "";
	
	Возврат СтруктураПисьма;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТемуПисьма()
	
	ШаблонТемыПисьма = НСтр("ru = 'Заказ %Номер% от %Дата%'");
	
	ТемаПисьма = СтрЗаменить(ШаблонТемыПисьма, "%Номер%", ОбщегоНазначенияКлиентСервер.ПредставлениеНомера(Объект.НомерЗаказа));
	ТемаПисьма = СтрЗаменить(ТемаПисьма, "%Дата%", Формат(Объект.Дата, "ДФ=dd.MM.yyyy; ДЛФ=D"));
	
	Возврат ТемаПисьма;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыЧека(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		Оповестить("ЗаписанЗаказ", Объект.Ссылка); // для подсветки в списке
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтраницуТовары()
	
	Элементы.СтраницыПролистывания.ТекущаяСтраница = Элементы.СтраницаТовары;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДиалогВводаШтрихкода(ДляЛюбогоТипаСканера = Ложь)
	
	Если ДляЛюбогоТипаСканера Тогда
		
		Если ИдетПроцессСканирования Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьШтрихкод", 0.1, Истина);
		КонецЕсли;
		
	Иначе
		
		Если ИдетПроцессСканирования И ЗначениеНастроекВызовСервераПовтИсп.СканированиеВнешнимСканером() Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ПолучитьШтрихкод", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьСтрокуЧека(Номенклатура, Цена = Неопределено)
	
	НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		СтрокаЧека = Объект.Товары.Добавить();
		
	Иначе
		СтрокаЧека = Неопределено;
		
		// количество суммируется только если не введена скидка
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			Если Строка.СкидкаНаценкаСумма = 0 Тогда
				
				Если НЕ Цена = Неопределено Тогда
					Если НЕ Строка.Цена = Цена Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаЧека = Строка;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаЧека = Неопределено Тогда
			СтрокаЧека = Объект.Товары.Добавить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаЧека.ПолучитьИдентификатор();
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьДокумент(ГотовКОбмену)
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи, ГотовКОбмену", РежимЗаписиДокумента.Проведение,ГотовКОбмену);
	
	//	ОбновитьЗаписиПоСтрокамТЧ();
	Если Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.Записать();
	КонецЕсли;
	
	Попытка
		Успешно = Записать(ПараметрыЗаписи);
		Модифицированность = Ложь;
		Если Успешно Тогда 

			Оповестить("ЗаписанЗаказ", Объект.Ссылка);
			Закрыть();
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьОбОшибке(ОписаниеОшибки());
		
	КонецПопытки;
	
	//АвтоЗаголовок = Истина;
	//Заголовок = НСтр("ru = 'Заказ'");
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УстановитьСтатусыДокументаПередЗаписью(ПараметрыЗаписи);
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьЗаписиПоСтрокамТЧ();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьСтатусыДокументаПередЗаписью(ПараметрыЗаписи)
	ГотовКОбмену = Неопределено;
	ПараметрыЗаписи.Свойство("ГотовКОбмену",ГотовКОбмену);
	
	
	Если ГотовКОбмену = Истина Тогда
	    Объект.СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.ГотовКОбмену");
	Иначе
		Объект.СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.ВРаботе");
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОповещениеПодборТоваров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодборТоваровСервер(Результат.АдресВоВременномХранилище);
	
КонецПроцедуры

&НаСервере
Процедура ПодборТоваровСервер(АдресВоВременномХранилище)
	
	ТаблицаПодбор = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Для Каждого СтрокаПодбора Из ТаблицаПодбор Цикл
		
		ИдентификаторСтроки = ОпределитьСтрокуЧека(СтрокаПодбора.Номенклатура, СтрокаПодбора.Цена);
		
		ЗаполнитьСтрокуЧека(ИдентификаторСтроки, СтрокаПодбора);
		
	КонецЦикла;
	
	Если ИспользоватьСкидкиНаценки Тогда
		РассчитатьСкидкуНаценкуПоДокументу();
		ОбновитьОтображениеСкидкиНаДокумент();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолучитьШтрихкод()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеИзменитьСтроку(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = ДополнительныеПараметры.ИдентификаторСтроки;
	СтрокаТаблицы = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Результат.Свойство("УдалитьСтроку") Тогда
		
		ИндексСтроки = Объект.Товары.Индекс(СтрокаТаблицы);
		Объект.Товары.Удалить(ИндексСтроки);
		
		Модифицированность = Истина;
		
	ИначеЕсли Результат.Свойство("Сохранить") Тогда
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Результат);
		
		ОбновитьЗаписьПоСтроке(,ИдентификаторСтроки);
		
		Модифицированность = Истина;
		ПодсветитьСтроку(ИдентификаторСтроки);
	КонецЕсли;
	
	Если ИспользоватьСкидкиНаценки Тогда
		РассчитатьСкидкуНаценкуПоДокументу();
		ОбновитьОтображениеСкидкиНаДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьПоСтатусу()
	
	УстановитьДоступностьРедактированияТоваров();
	
	Если Объект.СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.Отправлен Тогда
		
		СписокЭлементов = "РеглУчет,Покупатель,Договор,АдресДоставки,ЖелаемаяДатаПокупки,НомерЗаказа,Дата";
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокЭлементов, "Доступность", Ложь);

		УстановитьТолькоПросмотрТоваров();
		Элементы.СтатусЗаказа.СписокВыбора.Добавить(Перечисления.СтатусыЗаказовКлиентов.Отправлен, НСтр("ru = 'Отправлен'"));
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"СтатусЗаказа",
		"ТолькоПросмотр",
		Объект.СтатусЗаказа = Перечисления.СтатусыЗаказовКлиентов.Отправлен
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГруппаЧекПоЗаказу", "Видимость",
		ЗначениеЗаполнено(ЧекПоЗаказу)
	);
	//
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "СоздатьЧек", "Видимость",
	//	НЕ ЗначениеЗаполнено(ЧекПоЗаказу)
//	);
	
	//Если ЗначениеЗаполнено(ЧекПоЗаказу) Тогда
	//	СформироватьЗаголовокГиперссылкиЧека();
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотрТоваров()
	
	ТоварыТолькоПросмотр = Истина;
	
	СписокКнопок = "ПодборТоваров, СканированиеШтрихкода";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРедактированияТоваров()
	
	ТоварыТолькоПросмотр = Ложь;
	
	СписокКнопок = "ПодборТоваров, СканированиеШтрихкода";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, СписокКнопок, "Видимость", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"СканированиеШтрихкода",
		"Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров() И НЕ ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписьПоСтроке(Знач Строка, ИдентификаторСтроки = Неопределено)
	
	Если НЕ ИдентификаторСтроки = Неопределено Тогда
		СтрокаТЧ = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Иначе
		СтрокаТЧ = Строка;
	КонецЕсли;
	
	ЗаписьПоСтроке = НСтр("ru = '%Количество% Х %ЕдИзм% Х %Цена%%Скидка% = %Сумма%'");
	
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Количество%", Формат(СтрокаТЧ.Количество, ЗначениеНастроекПовтИсп.ФорматКоличественныхПолей()));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%ЕдИзм%",      "Коф. " +Строка(СтрокаТЧ.Номенклатура.КоличествоЕденицОсновной));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Цена%",       Формат(СтрокаТЧ.Цена, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Сумма%",      Формат(СтрокаТЧ.Сумма, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
	
	// Скидка
	СкидкаНаценкаСумма = СтрокаТЧ.СкидкаНаценкаСумма;
	Если ЗначениеЗаполнено(СкидкаНаценкаСумма) Тогда
		
		СкидкаНаценкаПроцент = СтрокаТЧ.СкидкаНаценкаПроцент;
		Если ЗначениеЗаполнено(СкидкаНаценкаПроцент) Тогда
			
			ЗаписьСкидкаНаценка = НСтр("ru = '%Знак% %СкидкаНаценкаСумма% (%Процент%%)'");
			Процент = ?(СкидкаНаценкаПроцент > 0, СкидкаНаценкаПроцент, -СкидкаНаценкаПроцент);

			ЗаписьСкидкаНаценка = СтрЗаменить(ЗаписьСкидкаНаценка, "%Процент%", Процент);
		Иначе
			
			ЗаписьСкидкаНаценка = НСтр("ru = '%Знак% %СкидкаНаценкаСумма%'");
		КонецЕсли;
		
		СкидкаСумма = ?(СкидкаНаценкаСумма > 0, СкидкаНаценкаСумма, - СкидкаНаценкаСумма);
		Знак = ?(СкидкаНаценкаСумма > 0, "+", "-");
		
		ЗаписьСкидкаНаценка = СтрЗаменить(ЗаписьСкидкаНаценка, "%Знак%", Знак);
		ЗаписьСкидкаНаценка = СтрЗаменить(ЗаписьСкидкаНаценка, "%СкидкаНаценкаСумма%", Формат(СкидкаСумма, ОбщегоНазначенияПовтИсп.ФорматСуммовыхПолей()));
		
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Скидка%", " " + ЗаписьСкидкаНаценка);
	Иначе
		ЗаписьПоСтроке = СтрЗаменить(ЗаписьПоСтроке, "%Скидка%", "");
	КонецЕсли;
	
	СтрокаТЧ.ТоварыЗаписьПоСтроке = ЗаписьПоСтроке;
	
	СтрокаТЧ.СуммаБезСкидки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
	
КонецПроцедуры

//&НаСервере
//Процедура РассчитатьНДССтрокиЧека(СтрокаЧека)
//	
//	Если Объект.ЦенаВключаетНДС Тогда
//		ПроцентНДС = ЦенообразованиеКлиентСерверПовтИсп.ПолучитьСтавкуНДСЧислом(СтрокаЧека.СтавкаНДС);
//		СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаЧека.Сумма, ПроцентНДС);
//	КонецЕсли;
//	
//	СтрокаЧека.СуммаНДС  = СуммаНДС;
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуЧека(ИдентификаторСтроки, ДанныеНоменклатуры, ОчищатьСуществующиеМарки = Истина)
	
	СтрокаЧека = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Номенклатура = ДанныеНоменклатуры.Номенклатура;
	
	СтрокаЧека.Номенклатура = Номенклатура;
	//ЗаполнитьЗначенияСвойств(СтрокаЧека, Номенклатура,"Цена");
	
	Если НЕ ДанныеНоменклатуры.Цена = Неопределено Тогда
		СтрокаЧека.Цена = ДанныеНоменклатуры.Цена;
	КонецЕсли;
	
	Если ДанныеНоменклатуры.Количество = Неопределено Тогда
		
		СтрокаЧека.Количество = СтрокаЧека.Количество + 1;
	Иначе
		
		СтрокаЧека.Количество = СтрокаЧека.Количество + ДанныеНоменклатуры.Количество;
	КонецЕсли;
	
	СтрокаЧека.Сумма = СтрокаЧека.Цена * СтрокаЧека.Количество;
	
	//РассчитатьНДССтрокиЧека(СтрокаЧека);
	
	ОбновитьЗаписьПоСтроке(СтрокаЧека);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаписиПоСтрокамТЧ()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		ОбновитьЗаписьПоСтроке(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыСтроки()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ИдентификаторСтроки", ТекущиеДанные.ПолучитьИдентификатор());
	СтруктураПараметров.Вставить("НомерСтроки",         ТекущиеДанные.НомерСтроки);
	СтруктураПараметров.Вставить("Номенклатура",        ТекущиеДанные.Номенклатура);
	СтруктураПараметров.Вставить("Количество",          ТекущиеДанные.Количество);
	СтруктураПараметров.Вставить("Цена",                ТекущиеДанные.Цена);
	СтруктураПараметров.Вставить("СтавкаНДС",           ТекущиеДанные.СтавкаНДС);
	СтруктураПараметров.Вставить("Сумма",               ТекущиеДанные.Сумма);
	СтруктураПараметров.Вставить("СуммаНДС",            ТекущиеДанные.СуммаНДС);
	СтруктураПараметров.Вставить("СкидкаНаценкаПроцент",ТекущиеДанные.СкидкаНаценкаПроцент);
	СтруктураПараметров.Вставить("СкидкаНаценкаСумма",  ТекущиеДанные.СкидкаНаценкаСумма);

	СтруктураПараметров.Вставить("ЦенаВключаетНДС",     Объект.ЦенаВключаетНДС);
	
	Если Объект.СтатусЗаказа    = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Отправлен")
		ИЛИ ТоварыТолькоПросмотр Тогда
		
		СтруктураПараметров.Вставить("ТолькоПросмотрФормы", Истина);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
КонецФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ИспользуетсяАсинхронныйСканер = ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяАсинхронныйСканерШтрихкодов();
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбщегоНазначения.УстановитьЖирныйШрифтПолей(ЭтаФорма, "Сумма");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(
		ЭтаФорма, 
		"СканированиеШтрихкода", 
		"Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ОтображатьКомандуСканированияШтрихкодаТоваров()
		И НЕ ИспользуетсяАсинхронныйСканер
	);
	
	ОбщегоНазначения.УстановитьВысотуПоляНаименованиеТовара(ЭтаФорма, "ТоварыНоменклатура");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
		"ГруппаСкидкаНаценка",
		"Видимость",
		ИспользоватьСкидкиНаценки
	);
	
	НастроитьЭлементыАсинхронногоСканера();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

&НаКлиенте
Функция ДоступенНаборНомера() Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Возврат СредстваТелефонии.ПоддерживаетсяНаборНомера();
		
	#Иначе
		
		Возврат Истина;
		
	#КонецЕсли
	
КонецФункции

&НаСервере
Процедура УстановитьНовыйНомер()
	
	ЗаказОбъект = РеквизитФормыВЗначение("Объект");
	ЗаказОбъект.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ЗаказОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьЧекПоЗаказу()
	
	ЧекПоЗаказу = Документы.ЗаказКлиента.ПолучитьЧекПоЗаказуКлиента(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаголовокГиперссылкиЧека()
	
	ПредставлениеЧека = Документы.Чек.ПолучитьПредставлениеЧека(ЧекПоЗаказу);
	
	ТекстЗаголовка = НСтр("ru = 'Продажа: %ПредставлениеЧека%'");
	ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ПредставлениеЧека%", ПредставлениеЧека);
	
	Элементы.ОткрытьСсылкуНаЧек.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовСинхронизация()
	
	Если Объект.ЗагруженПриОбмене Тогда
		
		СписокЭлементовСведенияТолькоПросмотр = "СтатусЗаказа, Контрагент, Телефон, АдресЭлектроннойПочты, ЖелаемаяДатаПокупки, НомерЗаказа, Дата";
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			СписокЭлементовСведенияТолькоПросмотр,
			"ТолькоПросмотр",
			Истина
		);
		
		УстановитьТолькоПросмотрТоваров();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
	ГоризонтальнаяОриентацияЭкрана = ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана;
	
	СписокПолей = "СтатусЗаказа, Покупатель, Телефон, АдресЭлектроннойПочты, ЖелаемаяДатаПокупки, НомерЗаказа, Дата";
	
	Если ПараметрыСеанса.ГоризонтальнаяОриентацияЭкрана Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			СписокПолей,
			"ПоложениеЗаголовка",
			ПоложениеЗаголовкаЭлементаФормы.Лево
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			СписокПолей,
			"ГоризонтальноеПоложение",
			ГоризонтальноеПоложениеЭлемента.Право
		);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			СписокПолей,
			"ПоложениеЗаголовка",
			ПоложениеЗаголовкаЭлементаФормы.Верх
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма,
			СписокПолей,
			"ГоризонтальноеПоложение",
			ГоризонтальноеПоложениеЭлемента.Лево
		);
	
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

