
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЗначенияНастроек" Тогда
		НастроитьФормуПоЗначениямНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтчетПоКассовойСмене(Команда)
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоКассовойСмене",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Продажи(Команда)
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоПродажам",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналПродажиАлкогольнойПродукции(Команда)
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ЖурналПродажиАлкогольнойПродукции",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГеолокацияЧеков(Команда)
	
	ОткрытьФорму("Обработка.Отчеты.Форма.ОтчетПоГеолокацииЧеков",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПолучателейОтчетов(Команда)
	ОткрытьФорму("РегистрСведений.ПолучателиОтчетовПоПочте.ФормаСписка",, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ЖурналПродажиАлкогольнойПродукции", "Видимость",
		ЗначениеНастроекПовтИсп.ИспользуетсяАлкогольнаяПродукция());
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "ГеолокацияЧеков", "Видимость",
		ЗначениеНастроекВызовСервераПовтИсп.ИспользуетсяГеолокация());

КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана 

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти
