
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "КоличествоСтикеров", "Видимость",
		Параметры.Свойство("ВводКоличества"));
   КоличествоСтикеров = 1;
	
	НастроитьФормуПоЗначениямНастроек();
КонецПроцедуры



&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОпределитьДоступностьКнопкиСканирования();
	НастроитьЭлементыАсинхронногоСканера();
 	
КонецПроцедуры  


 &НаСервере
Процедура НастроитьЭлементыАсинхронногоСканера()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "АктивироватьСканер", "Видимость", 
		ИспользуетсяАсинхронныйСканер
	);
	
КонецПроцедуры

 &НаСервере
Процедура ОпределитьДоступностьКнопкиСканирования()
	
	ЕстьОборудованиеСканирования = ЗначениеЗаполнено(ЗначениеНастроекВызовСервераПовтИсп.ТипУстройстваСканирования());
	ВидимостьКнопкиСканирования = Истина;	
	
	#Если МобильноеПриложениеКлиент ИЛИ МобильныйКлиент Тогда
		ВидимостьКнопкиСканирования = Ложь;
	#КонецЕсли    
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Доступность",
	ЕстьОборудованиеСканирования И НЕ ИспользуетсяАсинхронныйСканер	);
	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма, "Сканировать", "Видимость", ВидимостьКнопкиСканирования);

КонецПроцедуры   









&НаКлиенте
Процедура Сканировать(Команда)
	
	ИдетПроцессСканирования = Истина;
	ОткрытьДиалогСканирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСканирования()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПотоковоеСканирование");
	ДополнительныеПараметры.Вставить("ЗаголовокСканирования", НСтр("ru = 'Считайте штрих-код'"));
	ДополнительныеПараметры.Вставить("ИмяОбработчикаЗакрытияСканирования", "ОбработкаЗакрытияСканирования");
	
	ПодключаемоеОборудованиеКлиент.ПолучитьШтрихкод(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ПодключаемоеОборудованиеКлиент.ЭтоОповещениеСканераШтрихкода(ИмяСобытия) И ВводДоступен() Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", ЭтаФорма);
		ОбработатьПолученныйШтрихкод(Параметр, ДополнительныеПараметры);   
		
	КонецЕсли;	

КонецПроцедуры


&НаКлиенте
Процедура ОбработатьПолученныйШтрихкод(ПолученныйШтрихкод, Параметры) Экспорт
	
	Если ПустаяСтрока(ПолученныйШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ВладелецФормы.ПроверитьПринтерПечати(ПолученныйШтрихкод);
	Если ПустаяСтрока(Результат.ТекстОшибки) И Результат.ПринтерРабочий Тогда
		Элементы.ДекорацияСообщение.Заголовок = ""; 
		
		Закрыть(Новый Структура("ИД_Принтер,КоличествоСтикеров",ПолученныйШтрихкод,КоличествоСтикеров));
	Иначе
		Элементы.ДекорацияСообщение.Заголовок = Результат.ТекстОшибки;
	КонецЕсли;
	
	
			
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	СтандартнаяОбработка = ЛожЬ;
	Закрыть(Неопределено);
КонецПроцедуры

