
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФормуПоЗначениямНастроек();
	
	НастроитьФормуПоАдминистративномуРежиму();
	
	// ОриентацияЭкрана
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(УстановленныйПароль) Тогда
		ПроверяемыеРеквизиты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	
	// ОриентацияЭкрана
	ПриИзмененииПараметровЭкранаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Включить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Пароль = УстановленныйПароль Тогда
		
		ИзменитьАдминистративныйРежим(Истина);
		
	Иначе
		ТекстСообщения = НСтр("ru = 'Введен неверный пароль'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Оповестить("ИзмененАдминистративныйРежим");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Выключить(Команда)
	
	ИзменитьАдминистративныйРежим(Ложь);
	
	Оповестить("ИзмененАдминистративныйРежим");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПароль(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеУстановкаПароля", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.УстановкаПароля",,ЭтаФорма,,,,Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуПоЗначениямНастроек()
	
	ОбщегоНазначения.УстановитьШрифт(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоАдминистративномуРежиму()
	
	АдминистративныйРежим = ПараметрыСеанса.АдминистративныйРежим;
	
	Элементы.Включить.Видимость                   = НЕ АдминистративныйРежим;
	Элементы.Выключить.Видимость                   = АдминистративныйРежим;
	
	ОтобразитьСкрытьВводПароля();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьАдминистративныйРежим(Флаг)
	
	ОбщегоНазначения.ИзменитьАдминистративныйРежим(Флаг);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеУстановкаПароля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "УстановленПароль" Тогда
		ОтобразитьСкрытьВводПароля();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСкрытьВводПароля()
	
	ПарольАдминистративногоРежима = Константы.ПарольАдминистративногоРежима.Получить();
	УстановленныйПароль = ПарольАдминистративногоРежима;
	
	Если ЗначениеЗаполнено(ПарольАдминистративногоРежима) Тогда
		Элементы.УстановитьПароль.Заголовок = НСтр("ru = 'Изменить пароль'");
	Иначе
		Элементы.УстановитьПароль.Заголовок = НСтр("ru = 'Установить пароль'");
	КонецЕсли;
	
	Элементы.Пароль.Видимость = ЗначениеЗаполнено(УстановленныйПароль) И НЕ АдминистративныйРежим;
	
КонецПроцедуры

#КонецОбласти

#Область ОриентацияЭкрана

// ОриентацияЭкрана
&НаСервере
Процедура ПриИзмененииПараметровЭкранаСервер()
	
	ОбщегоНазначения.УстановитьОриентациюЭкрана();
	НастроитьФормуПоОриентацииЭкрана();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОриентацииЭкрана()
	
КонецПроцедуры

#КонецОбласти

